{"TYPE": "document", "VALUE": [{"TYPE": "body", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}, {"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Developmental Review 39 (2016) 1-15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Contents lists available at ScienceDirect"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 280, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Developmental Review"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "journal homepage:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "How approximate and exact number skills are related to each other across development: A review☆"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 1728, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Christophe Mussolin *, Julie Nys, Jacqueline Leybaert, Alain Content"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 2304, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Center for Research in Cognition and Neurosciences, Laboratoire Cognition, Langage et Développement, Université Libre de Bruxelles, avenue F.D. Roosevelt 50, B-1050 Brussels, Belgium"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 1728, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A R T I C L E"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "I N F O"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 110, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A B S T R A C T"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 614, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Article history: "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Received 14 June 2013 "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Revised 16 November 2014 "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Available online 6 November 2015"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 720, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Keywords: "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Number "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "ANS "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Approximate number skills Exact number skills "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Development"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Human and non-human species possess a mental system of number representations that appears early in the lifespan and that sup-ports approximate number skills, such as numerical estimation or number comparison. With the later acquisition of language and of symbolic numbers, human beings also develop exact number skills that allow using numbers precisely, such as in counting and arith-metic. Whether the exact number skills are built on the approximate number skills or whether both abilities develop independently is debated in scientific literature. The current review points out the behavioural data which either support or challenge these contrast-ing proposals. In an attempt to provide a comprehensive overview of these mixed data, we carefully took into account the heteroge-neity of the available studies regarding the kind of tasks, stimuli or ages of assessment. The conclusions of this review highlight the ev-idence that phylogenetically determined approximate number skills and culturally acquired numerical abilities are related to each other across development. They also stress the need to consider the less explored hypothesis that the acquisition of exact number skills refines the approximate number skills, a perspective which opens new and promising avenues for future research."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 232, "right": 20, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "© 2016 Published by Elsevier Inc."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 26, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "☆ For the first two authors, the order of authorship in this article was determined alphabetically, as they contributed equally to this work. C.M. and J.N. wrote the paper. All authors discussed the manuscript."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "* Corresponding author. Center for Research in Cognition and Neurosciences, Laboratoire Cognition, Langage et Développement, Université Libre de Bruxelles, avenue F.D. Roosevelt 50 CP 191, B-1050 Brussels, Belgium. Fax: +32 2 650 22 09."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "E-mail address: christophe.mussolin@outlook.com (C. Mussolin)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "http://dx.doi.org/10.1016/j.dr.2014.11.001 "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "0273-2297/© 2016 Published by Elsevier Inc."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 4896, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Two ways for representing numbers"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Behavioural, neuroimaging, lesional, and developmental data converge to demonstrate the exis-tence of an approximate number system (ANS) which is used for the comprehension, manipulation, and estimation of large numerical quantities (Dehaene, 2009). This system relies on a noisy repre-sentation of number magnitudes, hence obeying the Weber-Fechner law according to which the sensitivity to a difference in stimulus intensity is proportional to the magnitude of that stimulus. One key signature of the ANS is the observation of scalar variability when participants have to estimate numbers of elements without counting. In such numerical tasks, the estimates and the variability in the estimates increase linearly as a function of the numerosity, leading to a constant coefficient of variation (Brannon, 2006; Opfer & Siegler, 2012; Whalen, Gallistel, & Gelman, 1999)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Another key signature of the ANS is the observation of ratio-dependent effects in tasks requiring comparing or detecting numerical differences between numerosities represented by visual elements, sounds, or actions. When participants were prevented from counting, their accuracy decreases as the ratio of the compared quantities approaches 1. These ratio-effects are observed in human adults with or without formal education (e.g., Pica, Lemer, Izard, & Dehaene, 2004), in pre-school children (e.g., Barth, La Mont, Lipton, & Spelke, 2005), and even infants (e.g., Xu, Spelke, & Goddard, 2005) and non-human animals (e.g., Dehaene, Dehaene-Lambertz, & Cohen, 1998), supporting the idea that the ANS is biologically determined. Further, ratio-effects change over the lifespan. In preferential looking para-digms with 2-day-olds, looking time was greater when viewing congruent associations between sounds and visual objects (e.g., 12 syllables and 12 objects) than incongruent associations (e.g., 12 syllables and 4 objects, i.e. with a 1:3 ratio), suggesting that newborns have an abstract representation of number (Izard, Sann, Spelke, & Streri, 2009). Other studies show that infants are sensitive to numerical varia-tions between large numerosities separated by a 1:2 ratio at 6 months (Lipton & Spelke, 2003; Xu & Spelke, 2000) but by a 2:3 ratio from the age of 9 months (Lipton & Spelke, 2003; Xu & Arriaga, 2007). Later, children are able to select among two sets of items the one which is the more numerous, with a precision that increases monotonically from a 2:3 ratio to a 6:7 ratio between the age of 3 and 6 years (Halberda & Feigenson, 2008). This ability improves again during adolescence until reaching the adult level of a 10:11 ratio (Halberda, Mazzocco, & Feigenson, 2008)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The \"internal Weber fraction\", which corresponds to the smallest ratio needed to reliably detect a difference between two numerosities at a particular stage of development, is taken as a reliable index of ANS acuity. Different studies reported a decline in the internal Weber fraction with age, leading the authors to suggest a refining of ANS precision over the lifespan, even if the number magnitude representations are still approximate (Halberda, Ly, Wilmer, Naiman, & Germine, 2012; Piazza, 2010). However, an alternative interpretation has been proposed. In nonsymbolic numerosity comparison, varying the number of elements inherently implies differences in the non-numerical visual param-eters of the stimuli, such as surface area, density, or perimeter. Some authors postulate that it is difficult to control for all of these visual cues that could, in turn, drive the decision (e.g., Gebuis & Reynvoet, 2012; Szucs, Nobes, Devine, Gabriel, & Gebuis, 2013). One could, thus, not exclude the possibility that, as age increases, participants develop more efficient strategies based on these non-numerical param-eters to apprehend the numerosities. Whether or not the improvement in ratio-effects purely reflects a gain of ANS acuity is, thus, still under debate."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "When children learn to count and then start to manipulate mathematical concepts, they acquire a new symbolic system for representing numbers. This system enables them to assign specific and exact tags to large numbers. Verbal counting implies the knowledge of the number words sequence (Fuson, Richards, & Briars, 1982) and the understanding of the conceptual principles inherent to counting (Gelman & Gallistel, 1978). The acquisition of counting skills is a long-lasting process that starts around the age of 2 and takes the child up to about the age of 6. Although most 3-year-old children can recite the ordered list of number words at least up to 6, it takes them several months to learn the mean-ings of these words (Wynn, 1990). English children acquire the meaning of the word ''one'' (one-knowers) about 6 months before the meaning of ''two'' (two-knowers) and about 9 months before the meaning of ''three'' (three-knowers) and of \"four\" (four-knowers). Once they have mastered the number words up to about \"four\", they appear to grasp the logic of the verbal counting system. At this moment, children become cardinal-principle knowers as they understand that each word in the"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "3"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2160, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "counting list refers to a unique cardinal value which is one higher than the value picked out by the prior word (Wynn, 1992). Note however that some recent studies have identified children who know what \"five\", \"six\" or other numbers means, but failed to respond to higher number words (Mussolin, Nys, Leybaert, & Content, 2012; Sarnecka & Lee, 2009; Wagner & Johnson, 2011). The understanding of the cardinality principle is considered as a key-step in the development of counting skills. In Western cultures, around the age of 5, children also start to distinguish Arabic digits from other symbols (Noël, 2001). They presumably learn that each numeral refers to an exact quantity thanks to recursive cor-respondences with sets of objects representing the cardinal value they convey."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Two main theories have been put forward to explain the relationships between the ANS and the exact number skills across development. Dehaene (1997) and Wynn (1992) argue that analogue number magnitudes could support the acquisition of symbolic number abilities. Gallistel and Gelman (1992) proposed a slightly different hypothesis by suggesting that the analogue magnitude system incorpo-rates the basic counting principles. Another view initiated by Carey (2001, 2004, 2009) postulates a relative independence between the learning of verbal numerals and the ANS. The idea is that the child ascertains the meaning of \"two\" from the interplay between the acquisition of natural language quan-tifiers and the visual attention system of parallel object individuation. By contrast, the child comes to know the meaning of larger number words such as \"five\" through a bootstrapping process - i.e., that \"five\" means \"one more than four, which is one more than three…\" - by integrating represen-tations of natural language quantifiers with the external serial ordered count list. Through the mastery of the successor function by a multiple-stage process (Sarnecka & Carey, 2008), the child under-stands how verbal numerals represent the natural numbers. Therefore, according to Carey's view, children need not map large numerals onto large analogue magnitudes to acquire their meaning. It is only after the acquisition of the cardinality principle that children would start to map number words to the ANS (Le Corre & Carey, 2007)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Our review addresses different questions about the relationships between approximate and exact number skills. The terms exact number skills are used through this paper to refer to the numerical abil-ities based on symbolic (verbal or Arabic) numbers (Dehaene, Spelke, Pinel, Stanescu, & Tsivkin, 1999; Hurford, 1987). The first question is whether symbolic numbers are acquired/processed indepen-dently of the ANS or not (see second section). The second question concerns the extent to which performance in tasks depending on the ANS is related to performance in tasks involving exact number skills, and, in particular, whether the first one could predict the latter one (see third section). From an ontogenetic perspective, data from infants, children, and adults favour a development of ANS pre-cision across lifespan. Our third question is, thus, whether a part of the refinement of the ANS could be attributed to the learning of exact number skills (see fourth section)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Is the acquisition/processing of symbolic numbers dependent on the ANS?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "In the two following sections, we will review the data that examine the question of whether the symbolic numbers are acquired/processed independently of the ANS or not. Focus will first be put on number words, then on Arabic digits."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 26, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The acquisition and processing of number words"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Some researchers assume that preverbal approximate number representations may serve as a foun-dation upon which counting is built (Dehaene, 1997; Gelman & Gallistel, 1978; Wynn, 1992) while others postulate that the acquisition of the meaning of number words is independent of the ANS (Carey, 2001). One way to disentangle the two hypotheses is to look for the moment at which children's verbal estimates of numbers show evidence of scalar variability as the signature of the ANS. In particular, it is important to examine whether this property appears before or after children figure out the cardi-nal value represented by each number word. The rationale is the following: if the ANS plays a role in the acquisition of number words, verbal estimates should increase with numerosities but they should also become more variable, hence resulting in a constant coefficient of variation. Importantly, this should be the case even for numbers that fall beyond the child's level of cardinality proficiency. By contrast,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "4 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "if the acquisition of number words is independent of the ANS, verbal estimates should be character-ized by scalar variability only after the cardinal values of number words have been figured out."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Le Corre and Carey (2007) examined performance of 2-, 3- and 4-year-old preschool children who had to verbally estimate the number of elements in sets of 1-10 items without counting. Although all children could recite the number words up to \"ten\", the majority of them had not acquired the counting principles for the entirety of their counting list, but only knew the exact meaning of \"one\",\"two\", \"three\", or \"four\" as determined by their performance in the give-a-number task (Wynn, 1990). For small sets of one to four objects, these children successfully applied increasing number words to increasing numerosities, but they failed to apply larger numerals to larger sets when they were pre-sented with numerosities that exceeded their level of cardinal knowledge. Importantly, half of the children who knew the exact meaning of each number word of their counting list failed to produce estimates that increase linearly with numerosity for sets beyond four. These \"non-mappers\" were significantly younger than the \"mappers\". Further, both mappers and non-mappers produced estimates between 1 and 4 with increasing coefficients of variation, thus showing non scalar variability. These findings were interpreted as evidence that number words are not immediately mapped onto the ANS once labels are acquired, but only some months after the counting principles are mastered."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Lipton and Spelke (2005) provided other evidence that the acquisition of counting abilities pre-cedes the mapping between number words and approximate number representations. Their results showed that 5-year-old unskilled counters who could not produce a correct verbal number sequence beyond \"sixty\" gave verbal estimates that increased linearly with numerosity for sets smaller than sixty (20-60), but provided estimates that were unrelated to numerosities when tested above their counting range (80-120). By contrast, skilled counters who could count to \"one hundred\" performed well on this task. These findings were interpreted as showing that children link particular number words to approximate number representations as soon as these verbal numerals are known as a part of the verbal number sequence."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 24, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The above studies show that the mapping between number words and ANS appears only after the ac-quisition of cardinality knowledge and after a certain level of counting skills. Contrasting results have been obtained more recently with paradigms designed to be more finely adjusted to the age or to the compe-tencies of the children. In order to examine whether small number words are mapped onto the ANS in very young children, Wagner and Johnson (2011) used a mapping task that did not imply any verbal pro-duction but required to put small numbers of items varying between 1 and 10 repeatedly into a container in response to verbal number requests. Contrarily to previous findings, 3- to 5-year-old children who had not yet acquired the cardinality principle provided responses that were characterized by scalar variabil-ity (i.e., mean responses and variability increasing with set sizes; see Fig. 1A). Importantly, this was the case for all the number words, even for those whose corresponding cardinal value was not yet mastered. Overall, by using a paradigm that was more adapted to the preschool children competencies, the authors found signs of ANS in children's responses before they fully understood the corresponding cardinal values."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Barth, Starr, and Sullivan (2009) reported similar conclusions regarding large number words. The authors used the same paradigm as in Lipton and Spelke (2005), but in this study, the classification of 5-year-old children was more sensitive to the children's counting skills. Barth et al. (2009) divided the unskilled counters into two groups, which allowed them to have a finer insight of the verbal es-timates produced by these children. As demonstrated previously, the verbal estimates produced for large sets (60-140) increased with numerosity in the skilled counters who counted successfully to\"sixty\" or above (Level 3 counters), but not in children who made counting errors above \"thirty-five\"(Level 2 counters). Interestingly, in unskilled counters who made counting errors below \"thirty-five\"(Level 1 counters), the estimates for large sets showed the signature of the ANS (i.e., estimates in-creased and coefficient of variation remained constant with increasing set sizes), suggesting that even children with relatively weak counting skills map large number words falling beyond their counting range onto approximate number representations."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 24, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The acquisition and processing of Arabic numbers"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "It is widely assumed that manipulating Arabic numbers activates the same mental number line that encodes nonsymbolic numerosities, even though these symbolic numbers are used to refer to"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "5"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2160, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fig. 1. Graphs illustrating that symbolic numbers are mapped onto the ANS in children, respectively for (A) verbal numerals: during a give-a-number task, both mean and standard deviation of preschoolers' estimates increase with number, leading to the scalar variability signature of the ANS (data from Wagner & Johnson, 2011); and (B) Arabic digits: relative to the congru-ent condition, both response times and error rates increase when the numerical values of Arabic digits are incongruent with their physical size, leading to the size congruity effect (data from Mussolin & Noël, 2008)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 36, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "exact quantities (Dehaene, 1997). Indeed, when participants have to compare Arabic numbers, both the numerical distance effect (e.g., deciding that 8 is larger than 5 is easier than deciding that 8 is larger than 7) and a numerical size/magnitude effect (e.g., deciding that 4 is larger than 3 is easier than de-ciding that 8 is larger than 7) are reported (Moyer & Landauer, 1967). These effects are taken as evidence that Arabic numbers are mapped onto analogue approximate number representations whose overlap increases with increasing number magnitudes, hence suffering from the same imprecision as numerosities (Dehaene, 1992). Regarding development, both behavioural (Duncan & McFarland, 1980; Girelli, Lucangeli, & Butterworth, 2000) and neuroimaging (Temple & Posner, 1998) data indicate that children are able to compare the magnitude of Arabic digits from the age of 5-6, and that their performance is influ-enced by the numerical proximity like adults. Moreover, the time needed to compare Arabic digits decreases with age, especially for pairs in which numbers are numerically close. Consequently, the slope of the numerical distance effect becomes less steep with age (Holloway & Ansari, 2009; Sekuler & Mierkiewicz, 1977). It is however not yet clear whether these developmental changes reflect a pro-gressive refinement of the acuity with which Arabic numbers are accessed/discriminated or an"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 30, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "improvement of an unspecific cognitive process tapping the comparison stage. Besides the effects re-ported in number comparison, other tasks offer evidence that Arabic numbers are learned by mapping them on the approximate number representation. In physical number line tasks, participants have to estimate the position of Arabic numbers on physical number lines ranging from 0 to 100 or from 0 to 1000. Data indicate that there is a shift during the development from logarithm-based estimations, supposed to depend on the number magnitude representation, to linear-based estimations learned during schooling. This change arises between 6 and 8 years for 0-100 numbers, and between 8 and 11 years for 0-1000 numbers (for a review, see Opfer & Siegler, 2012)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Furthermore, the access to the number magnitude conveyed by Arabic digits seems to be evoked automatically, even when the magnitude information is not required to perform the task. For in-stance, deciding that the physical size of 8 is larger than that of 5 is easier than deciding that the physical size of 5 is larger than that of 8 (see Fig. 1B), suggesting that the task-irrelevant numerical informa-tion is activated and interferes with the task-relevant physical information. The so-called size congruity effect has been consistently observed in adults (e.g., Tzelgov, Meyer, & Henik, 1992) but also in chil-dren from the age of 7-8 (Girelli et al., 2000; Rubinsten, Henik, Berger, & Shahar-Shalev, 2002), that is, about 1-2 years later than the age at which they are able to compare the magnitude of these digits explicitly. In such interference paradigms, results are more mixed regarding the presence or not of the numerical distance effect. While some authors found no impact of numerical distance when chil-dren had to judge the physical size of two Arabic numbers (Rubinsten et al., 2002), others demonstrated the presence of a reverse distance effect with faster response times for pairs of small distances rela-tive to pairs of large distances (Girelli et al., 2000). Compatible with this, another study reported a modulation of the size congruity effect by the numerical distance, with the observation of a numer-ical interference effect in physical judgment only when the Arabic numbers were separated by a large numerical ratio (Mussolin & Noël, 2007). This suggests that the approximate number representa-tions are evoked automatically and that they interfere with the physical information at least when the magnitude number information is sufficiently salient. In adults, the numerical value of Arabic numbers not only has an impact on performance in physical comparison but also in spatial (Calabria & Rossetti, 2005; de Hevia, Girelli, & Vallar, 2006) and luminosity (Cohen Kadosh & Henik, 2006) com-parison, as well as in cooperation games like iterated prisoner's dilemma (Furlong & Opfer, 2009). Although similar interference effects have been more rarely tested in children, it seems that children need several years of experience with Arabic numbers to be influenced by their numerical value (de Hevia & Spelke, 2009)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The SNARC effect (i.e., the Spatial-Numerical Association of Response Codes effect; see Dehaene, Bossini, & Giraux, 1993) has been originally interpreted as another evidence of the signature of the number magnitude representation in symbolic number comparison. When adults and children as early as 7 years judge the numerical value or the parity of Arabic digits centrally presented, they are faster to respond to small numbers with their left hand than with their right hand, and faster to respond to large numbers with their right hand than with their left hand (Fias & Fischer, 2005; van Galen & Reitsma, 2008). According to Dehaene and colleagues (Dehaene et al., 1993), the SNARC effect reflects the left-to-right orientation of the mental number line (for an alternative view, see Bae, Choi, Cho, & Proctor, 2009)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The acquisition and processing of symbolic numbers: summary"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The question of how the number words are learned by preschool children is in debate. Current data do not converge on whether number words beyond \"four\" are mapped onto approximate number rep-resentations before or after the acquisition of the cardinality principle. While Le Corre and Carey's results suggest that the mapping occurs about 6 months after children know the exact value of number words, Wagner and Johnson (2011) provide evidence that children who had not yet acquired the car-dinality principle are able to produce larger estimates for larger numerosities. This contradictory pattern of results could be partly due to methodological differences. The task used by Wagner and Johnson (2011) did not require verbal production and could be more appropriate to capture performance of preschool children. To reconcile the findings, one could postulate that the mapping between number words and approximate number representations is influenced by the acquisition of the count"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "7"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2164, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "sequence through a progressive process that implies different developmental stages. Preschoolers could first produce larger verbal estimates for larger sets, then experience a period of instability to finally form a mapping similar to that of adults."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 22, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Regarding the acquisition of Arabic numbers, children as young as 5-6 years show different psy-chophysical effects in number comparison, suggesting that these numerals are mapped onto approximate magnitude representations early in the development. In summary, the available data seem to indi-cate that the acquisition and understanding of symbolic numbers do not develop independently of the ANS, but rather are closely connected with it."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 24, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Is performance in numerosity comparison related to exact number skills across individuals?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The acuity of approximate number representations is typically assessed by measuring perfor-mance in numerosity comparison task. The accuracy, response times, the Weber fraction, and the numerical distance or ratio effect when participants compare two sets of visual elements are sup-posed to reflect the precision of magnitude representations within the ANS. In the following, we examine the empirical evidence about the relationships between performance in numerosity comparison and exact number skills, that is, counting and arithmetic."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Counting proficiency and performance in numerosity comparison"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Studies that looked for relationships between counting skills and ANS reported mixed results. While some studies did not find such an association (Huntley-Fenner & Cannon, 2000; Slaughter, Kamppi, & Paynter, 2006), a few others reported a link between performance in numerosity comparison and counting ability in children before formal education. Brannon and Van de Walle (2001) tested 2- and 3-year-old children on their ability to choose the more numerous of two sets involving numerosities between one and six. The group of children who never provided a correct cardinal response in either\"how many\" or \"what's on this card\" task was at chance on the comparison task while the group of children who gave at least one correct cardinal response performed well above chance1. Though the causal nature of the link could not be firmly established, the authors made the hypothesis that, with the acquisition and manipulation of verbal number words, numerical information could become a salient dimension of the child's environment, and hence could facilitate approximate number discrimination."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A similar relationship was observed when preschool children had to compare larger numerosities varying along 1:2, 2:3, or 3:4 ratios rigorously controlled for non-numerical perceptual variables (Rousselle, Palmers, & Noël, 2004; Wagner & Johnson, 2011). For instance, Rousselle et al. (2004) showed that 3-year-olds with poor counting abilities were unable to discriminate visual collections above chance on the basis of number when the contour or the aggregate surface was controlled, whereas 3-year-olds who had already acquired a minimal level of counting proficiency did well. However, it is worth noting that even among children who already had cardinal knowledge, some were still unable to dis-criminate numerosities on the sole basis of number. Note that children performed above chance when non-numerical visual parameters other than surface were controlled for, supporting the view that at this age children were able to succeed on an overt comparison task. Therefore, the fact that some chil-dren have developed certain counting skills while they are still not able to perform approximate number discrimination is consistent with the interpretation that the acquisition of counting knowledge pre-cedes the refinement of the ANS."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1 Given that the ANS is supposed to appear in the first year of life, it could be surprising that a so large number of preschool children fail to perform above chance in approximate number comparison tasks, even for easy ratios in certain conditions. An explanation might be that succeeding in such kind of task requires not only to possess a sufficiently well-developed ANS, but also to clearly understand quantifier words such as \"more,\" a verbal concept which is known to be very difficult to apprehend (e.g., Gathercole, 1985; Palermo, 1973). Furthermore, this task also requires extracting numerical information from other non-numerical perceptual dimensions, which is not easy for young children (e.g., Rousselle & Noël, 2008)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 24, "firstLine": 108}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "8 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Math achievement and performance in numerosity comparison"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "An emerging body of research examines whether performance in numerosity comparison is cor-related with math achievement, but current results are mixed (for a review, see De Smedt, Noël, Gilmore, & Ansari, 2013)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 30, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The first convincing evidence for a potential link between ANS acuity and math achievement was provided by Halberda et al. (2008). Fourteen-year-olds had to select the more numerous of two in-termixed dots patterns presented in different colours and involving numerosities from 5 to 16. By varying the ratio between the two sets (from 1:2 to 7:8), the authors were able to determine the Weber frac-tion of each participant, as an index of ANS acuity. The Weber fraction is expressed as the minimum change needed to detect a numerical difference between two stimuli. The higher the w, the flatter is the psychometric function, and the lower is the sensitivity to numerical differences. Data showed that differences in acuity measured at ninth grade retroactively correlated with scores on math achieve-ment tests from kindergarten to sixth grade, even controlling for speed of processing and general intelligence (see Fig. 2). These results indicate that the ability to detect numerical differences between numerosities at 14 years is closely related to symbolic math achievement from as early as 5 years old."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 30, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fig. 2. Estimated Weber fractions, as indexes of ANS acuity, are reported from different studies as a function of participants'age (white circle: Izard et al., 2009; white triangle: Xu & Spelke, 2000; white square: Lipton & Spelke, 2003; grey triangles: Halberda & Feigenson, 2008; grey circles: Piazza et al., 2010; grey lozenge: Libertus et al., 2011; grey square: Halberda et al., 2008; black lozenges: Inglis et al., 2011; black circle: DeWind & Brannon, 2012; black square: Libertus, Odic, & Halberda, 2012). Solid black line represents power fit. Colour panels illustrate some of the data indicative of the relationship between approx-imate and exact number skills across the development. (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 34, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "9"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2160, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "However, as acknowledged by the authors, these data did not provide any clue about the causal di-rection of the link and left open several interpretations."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Other studies (Holloway & Ansari, 2009; Lonnemann, Linkersdörfer, Hasselhorn, & Lindberg, 2011; Mundy & Gilmore, 2009) failed to report a significant negative relationship between mathematics and the numerical distance effect computed on small nonsymbolic numerosities (below 10). It is tempt-ing to suggest that, amongst the different indexes of ANS acuity, the numerical distance effect computed on nonsymbolic numbers is not the more sensitive one (but see Maloney, Risko, Preston, Ansari, & Fugelsang, 2010). However, this proposal does not explain why the numerical distance effect com-puted on symbolic numbers correlated with math achievement in the same studies. Alternatively, it is possible that the ANS is engaged in a lesser degree in the comparison of small numerosities rela-tive to larger ones. In fact, only one study using numerosities below 10 reported a correlation between accuracy in numerosity comparison and math achievement that approached significance (Mundy & Gilmore, 2009)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "It is only recently that further evidence of a link between performance in numerosity comparison and math ability has been reported. As illustrated in Fig. 2, the performance in approximate number discrimination evolves across the life-span with a sharp increase during the first years of life, fol-lowed by a progressive improvement until adults' level. Correlations between different measures of ANS acuity and standardized math scores were observed in children of 3-5 years (Libertus, Feigenson, & Halberda, 2011), in kindergarteners of 5-6 years (Gilmore, McCarthy, & Spelke, 2010) as well as in children of 7-9 years (Inglis, Attridge, Batchelor, & Gilmore, 2011). Interestingly, in each of these studies, the number comparison task always implied numerosities both below and above 10, suggesting that the use of large numerosities is probably more suitable to capture the link between ANS acuity and exact number skills."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 24, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Finally, a relationship between ANS acuity and math achievement has been reported in adults. However, the correlations were generally small (Guillaume, Nys, Mussolin, & Content, 2013; Libertus, Odic, & Halberda, 2012), and other studies failed to report such a significant link (Inglis et al., 2011; Price, Palmer, Battista, & Ansari, 2012). One possible explanation for these contrasting results is that comparison tasks varied on methodological aspects such as the number of dots, the control of non-numerical visual cues, or the time the displays are presented. It is also likely that the relation between the exact number skills and the ANS appears in a more subtle way in adulthood since adult's exact arithmetical skills were recently found to be associated with a more automatized access to the number magnitude information (Nys & Content, 2012)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Relationship between exact number skills and performance in numerosity comparison: summary"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Some results indirectly suggest that a link between counting proficiency and performance in nu-merosity comparison exists between the age of 2 and 5. Children who have some knowledge about the cardinality principle perform well above chance on visual numerosity comparison tasks (Brannon & Van de Walle, 2001; Rousselle et al., 2004) whereas children who have no conception of the car-dinality principle do not. Further evidence is provided by Wagner and Johnson (2011) who showed that the performance of preschoolers succeeding in numerosity comparison was positively related to individual differences in cardinality knowledge."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Another source of interactions appears with the learning of more elaborated number skills. The most recent lines of research seem to confirm the existence of a link between the preverbal ability to discriminate fine numerical differences between numerosities and later math achievement."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 26, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The nature of the relationships between approximate and exact number skills"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The current review strongly supports that the approximate and exact number skills are related during development, but the nature of this relationship remains partly undetermined. In the following section, we review the studies attempting to specify the direction of the link, and we then discuss the mecha-nisms that could underlie such a relationship."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "10 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The ANS: a basis for exact number skills?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "In the domain of number cognition, it is commonly assumed that the ANS constitutes the foun-dation for the acquisition of the exact number skills (Dehaene, 1997, 2001; Spelke, 2000). As seen in the present paper, support for this view comes from different sources. Behavioural performance in symbolic number processing showed the similar effects as in nonsymbolic number processing. Fur-thermore, although some neuroimaging experiments found subtle differences between the brain activity related to each of the two formats, the neural substrates for symbolic and nonsymbolic number pro-cessing are globally identical (Piazza, Pinel, Le Bihan, & Dehaene, 2007)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Recent years have given rise to many studies on the relationships between ANS acuity and math achievement. The findings converge to show positive correlation between different indexes of per-formance in numerosity comparison and scores on math standardized battery. Some current studies have tried to establish the causal direction of the relation. In children of 3-6 years, the correct re-sponse rate in numerosity comparison was related to math performance 2 years later (Mazzocco, Feigenson, & Halberda, 2011). The correlations remained significant when different measures of verbal knowledge, spatial reasoning, and lexical retrieval were partialled out. To investigate further the re-lationship between ANS acuity and math ability, Libertus and colleagues (Libertus, Feigenson, & Halberda, 2013) tested a large sample of 4-year-olds while taking individual differences on a standardized math battery into account. They found that accuracy in numerosity comparison contributed uniquely to the relationship with math ability 6 months later, even when controlling for the initial math score. As pro-posed by Halberda and colleagues (Halberda et al., 2008), this suggests that the ANS might have a causal role in determining individual math achievement. This hypothesis is also supported by recent work showing that training on nonsymbolic approximate number tasks led to improvements in ANS acuity in children (Hyde, Khanum, & Spelke, 2014) and adults (Park & Brannon, 2013). However, as we will discuss below, these results do not preclude the possibility that the learning of symbolic numbers have in turn an impact on the precision of the ANS."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Several mechanisms could underlie the influence of the ANS on the exact number skills. First, the ANS might guide the acquisition of counting skills, in particular, the order of the numerical se-quence, thanks to the isomorphism between analogue number magnitudes and the number word sequence (Gallistel & Gelman, 1992). Moreover, the learning and the differentiation of the successive number words could be easier if the corresponding approximate number representations are clearly distinct than if they are overlapping. Therefore, children whose ANS is more precise (i.e., less noisy) would learn the verbal counting list more quickly and/or more easily than children with noisier representations."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 26, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Second, the ANS could play a role in the early acquisition of arithmetical skills. Among the count-ing solving strategies that predominate in the beginning of arithmetical skills development, some are more economic. For instance, in the case of elementary addition (e.g. 2 + 4 = ?), the counting min strat-egy (Groen & Parkman, 1972) corresponds to incrementing from the larger digit the number of times indicated by the smaller digit (i.e., \"4, 5, 6\"), which involves fewer incrementation steps than other strategies such as counting all (\"1, 2, 3, 4, 5, 6\") or counting right (\"2, 3, 4, 5, 6\"). However, such an eco-nomic strategy implies determining the magnitude of each addend and selecting the largest one before proceeding to the incrementation phase. Therefore, quickly and efficiently accessing the approxi-mate number representations from symbolic numbers could facilitate the selection and execution of more efficient calculation strategies. The advantage of such magnitude-based strategies regarding the number of solving steps has also been reported for elementary subtraction (Gallistel & Gelman, 1992) and for complex addition (Guillaume et al., 2013; Nys & Content, 2010) in adults."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Finally, the ANS could also play a role in complex arithmetic, through the evaluation of the plau-sibility of the answer. In contrast to typically-developing children, children with mathematical disabilities are not positively influenced by the plausibility of the answer during arithmetic verification tasks (Rousselle & Noël, 2008). Furthermore, typically-developing children who evaluate the magnitude and the plausibility of their answer before responding get better performance during arithmetic solving and are more flexible during the strategy selection than children who do not resort to the ANS (Heirdsfield & Cooper, 2002, 2004). These findings suggest that the efficient use of accurate magnitude number representations could facilitate the acquisition of arithmetical skills."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "11"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2160, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The exact number skills: a role in the refining of the ANS?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Most researchers agree with the idea that symbolic numerals are mapped onto the approximate number representations, either from the beginning of their acquisition (Dehaene, 1997; Gallistel & Gelman, 1992; Wynn, 1992) or some months after the child knows their exact meaning (Carey, 2001, 2004, 2009). As raised previously (Opfer & Siegler, 2012), symbolic numbers emerged recently in human history, it is thus very unlikely that the brain evolved specifically to handle them. However, the ques-tion remains open whether the exact-to-approximate mapping could have an impact on the initial preverbal number system. Indeed, the properties of symbolic numbers may affect the ANS through different mechanisms. First, unlike nonsymbolic numbers, symbolic processing allows precision. Number words and Arabic numbers are not constrained by any upper capacity limit and have unrestricted pre-cision (Carey, 2004), allowing human beings to represent large numbers exactly, so that \"sixty\" for instance refers to the numerosity that is exactly one more than \"fifty-nine.\" Thanks to the fact that number words and Arabic numbers can be used to refer to discrete exact values, the learning of sym-bolic numbers leads children to gradually form representations of numbers that are more precise, with less overlap between magnitude representations."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A second factor that might play a role is the learning of arithmetic, which is a powerful drive to create relations across numbers and to promote their manipulation. Through the learning of arith-metic, people can also grasp the quantitative effects of number operations and how numbers are related. For instance, addition allows understanding that adding a positive number to another one always pro-duces a larger number whereas subtracting a positive number from another one results in a smaller number. Also through repeated arithmetic, people can better appreciate the constitutive compo-nents of the numbers. Overall, the strengthened use of numbers that occurs with the acquisition of the symbolic numbers and with arithmetic training could make the underlying number representa-tions more precise."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 24, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Although very few studies addressed this hypothesis, some data favouring a greater precision for the representation of symbolic numbers exist in the current literature. The first evidence comes from the model developed by Verguts and Fias (2004) which was aimed at simulating the learning of sym-bolic numbers. The system was first devoted to nonsymbolic numerosity processing, and was shown to account for the distance and size effects. In a second step, nonsymbolic and symbolic inputs were presented together to simulate the acquisition of number words or Arabic numbers by children. As a consequence, the neural network learns to represent the meaning of arbitrary symbols that inherit some of the properties of the initial nonsymbolic representation. This explains why children and adults show distance and size effects in symbolic number comparison. Of particular interest is the finding that the system also benefits from using symbols: \"…the number-selective filters act in a more finely tuned manner when provided with symbolic input compared with nonsymbolic input. Consequent-ly, the meaning of numerical symbols can be represented with more, but not absolute, precision\" (p. 1502). To explain these bidirectional influences between nonsymbolic and symbolic numbers, the authors assume that nonsymbolic inputs are transformed through an accumulation step (i.e., summation coding) before they can be mapped onto the number magnitude representations (position/label coding). As the noise in the summation coding increases in proportion with the number of inputs that are being summed, the nonsymbolic inputs activate a fuzzy representation of numerosity which leads to a mono-tonic numerical distance effect. By contrast, the symbolic inputs activate a more distinct and less noisy representation of numbers as the intermediate summation coding is not required."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "In line with the predictions of the model, empirical support for a greater precision in symbolic number processing was found in human adults and nonhuman primates. When human adults have to compare the magnitude of two number words or Arabic digits, they had a smaller distance effect than when they compared collections of dots (Buckley & Gillman, 1974). A similar pattern of results appeared in children from 6 to 8 years (Holloway & Ansari, 2009). Neurophysiological evidence for the existence of number-tuned neurons comes from single-cell recordings in macaque monkeys. In a series of experiments, Nieder and his colleagues (for a review, see Nieder, 2005) found neurons in the lateral prefrontal cortex and in the fundus of the intraparietal sulcus whose activity peaked when a particular numerosity was pre-sented and decreased as a function of distance from the preferred number. Moreover, when monkeys were trained to associate visual shapes with varying numbers of items, neurons showed a distance effect for"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "12 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "both numerical formats but the neural response was larger for the symbolic numbers than for the nonsymbolic ones (Diester & Nieder, 2007). As proposed by the authors, \"this might indicate a more precise encoding of numerical values represented by signs than by sets of dots\" (p. 2688)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The findings of Verguts and Fias (2004) are in line with the hypothesis of a finer representation - or a finer access to this representation - for symbolic numbers than nonsymbolic numbers, but they do not demonstrate an impact of exact number skills on the ANS acuity. More support is provided by the inves-tigation of performance in nonsymbolic number tasks in populations that did not receive math education. In particular, two Brazilian tribes have been studied for their limited numerical system. Pirahã have an impoverished verbal counting system with only a few words roughly corresponding to the concepts of\"one,\" \"two,\" and \"many.\" When they were presented with numerical matching tasks, members of the Pirahã tribe had relatively good accuracy with two or three items, but they responded poorly with quan-tities between 3 and 10. Beyond a set of three items, the variation of their estimates increases with the set size, resulting in a constant coefficient of variation (Gordon, 2004). Pirahã's performance in these tasks is thus comparable with estimates of preschool \"mappers\" of Le Corre and Carey's study (Le Corre & Carey, 2007). Number processing has also been assessed in the Mundurukù, an Amazonian indigene culture with little access to education (Pica et al., 2004). Although the Mundurukù lack words for numbers beyond 5, they are able to compare and add large approximate numbers far beyond their naming range. When asked to compare sets of 20-80 dots, controlled for various non-numerical variables, their performances were far above chance level and decreased with the ratio between quantities as French controls. However, whereas French adults' Weber fraction is around .12, Amazonian adults' average Weber fraction was .17, suggest-ing that the symbolic system allows humans to reach a finer ANS acuity."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Another line of research focused on participants with low literacy. Zebian and Ansari (2012) showed that, although illiterate adults were slower than literate ones in comparing numerosities below 10, no clear group difference was found in the slope of the numerical distance effect. Very different results are obtained when larger numerosities are used. Nys et al. (2013) reported that Western adults who had received no formal instruction in mathematics displayed longer response times, higher error rates, and a smaller numerical ratio effect in numerosity comparison than Western adults who benefited from math education. Altogether, these findings suggest that developing mathematic abilities could contribute to enhance the precision of the ANS."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Besides the above data collected with adults, there are few experiments on number development re-porting evidence for the gain of precision resulting from the acquisition of symbolic numbers. Some previous findings could be reinterpreted in the light of this hypothesis. In the number-line estimation tasks de-scribed previously, children who initially produce logarithm-based estimations provided estimates that followed a linear function just after receiving one trial of feedback on their estimates (Opfer & Siegler, 2007; Opfer & Thompson, 2008). This change could be seen as an effect of the calibration provided by the sym-bolic number. However, one cannot exclude the possibility of a change of strategy in the way children perform the task. To the best of our knowledge, the only direct data favouring a symbolic-to-ANS influence in chil-dren are gathered by our research group (Mussolin, Nys, Content, & Leybaert, 2014). We measured both symbolic and nonsymbolic number skills in children of 3-4 years within a 7-month interval. At each as-sessment, preschoolers' precision in comparing numerosities as well as their level of knowledge of number words and Arabic digits was measured. Comparing relationships between symbolic and nonsymbolic mea-sures across the two time points allowed us to examine the predictive direction of the link. Importantly, both cardinality proficiency and symbolic number knowledge predicted later accuracy in numerosity com-parison whereas the reverse links were not significant. These findings demonstrate for the first time that learning of symbolic numbers improves the precision of ANS. In this longitudinal study, we demon-strated that children of 3-4 years who started with a high level of cardinality proficiency and of knowledge about symbolic numbers were more accurate in a numerosity comparison task 7 months later than pre-schoolers who started with poorer symbolic number abilities. The reverse relationships did not hold when the correlations were controlled for general additional measures."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Concluding remarks and future directions"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A large body of evidence shows that the approximate number skills might constitute a founda-tion for later arithmetic skills. In light of the most recent advances in the field, the hypothesis that"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "13"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2160, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the exact number skills could also contribute to the refining of the ANS should not be neglected. Further investigation is needed to clarify bidirectional effects between the two systems of representation by examining more systematically their specific developmental trajectories. Through the use of longi-tudinal or training studies designs, future research will increase our comprehension of the interplay between both biologically and culturally determined numerical skills."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 26, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Acknowledgments"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The first author is supported by a grant from the National Fund for Scientific Research (Belgium). The authors declare no conflict of interest that might be interpreted as influencing the research, and APA ethical standards were followed in the conduct of the study."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 28, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "References"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Deeability of the approximate number system: effects of feedback and training. Frontiers "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "14 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "s."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Libee sense of number correlates with math scores on college-entrance examination. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Acta Psychologica, 141(3), 373-379."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Lonersdörfer, J., Hasselhorn, M., & Lindberg, S. (2011). Symbolic and non-symbolic distance effects in children "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "C. Mussolin et al. / Developmental Review 39 (2016) 1-15 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "15"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2160, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Pric, D., Battista, C., & Ansari, D. (2012). Nonsymbolic numerical magnitude comparison: Reliability and validity of different task variants and outcome measures, and their relationship to arithmetic achievement in adults. Acta Psychologica, 140(1), 50-57."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 24, "hanging": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Rouat counts? Influence of perceptual variables. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Sekerical inequality. Child Development, 48(2), 630-633. Spelke, E. S. (2000). Core knowledge. American Psychologist, 55(11), 1233-1243."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 432, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Wh). Non verbal counting in humans: the psychophysics of number representation. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Psychological Science, 10(2), 130-137."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}