{"TYPE": "document", "VALUE": [{"TYPE": "body", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "9251 SAGXXX10.1177/1046878120925133Simulation & GamingFjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 380, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Article"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 720, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Green Across the "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Board: Board Games as Tools for Dialogue and "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Simplified Environmental Communication"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 720, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "2020, Vol. 51(5) 632 -652© The Author(s) 2020"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1152, "right": 38, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 76, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Article reuse guidelines:  DOI: 10.1177/1046878120925133 "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 738, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 76, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Kristoffer S. Fjællingsdal1"}, {"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}, {"TYPE": "text", "VALUE": " and Christian A. Klöckner1"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 720, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Abstract"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 720, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Background. Board games are a promising, yet rarely used arena for learning about environmental issues. Existing research suggests that they are highly innovative communication tools that make complex sustainability problems more salient and easily understandable. To date, little to no research exists where several environment-themed board games have been compared in a single study."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1200, "right": 20, "hanging": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Method.17 respondents were invited to board game nights where they were tasked to play an environmental board game of their choosing. The respondents were then invited to participate in subsequent focus group interviews about their gameplay experience and learning outcomes."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1200, "right": 20, "hanging": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Results.5 focus group interviews were transcribed and subjected to a qualitative thematic analysis, revealing 2 main themes; the first revolving around board games as simplified environmental simulations and the second revolving around the players' perceptions of their own impact on the game board."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1200, "right": 20, "hanging": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Conclusion.Our results suggest that board games can be highly effective tools in some aspects of environmental communication. Limitations of the study and suggestions for future research are discussed."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1200, "right": 20, "hanging": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1Norwegian University of Science and Technology, Norway"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 720, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Corresponding Author: "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Kristoffer S. Fjællingsdal, Department of Psychology, Norwegian University of Science and Technology, Trondheim, Norway."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 720, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Email:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 720, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "633"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Keywords "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "board games, educational games, environmental communication, games for change, sustainability"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Background"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Scientific evidence for the increase in anthropogenic global warming is nearly unequivocal (Cook et al., 2013; Eisenack & Reckien, 2013), and due to the interwoven relationship between the environment and basic human needs such as food, health, energy, and security (Lakoff, 2010), the need for increasing public awareness of envi-ronmental issues is at an all-time high. Our ecological impact is increasingly notice-able: higher carbon emissions, deforestation and rapidly rising sea levels are just some of the indications that human life on Earth is threatened (McGonigal, 2011, p. 296). Innovative approaches to communicating about the detrimental effects of climate change are required for increasing public knowledge and consciousness surrounding a variety of environmental topics (Eisenack, 2012; Klöckner, 2015). One such approach comes in the shape of board games, which are shown to be effective learning tools in other fields such as health and medicine (Gauthier et al., 2019; Ogershok & Cottrell, 2004; van der Stege et al., 2010), therapy (Olsen et al., 2013) and a variety of class-room situations (Copeland et al., 2013). Board games such as SEttLERS Of Catan: OIL SpRInGS (Chappin et al., 2017), KEEp COOL (Eisenack, 2012) and GLOBaL WaRMInG (fennewald & Kievit-Kylar, 2013) have become popular in the field of environmental science, where they are primarily used to increase environmental knowledge and encourage debate surrounding environmental topics. to date, however, the empirical foundation surrounding the potential of environmental board games as educational tools is still lacking (Klöckner, 2015, p. 205) - despite the emerging trend of board games being used to clarify and educate about real-life problems (Wonica, 2015). this article therefore seeks to investigate how environmentally themed board games can be used as tools in generating environmental awareness."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Environmental Science Communication and Board Games"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Environmental issues are highly complex (Despeisse, 2018; Kollmuss & agyeman, 2002), distant and often framed as catastrophic or lacking scientific certainty in terms of their future global impact (Weingart et al., 2000). the explanatory climate change models that dominate environmental science are often met with public skepticism due to their perceived vagueness (Vatne, 2013, p. 43), and scientific language about cli-mate change and other environmental issues can be difficult for the general public to comprehend (fischhoff, 2007; Hassol, 2008). additionally, environmental decline is often a largely invisible entity (Hansen & Machin, 2013) that, once salient, is no lon-ger preventable. Being able to envision and imagine an environmental issue might"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "634"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "make them appear to be more pressing (Klöckner, 2015, p. 63; tversky & Kahneman, 1973, 1974), but traditional environmental communication rarely puts emphasis on the visual or tactile aspects of environmental decline. Consequentially, environmental sci-entists - justifiably criticized for being rather ineffective communicators towards lay-people (Hassol, 2008) - are calling for more approachable, illustrative and participatory forms of scientific communication surrounding the topic of environmental decline (Despeisse, 2018; Stanitsas et al., 2019; Stoknes, 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Board Game Tactility and Simplification of Reality"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "While board games are incapable of depicting the complexity of environmental issues in scientifically accurate detail, they can simplify them for laypeople (abt, 1987, p. 21), generate awareness surrounding environmental and social threats (García-Barros et al., 2015), illustrate complex systems (Castronova & Knowles, 2015; Cushman-Roisin et al., 2000) and involve the learners in complex situations where their deci-sions have a noticeable impact (Despeisse, 2018). they allow their players to interact with physical, tactile elements (Schell, 2008, p. 109; Woodbury et al., 2001; Woods, 2012, p. 161) rather than abstract, text-based representations of what environmental issues involve. the tactile and pleasurable nature of well-made board games is impor-tant (Kosa & Spronck, 2018) as it has been shown to encourage repeated play (Costikyan, 2002, p. 26; Xie et al., 2008) and, therefore, repeated exposure to the material the game seeks to teach, as well as making the game feel more 'real' (Rogerson et al., 2016). tangible pieces on a game board also tend to make the game more engag-ing and exciting (price et al., 2003) and more accessible than digital, screen-based interfaces (Mcnerney, 2004). additionally, physical components are occasionally shown to be better at making certain players understand the underlying engine of the game when compared to a digital game, where these physical components are removed (Rogerson & Gibbs, 2018). tactility, therefore, is certainly an important enjoyment component to consider when wanting to apply a board game in an educational setting, as it may have some beneficial impact on learning outcomes as well."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Board Games and Socialization"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Game-based simulations also provide a safe, social arena in which people can experi-ence simulated success and failure through their actions, which makes them more capable of applying these experiences in later activities (Cushman-Roisin et al., 2000). More of a necessity rather than a general gameplay element, the social aspect of board games could be considered the primary factor as to why people enjoy playing them (Woods, 2012, p. 167). Social interaction with other players during the gameplay ses-sions allows for both competition, cooperation and collaboration (Zagal et al., 2006), and in an educational setting it allows the researcher to observe the players as their gameplay session unfolds."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "635"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Board Games in Sustainability Education"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Board games are often considered a primitive pastime (Woods, 2012, p. 8), which often requires a large investment of both time and energy to conduct (Rogerson & Gibbs, 2018). they are also among the oldest known sources of human cross-culture entertainment, with some board games such as the Egyptian board game Senet and the nordic hnefatafl games dating back several centuries or even millenia (Sebbane, 2001). While games with an environmental focus date back little more than 30 years (Eisenack & Reckien, 2013) they have recently stirred interest among sustainability researchers and educators - albeit primarily in the form of digital games such as fatE Of tHE WORLD (Roberts, 2011) and ECO (Krajewski, 2018). Despite being over-shadowed by their digital counterparts in terms of popularity in contemporary research, environmental board games cover a variety of topics. Some, like tHE CELSIuS GaME (Carreira et al., 2017) attempt to visualize climate change issues on a holistic level to illustrate their interconnected complexities. Others focus more on specific aspects of climate change, such as the water resource adaptation game WatER aRK (Cheng et al., 2019) and tHE faRMERS (fennewald & Kievit-Kylar, 2013), which revolves around the use of shared resources. Such board games, much like certain forms of art (Ramachandran, 2011, p. 197), have the ability to distort and exaggerate reality and generate meaningful experiences for their audience. they also allow play-ers to experiment with a variety of roles in a coherent narrative (arnaudo, 2018, p. 27) within the safe confines of the game world (García-Barros et al., 2015). this is found to be a trigger for attitude change in certain settings (Elms, 1966) as well as allowing for exploring opposing perspectives (Klöckner, 2015, p. 206). furthermore, games can create microworlds (Egenfeldt-nielsen et al., 2013, p. 237) where the players learn through \"doing\" and \"being\" rather than passively absorbing information, as well as allowing for the envisioning and portrayal of alternate futures and realities (Barreteau et al., 2007; Cushman-Roisin et al., 2000; Wu & Lee, 2015). In a more traditional classroom setting, the learner will usually passively absorb information from a knowl-edgeable source and be expected to remember and understand the instructions they are provided (Dieleman & Huisingh, 2006; Krathwohl, 2002, p. 214). practical applica-tion of the obtained knowledge is often not prioritized (Kolb, 1984). By contrast, as previously mentioned, game-based learning normally situates the learner in a micro-world where they can actively participate and interact with their environment (Egenfeldt-nielsen et al., 2013, p. 237). Games also provide a concrete visualization of the topic at hand, rather than forcing the learner to form a subjective, abstract con-ceptualization of it - meaning that they \"learn through doing and being\" (foltz et al., 2019), an experience-based learning approach (Rusca et al., 2012). Games can also engross and immerse the players by providing rich and immersive narratives, which in turn might affect real-world beliefs by making the gaming experience seem real (Green & Brock, 2000). Research also shows that having someone experience fic-tional stories about social dilemmas - i.e., a game's narrative - might influence their real-world judgments on them (Strange & Leung, 1999). this illustrates the difference between indirect (classroom) and direct (game or simulation) experience, where direct"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "636"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "experiences are demonstrably more effective in generating pro-environmental action (fazio & Zanna, 1981; Kollmuss & agyeman, 2002)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Board Games as Social Dilemma Simulations"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "until recently, researchers assumed that people did not possess sufficient knowledge about environmental problems and therefore also lacked the tools to circumvent them - thus making knowledge provision a viable strategy for behavioral change (Schultz, 2002). although games are effective at increasing knowledge, this alone is seldom enough to initiate pro-environmental behavior (abrahamse et al., 2007; frick et al., 2004; Hines et al., 1987; Kollmuss & agyeman, 2002; Staats et al., 1996). this is compounded by the finding that knowledge gained through traditional forms of learn-ing, especially in situations where the motivation to learn stems from a fear of failure (for example, studying for a test) also tends to be retained very rarely (Grolnick & Ryan, 1987; Lombardi, 2012). While a large quantity of available games are primarily aimed at providing knowledge, some are also designed to situate the players in social dilemmas - situations where the interests of the individual are in conflict with the interests of a group or collective (von Borgstede et al., 2013, p. 176). In a game-based social dilemma, players are often forced to consider whether they wish to prioritize their own gain and safety, or if they would rather act in the best interest of the player group as a whole. the use of games to study human behavior in social dilemma situa-tions has been conducted before, the most prominent example being an examination of how WORLD Of WaRCRaft players responded to a virtual plague that would wipe out entire servers (Lofgren & fefferman, 2007). the extent to which individuals care about their own and others' gains in a dilemma situation is known as their social value orientation, or SVO (Messick & McClintock, 1968), and can roughly be divided into an individualistic approach where a player tries to act alone with little to no communi-cation with the group, a cooperative approach where the player tries to establish active partnerships with other players and a competitive approach where the player's empha-sis is on defeating the other players (de Groot & thøgersen, 2013, p. 143). Compared to games focusing on collaboration, games in which the players are encouraged to act according to an individualistic or competitive SVO normally result in zero-sum victo-ries, where there is only one clear winner (fennewald & Kievit-Kylar, 2013)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Methods"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "as previously stated, the purpose of this study is to examine how four commercially available environment-themed board games can be used to generate environmental awareness. the project follows a qualitative research design following the framework of thematic analysis proposed by Braun and Clarke (2006). Since the overarching idea of using board games in environmental education is relatively new, and due to how the board game nights took place while the respondents were together in a physical loca-tion, exploratory focus groups as described by frey and Montana (1991) were utilized during the information gathering stage."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "637"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Recruitment and Sample"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Recruitment for the study was conducted through three facebook groups that were evaluated by the lead researcher as thematically relevant for the research project. Subsequent playtesting was arranged in two norwegian municipalities in the form of four board game nights where the respondents were given access to four board games with various environmental themes. Recruitment occurred through public facebook events hosted by the lead researcher, where detailed information about the study pro-cedure as well as ethical guidelines for anonymization and voluntary participation was provided. 18 respondents in the age range of 20 to 39 years joined the gaming sessions, of which 17 (n=17) participated in post-gameplay focus group interviews. 12 (70.6%) of the interviewed respondents were male, 5 (29.4%) were female. 11 (64.7%) respon-dents were either in the process of obtaining or already had a degree in higher educa-tion, defined here as a Ba degree or higher, and 2 (11.7%) of the informants additionally listed themselves as members of pro-environmental organizations. Each informant was given a codename, consisting of one letter (M or f) denoting their gender, and a number denoting their age (e.g. M35)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Games"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "although educators and game designers are often worlds apart in terms of their fields of interest (Gunter et al., 2008), making interdisciplinary game development a poten-tially frustrating and costly affair, a search for environmental board games did yield results. Each of the games that were chosen for the research project were selected due to their innate connection to the topics of environment, climate and sustainability. another selection criterion was that the games had to be in an analog format, as research into environmentally themed board games is scarce. for replication purposes, the games chosen for the project also needed to be commercially available or other-wise obtainable for researchers wishing to conduct future research into the use of board games in generating environmental awareness. the games chosen for the study were also largely developed as collaborative efforts between environmental educators and game designers, which is a deviation from games that are otherwise normally developed exclusively in academic, governmental or non-governmental institutions (Klöckner, 2015, p. 198). for each of the board game sessions, the participants were asked to choose a game that they all wanted to play together.1 this section will provide a short description of the games that were used in the study, as it is necessary to under-stand the basics of a game in order to also conceptualize how the respondents interact with them (Waddington & fennewald, 2018)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Game 1 - The SeTTleRS oF CATAn: oil SpRinGS"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "tHE SEttLERS Of Catan, or simply Catan (teuber, 1995) is a hobby board game (arnaudo, 2018, p. 196) revolving around building civilizations from natural resources produced on the island of Catan. the player who is first to reach 10 points,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 20, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "638"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "achieved by building settlements and cities as well as having the longest road and big-gest army, wins the game (Boardgamegeek.com, 2019a). In order to reach this goal, players need to trade resources with each other. However, every trade the players com-plete will help not only them, but also their opponent, quickly leading to a conflict of interest between diplomacy and self-interest (Salen & Zimmerman, 2004, p. 388). Due to its long-standing popularity, Catan has become the subject of several fan-made expansions, one of which is the OIL SpRInGS SCEnaRIO (assadourian & Hansen, 2011) where oil is introduced as an additional resource and game mechanic. Oil can make the players' settlements grow faster and speed up their path to victory but can also cause environmental damage and climate devastation if abused - resulting in all players losing the game (Boardgamegeek.com, 2019b; Chappin et al., 2017; Lee, 2017). the OIL SpRInGS SCEnaRIO revolves around a mechanic where the players who choose to utilize oil are more likely to achieve victory than players who refrain from using it (Lee, 2017), simultaneously risking the livelihood of the whole island. as the game revolves around the use of oil as a powerful resource, we feel that it illus-trates and simulates a relatively realistic scenario in which the players need to balance their own personal and financial interests versus the interests of the player group as a whole. It is left to the players to decide if they wish to emphasize saving the island of Catan, or if a personal victory is more important (Chappin et al., 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Game 2 - evoluTion: CliMATe"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "EVOLutIOn (Crapuchettes, 2014) is a game where the players are set to adapt and evolve their own species in a changing ecosystem, taking on roles as carnivores and herbivores as well as developing new biological traits such as horns or hard shells to survive (Boardgamegeek.com, 2019c). the expansion pack, EVOLutIOn: CLIMatE (Crapuchettes, 2016), introduces a climate component where the temperature in the game world can swing between extreme cold and extreme heat, which results in the deaths of species that are not adapted to survive in the current climate (Boardgamegeek. com, 2019d)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Game 3 - GloBAl WARMinG"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "GLOBaL WaRMInG (Bucak, 2011) is an educational card-based strategy game where the players score \"happiness points\" by providing a variety of goods to the public, which in turn influence the earth's ecology (Boardgamegeek.com, 2019e). In order to provide these goods, oil needs to be gathered and used by placing oil rigs on a map. Eventually, the player who has obtained the highest amount of happiness points wins the game, unless the players have collectively amassed too much pollution. If this is the case, the player who has polluted the least is the winner (fennewald & Kievit-Kylar, 2013). the overall level of pollution as well as each individual player's level of pollution is shown as separate markers on the game map, and if these markers move past certain points, bad things will happen to the game's ecology as well as the players themselves (Boardgamegeek.com, 2019e)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "639"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Game 4 - Keep Cool"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "KEEp COOL (Eisenack & petschel-Held, 2004) is a climate negotiation game where each player takes on the role of a country or nation with a unique set of economic interests, goals and abilities (Boardgamegeek.com, 2019f). the actions required by the players to reach these goals also result in greenhouse gases, and they all lose if the global temperature gets too high (fennewald & Kievit-Kylar, 2013). the players need to decide each round if they want to implement climate protection measures, which benefit all players, or if they would rather act in their own interest in order to reach their own goal faster. the first player to reach their goal wins, but a complete lack of cooperation with the other players will result in global environmental collapse (Boardgamegeek.com, 2019f)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 22, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Research protocol"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "to initialize the project, the lead researcher arranged board game nights through public facebook events. Information about the project was provided in the event description, whereas detailed guidelines regarding ethical concerns and the purpose of the research were given to each respondent as a separate document through facebook's Messenger client. four board game nights were arranged across two norwegian municipalities, where the respondents were observed by the lead researcher during gameplay. two of the board game nights were filmed; the remaining two were voice recorded. Each board game night was arranged as a tissue testing session, a procedure where the play testers have never interacted with the game before (Schell, 2008, p. 394), and lasted approximately 2 hours. Once the play session was concluded, the respondents were organized into focus groups where the lead researcher asked them a series of open-ended questions (table 1) about their experience with the game. the questions were primarily asked in norwegian and repeated in English during sessions where non-native speakers were present. Variations in the line of questioning did occur, depend-ing on their relevance to the game that was being played. Respondents were also encouraged to ask questions in return to the lead researcher in case they needed clari-fications. the responses were recorded with voice recording hardware, and then tran-scribed by the lead researcher. a total of 5 focus group interviews were conducted, and each session lasted between 30 and 60 minutes. One of the games, GLOBaL WaRMInG (Bucak, 2011), was played twice using the same respondents."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the resulting transcriptions were subjected to a qualitative thematic analysis inspired by the framework provided by Braun and Clarke (2006). the lead researcher repeatedly re-read the transcripts to get acquainted with the datasets, and made custom notes in sections where the informants made statements of interest to the study. these notes formed the basis for qualitative codes, which were clustered in an Excel docu-ment and used to form thematic categories. During the subsequent thematic integra-tion procedure, certain subthemes were omitted due to low levels of occurrence in the datasets. Eventually, a total of two main themes with a total of four underlying sub-themes were identified and incorporated into the final analysis."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 240}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "640"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ethical Guidelines"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the project has been registered at the norwegian Center for Research Data (nSD). Each participant in the project was provided a draft of the article, and a 14-day dead-line to provide constructive feedback on its contents to ensure the validity of the findings."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Results"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Main Theme 1 - environmental Board Games as Simplified environmental Simulations"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 1440, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the first main theme that was uncovered during our analysis revolves around board games as innovative and simplified portrayals of complex environmental issues. two subthemes emerged from the datasets - 1) Board games as simplified scientific com-munication about the environment, and 2) Board games as micro-level environmental simulators."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Subtheme 1 - Board games as simplified scientific communication about the environ-ment. Board games are theorized to be capable of simplifying the complexity of envi-ronmental issues (Schulze et al., 2015), thus making them more accessible for the general public. During our focus groups, several respondents noted that the games represented an intriguing and simplified alternative to overcomplicated science com-munication. M35 (SEttLERS Of Catan: OIL SpRInGS) commented on the mis-communication between scientists and laypeople:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"Researchers have been warning us about climate change for several decades but nobody listens to them, which might have something to do with the language they use. (. . .) and they haven't understood that. they present their facts and are stuck in the thought pattern that they are talking to their colleagues.\" (M35, SEttLERS Of Catan: OIL SpRInGS)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 264, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "f25 (GLOBaL WaRMInG) would later run a qualitative comparison between her gameplay session and a traditional lecture, also highlighting her perception of scien-tific language as overly complex:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"I'm struggling with aDD and asperger, so to sit still and listen to a teacher for 45 minutes, I. . . just disconnect after 5 to 10 minutes. (. . .) But something like this. . . you're sitting here, doing things, and you learn so much more at once.\" (f25, GLOBaL WaRMInG)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 264, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "M25 (GLOBaL WaRMInG) supports the aforementioned statements by additionally critiquing traditional media for what he perceives as unappealing coverage of climate change issues. He adds:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 20, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "641"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"If you're looking at an online newspaper or something, it says 'watch the climate' or something and you try reading it. . . it doesn't really stick. (. . .) this [the game] is simple enough that most people can comprehend it. But at the same time it shows enough for us to be able to understand it.\" (M25, GLOBaL WaRMInG)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 266, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "these remarks demonstrate that scientific language is difficult for laypeople to understand (fischhoff, 2007), and that new methods of communicating climate change are required (Despeisse, 2018; Stanitsas et al., 2019; Stoknes, 2017). they also illustrate that board games can be effective at simplifying climate change issues and making them more salient than more conventional communication channels (Schulze et al., 2015)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 20, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Subtheme 2 - Board games as micro-level environmental simulators. the full extent of environmental issues is complex (Despeisse, 2018; Kollmuss & agyeman, 2002), often intangible (Hansen & Machin, 2013; Kollmuss & agyeman, 2002) and difficult to conceptualize. these perceived complexities and vagueness (Vatne, 2013, p. 43) likely represent significant barriers towards pro-environmental behavior. In order to make environmental issues more salient and understandable, innovative and illustra-tive approaches are warranted (Stoknes, 2017). It is theorized that educational games might contribute to this issue by portraying reality in a highly concentrated and simpli-fied manner (abt, 1987, p. 21). Games function as microworlds, little sequences and participatory simulations depicting some aspect of reality, where the player is included as an actor with a clear responsibility and impact (Egenfeldt-nielsen et al., 2013, p. 237). In our study, the respondents did appear to experience the illustrative power of board game microworlds. M28 (KEEp COOL) notes how effective KEEp COOL is at simulating the complexities of intergovernmental climate debates and decision-mak-ing: \"If you were to translate this game into the real world, then this is on a very high level. It's like countries and continents we're talking about.\" In a similar vein, f25 (SEttLERS Of Catan: OIL SpRInGS) and M25 (GLOBaL WaRMInG) point to how board games are capable of depicting complex systems in general:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"It [the game] took a very big subject and gave it a small, concrete picture of it all, like you can explain the entire world with a small game. and then there's a lot of stuff you know from before, except you get it in a more concrete form right in front of you - \"oh shit, that's going to affect this and that.\" (f25, SEttLERS Of Catan: OIL SpRInGS)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 264, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"here in norway we try to think about the environment, but there are other countries in the world that are both better and worse than us in terms of environmental consciousness too. So it puts things into perspective when you have it right in front of you, and you can affect it yourself.\" (M25, GLOBaL WaRMInG)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 264, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Intriguingly, the respondents are also implying that the board game helped make the connection between their own actions and impacts on the game board more salient - thus suggesting that board games can be a step towards deconstructing climate change"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 20, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "642"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "as an invisible entity (Hansen & Machin, 2013) - by showcasing the direct link between one's personal actions and impact within a game-based safety net."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Main Theme 2 - individual impact and Resource Distribution"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the second main theme that was uncovered during our analysis revolves around how the players perceived the game-based visualization aspect of their own implemented strategies and personal impact on the gameplay sessions. additionally, the players would also reflect upon their strategies for distributing resources between themselves and the group as a whole. two subthemes emerged from the datasets - 1) Visualizing individual eco-impacts, and 2) personal gain vs. the common good."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 20, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Subtheme 1 - visualizing individual eco-impacts. Games center their players in a context where they learn through their own actions and presence in the game world (foltz et al., 2019) rather than passively absorbing and abstracting information from books and lectures. During our focus group interviews, several of the respondents mentioned either that they had already seen the effects their actions had on the game board, or they expressed a desire to get to a point in the game where they could. When asked about whether playing the game inspires him to counteract environmental issues in any way, M22 (KEEp COOL) notes that \"you think about it more. Because when you're actively doing something in a good session [of a game], it [the game's theme] goes through your head all the time.\" M35 (SEttLERS Of Catan: OIL SpRInGS) also became occupied with the game's ability to show direct cause and effect. He states that \"the time [in the game] is compacted. I did this fifteen minutes ago, and now I'm screwed up over there\", referring to how his actions on the board led to some clearly visible disastrous changes in his dominance in the game a short while later."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 20, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Intriguingly, in some cases it also appeared that the visual elements in the game served to steer the players' in-game behaviors. In the game GLOBaL WaRMInG (Bucak, 2011) for instance, a set of train miniatures illustrate the carbon emissions of each individual player, while one train is designed to represent the total amount of carbon emission by all players. f25 (GLOBaL WaRMInG) would comment on the presence of these trains, stating:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 20, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"for me it was these trains, that show. . . okay, it's fine that you can buy oil and move rigs and stuff, but. . . they were like, okay, if I do this now then the global warming will go way up. So if the trains hadn't been there it'd just be like, eh, I'll do what I want.\"(f25, GLOBaL WaRMInG)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "M25 (GLOBaL WaRMInG) added:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"We can't just think about ourselves - we need to think about the fellowship. I have contributed little to pollution, but you need to look at the others too.\" (M25, GLOBaL WaRMInG)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 264, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "643"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "these players had all encountered situations where they had performed an in-game move that later had salient effects. In cases where these occurrences were absent from the gameplay sessions, the respondents expressed frustration and disappointment that they never got to experience them. One likely explanation for this is that games essen-tially provide a safe arena where failure to achieve a goal or prevent a disaster keeps the game fun (McGonigal, 2011, p. 68). a game where the possibility of failure is at a minimum can quickly become boring. During the session with EVOLutIOn: CLIMatE (Crapuchettes, 2016), the interviewer observed that none of the players' in-game actions resulted in any serious climate change-related issues. When confronted with this during the focus group interview, f21 stated that she \"wanted to get there, just to see what happened\" with nods and sounds of agreement from the rest of her 5 fellow players, suggesting an innate curiosity in experiencing an in-game climate change disaster within the safe confines of the game."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Subtheme 2 - personal gain vs. the common good. a large number of environmental games on the market today revolve around the concept of zero-sum victories, where only one person wins and the others lose (fennewald & Kievit-Kylar, 2013). these types of games normally feature mechanics that in some way allow the players to attack and weaken one another, such as by damaging other players or otherwise imped-ing their progress in the game (Boardgamegeek.com, 2019g). By contrast, very few environmental games revolve around cooperation and collaboration in order to achieve a common goal. the games used in our study appear to largely reflect this trend, pri-marily due to what the respondents identify as a lack of incentives for in-game pro-environmental behavior. this imbalance made it excessively tempting for many of our respondents to exclusively utilize unsustainable resources in order to beat the others, thus falling into the SVO pattern of individualistic or competitive tendencies (de Groot & thøgersen, 2013, p. 143). f25 (SEttLERS Of Catan: OIL SpRInGS) attempted to \"not use any oil; just stay on the straight and narrow\", but once she realized that she was in last place she admitted to feeling tempted to follow their example: \"I really wanted to [use oil], because it went so damn slowly! I do have two houses there on the board though. . .\". One of her co-players then noted that the risk of refusing to use oil did not justify the potential rewards:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"I don't see any reason not to use the oil here. If the disaster hits all of us with an equal percentage of probability, and you'll only win by using oil, then of course you'll use a lot of oil in the beginning - until there are dangerous levels of pollution, that is. So even if you get a few points for being green, I don't believe you'll win when the oil is so strong. and I guess that's kind of how it is in reality too - that the profits are simply too big in comparison to what you get for being green.\" (M22, SEttLERS Of Catan: OIL SpRInGS)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 242, "right": 266, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "a similar tendency occurred during the KEEp COOL (Eisenack & petschel-Held, 2004) play session. unlike the other games we tested, KEEp COOL explicitly states that the relationship between personal gain and climate protection for everyone is one of the"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 22, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "644"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "main topics the game seeks to address (Boardgamegeek.com, 2019f). One of the require-ments to win a round of KEEp COOL involves achieving a certain number of factories on the board, and these come in either black or green variants. Black factories represent greenhouse gas-emitting energy production, while green factories represent low-emis-sion technologies. Removing black factories in favor of green ones is a core gameplay mechanic in KEEp COOL (Eisenack, 2012). One of the respondents, M28 (KEEp COOL), signified that the group had understood this: \"the more the climate is stressed, the harder it can hit us. So the game makes you think to build more green factories\". Despite this, the group overall appeared to prioritize building black factories due to their lower cost. M22 (KEEp COOL) comments: \"I went for the black ones! they were cheap-est.\" M28 (KEEp COOL) responds that he prioritized green factories, due to how it was one of his explicit requirements to win: \"It was one of my goals, but I also thought that I don't want the carbometer [an in-game element designed to measure the greenhouse gas emissions caused by the players and natural processes in the game (Eisenack, 2012)] to go any higher now.\" In a similar vein to the KEEp COOL and the SEttLERS Of Catan: OIL SpRInGS play sessions, the value of renewable energy appears to be overshadowed by the cheaper and more powerful non-renewable energy sources. additionally, due to their overall emphasis on zero-sum wins (fennewald & Kievit-Kylar, 2013), the level of cooperation between the players appears to be rather low."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Discussion"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Scientific communication about the complexity of environmental issues has largely been dominated by vague explanatory models (Vatne, 2013, p. 43) and overly advanced scientific language (fischhoff, 2007; Hassol, 2008). Researchers are calling for more accessible forms of scientific communication about the environment (Klöckner, 2015; Stoknes, 2017), and board games represent an innovative approach to this call. the purpose of our research was to examine how four commercially available environ-ment-themed board games can be instrumental in generating environmental aware-ness. Our results first and foremost show that board games are capable of simplifying an overly complex system of interconnected environmental issues that is normally presented by scientists in a way that laypeople have great difficulties understanding (e.g fischhoff, 2007; Hassol, 2008; Stoknes, 2017). they did this by engaging the players in microworlds (Egenfeldt-nielsen et al., 2013, p. 237) with visual and interac-tive elements that simulate the real world, allowing players to carry out roles and actions that have a noticeable impact on the in-game environment (as described by arnaudo, 2018, p. 27). Being able to visualize and experience environmental issues within the safe confines of the game is a unique way to immerse learners into the sub-ject of environmental literacy, and might even represent a possible solution to the problem of environmental issues being perceived as non-salient (Hansen & Machin, 2013; Klöckner, 2015, p. 63; tversky & Kahneman, 1973, 1974)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the second important finding in our study revolved around how players perceived the visual representation of their personal impact on the game session, as well as their"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 240}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "645"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "varying emphasis on resource hoarding versus resource distribution. firstly, board games were indeed shown to highlight and emphasize the interactions between each individual player and their impact on the flow of the game by situating them in fic-tional worlds (foltz et al., 2019). additionally, the players did occasionally experiment with other roles, personalities and identities than the ones they normally exhibit in a real-life setting (arnaudo, 2018, p. 27) as long as the game provided an arena for it. from a researcher's perspective, environmental board games can also be utilized to illustrate how players display different SVOs (de Groot & thøgersen, 2013, p. 143; Messick & McClintock, 1968) in social dilemma situations. Some of the players in this experiment exhibited highly individualistic or competitive SVOs, whereas others tried to collaborate and contribute to the common good. Some of the players even took on an active role where their expressed goal was to experience what would happen if the environment collapsed in the game. this suggests an innate desire to experience what previous research describes as alternate future realities (Barreteau et al., 2007; Wu & Lee, 2015), while simultaneously enjoying the benefits of the relative safety of the real world (García-Barros et al., 2015)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Board games are also interesting in the sense that they both allow and encourage social interaction between the players in a physical, real-life setting. While congre-gated in such a way, board games can serve as an enabler for discussion, as well as directing the players' attention to what is happening on the game board - thus ensuring a closer relationship between the player and what the game seeks to teach. for the environmental sciences, considering the complexity and interconnectedness of its many underlying facets (Despeisse, 2018; Kollmuss & agyeman, 2002), the use of a visual representation tool allowing for social dialogue and requiring intensive atten-tion in order to function is likely to encourage learning that can be retained on a higher level than traditional learning methods (Dieleman & Huisingh, 2006; Kolb, 1984; Krathwohl, 2002, p. 214) - especially for learners who might be experiencing prob-lems conceptualizing the abstract contents of a book or a lecture."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "It should be noted that there was a degree of variation between the selected games in terms of their ability to produce some form of learning outcome. a likely explanation for this discrepancy can be attributed to the degree of emphasis that the game places on environmental mechanics. KEEp COOL (Eisenack & petschel-Held, 2004), for instance, integrates them directly into its core design, whereas EVOLutIOn: CLIMatE (Crapuchettes, 2016) features the environmental aspect only as an expansion feature to its base game. this is hardly surprising, as the main emphasis when creating most com-mercial games is that they need to be appealing to interact and play with to ensure sales, meaning that the educational aspect is often underemphasized. also, due to the different topics brought up by the games, the nature of the learning outcomes also varied consider-ably. all of the games we tested dealt with climate change and environmental issues on a very holistic and general level and did not explicitly provide advice to the players on how to circumvent similar issues in a real-life setting. However, aside from EVOLutIOn: CLIMatE where the environmental aspect turned out to be rather shallow, the games all"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 240}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "646"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "functioned as simplified environmental simulations. they were also capable of illumi-nating the links between the players' actions and their impact on the environment, although the respondents noted that the topic was not new to them."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Conclusion"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Out of the four board games tested in this study, three of them appear to hold some promise in the context of generating environmental awareness. the only exception, EVOLutIOn: CLIMatE (Crapuchettes, 2016), had a climate component that was too disconnected from the core of the main game, and the players were unable to shift the in-game climate enough to experience any serious consequences of their actions. In sum, however, our main findings suggest that board games can be highly effective in illustrating and visualizing the connections between a player's actions and their impact on the game board. they can also be utilized by researchers to explore how players interact, compete and distribute or hoard resources in a social dilemma situa-tion. they also hold some promise as an answer to the call for more relatable, under-standable, concrete and simplified forms of communication about the environment and the social issues that environmental decline might cause."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "limitations and Future Research"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "While our study reveals some promising dawning indications for the effectiveness of board games in promoting environmental awareness, there are some limitations to the study that need to be addressed. firstly, due to the qualitative nature of the study, larger-scale triangulated and quantitative studies are required in order to get a more complete picture as to the extent of the effectiveness of environment-themed board game play. Secondly, board games can be very complex and difficult to get into. this means that the players often spend a significant amount of time discussing and explain-ing the rules, supposing that they are all unfamiliar with the games chosen for the game session. In our study, players using 20-30 minutes of the time schedule to under-stand the rules was not uncommon, and one group even cancelled their gameplay due to the rules being too complex. a lacking understanding of the rules also caused sev-eral of our respondents to call the lead researcher for help during gameplay, which also added to the length of the gameplay session. future researchers are therefore encour-aged to either use a moderator or instructor with previous knowledge of the game to explain the rules before gameplay is initiated, sending the rules out to the players before the gameplay sessions begin, or including a set amount of time in the play ses-sion for the players to discuss and explain the rules of the game. thirdly, our study did not prioritize post-game debriefing sessions due to taking place late in the evening. Debriefing sessions can be useful in clearing up any misconceptions the players might have, providing in-depth knowledge about the game's topic, as well as encouraging reflections and topical debates among the players."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "647"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Appendix"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Table 1. Interview Guide."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1. What are your thoughts on using games for educational purposes?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2. Why did you choose the game you ended up playing?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "3. What, in your opinion, is the main theme or topic of the game?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "4. Were the rules easy to understand?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "5. Was there anything about the game that you perceived as particularly good?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6. Was there anything about the game that you perceived as particularly bad?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "7. What do you think about the relationship between cooperation and competition in "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "the game?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "8. Do you feel that the game has taught you anything about our environment?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "9. Do you feel that the game gave you a greater degree of insight into how our "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "environment works?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 864, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "10. Do you feel that the game has inspired you to do something positive for the "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "environment in the near future? In that case; what?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 864, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "11. How do you feel the game has provided you with insight into how you can circumvent "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "environmental issues?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "12. Do you have any other comments about the game session?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Declaration of Conflicting Interests"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the authors declared no potential conflicts of interest with respect to the research, authorship,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "and/or publication of this article."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Funding"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the authors received no financial support for the research, authorship, and/or publication of this"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "article."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ORCID iD"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Kristoffer S. fjællingsdal "}, {"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Note"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "the participants were offered a larger selection of environmental board games, but the"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "four games described in the following section were the ones selected by the participants."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 364, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the complete selection of games offered was SEttLERS Of Catan - OIL SpRInGS,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 364, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "EVOLutIOn CLIMatE, GLOBaL WaRMInG, KEEp COOL, CO2 - the board game, BauM(M)LanD, and GREEn DEaL. Only the games chosen by the players are"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 364, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "described in the paper."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 364, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "References"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "abrahamse, W., Steg, L., Vlek, C., & Rothengatter, t. (2007). the effect of tailored informa-"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "tion, goal setting, and tailored feedback on household energy use, energy-related behaviors,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 324, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "and behavioral antecedents. Journal of environmental Psychology, 27(4), 265-276."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 324, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "abt, C. C. (1987). Serious games. university press of america."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "648"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "arnaudo, M. (2018). Studies in gaming. Storytelling in the modern board game: narrative "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "trends from the late 1960s to today. Mcfarland."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "assadourian, E., & Hansen, t. (2011). Catan SCenaRIoS: oIl SPRIngS. Catan GmbH. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Board game."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Barreteau, O., Le page, C., & perez, p. (2007). Contribution of simulation and gaming to natu-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "ral resource management issues: an introduction. Simulation & gaming, 38(2), 185-194."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Boardgamegeek.com. (2019a, May 20). Catan. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Boardgamegeek.com. (2019b, May 21). Catan SCenaRIoS: oIl SPRIngS. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Boardgamegeek.com. (2019c, May 21). evolutIon. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Boardgamegeek.com. (2019d, May 21). evolutIon: ClImate."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Boardgamegeek.com. (2019e, May 22). gloBal WaRmIng. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Boardgamegeek.com. (2019f, May 22). KeeP Cool. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Boardgamegeek.com. (2019g, July 10). take that. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Braun, V., & Clarke, V. (2006). using thematic analysis in qualitative psychology. Qualitative "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Research in Psychology, 3(2), 77-101."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Bucak, S. D. (2011). gloBal WaRmIng. Mücke Spiele. Board game."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Carreira, f., aguiar, a. C., Onça, f., & Monzoni, M. (2017). tHE CELSIuS GaME: an expe-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "riential activity on management education simulating the complex challenges for the two-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "degree climate change target. the International Journal of management education, 15, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "350-361. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Castronova, E., & Knowles, I. (2015). a model of climate policy using board game mechanics. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "International Journal of Serious games, 2(3), 1-15."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Chappin, E. J. L., Bijvoet, X., & Oei, a. (2017). teaching sustainability to a broad audi-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "ence through an entertainment game-the effect of Catan: OIL SpRInGS. Journal of "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Cleaner Production, 156, 556-568. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Cheng, p.-H., Yeh, t.-K., tsai, J.-C., Lin, C.-R., & Chang, C.-Y. (2019). Development of an "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "issue-situation-based board game: a systemic learning environment for water resource "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "adaptation education. Sustainability, 11, 1-17. Cook, J., nuccitelli, D., Green, S. a., Richardson, M., Winkler, B., painting, R., Way, R., Jacobs, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "p., & Skuce, a. (2013). Quantifying the consensus on anthropogenic global warming in the "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "scientific literature. environmental Research letters, 8, 1-7. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Copeland, t., Henderson, B., Mayer, B., & nicholson, S. (2013). three different paths for table-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "top gaming in school libraries. library trends, 61(4), 825-835. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Costikyan, G. (2002). I have no words & i must design: toward a critical vocabulary for games."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "In f. Mäyrä (Ed.), Proceedings of the Computer games and Digital Cultures Conference (pp. 9-33). tampere university press."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 322, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Crapuchettes, D. (2014). evolutIon. north Star Games. Board game."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Crapuchettes, D. (2016). evolutIon: ClImate. north Star Games. Board game."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "649"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Cushman-Roisin, B., Rice, n. J., III, & Moldaver, M. a. (2000). a simulation tool for industrial "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "ecology. Journal of Industrial ecology, 3(4), 131-144."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "de Groot, J. I. M., & thøgersen, J. (2013). Values and pro-environmental behaviour. In L. Steg, a. E. van den Berg, & J. I. M. de Groot (Eds.), environmental psychology: an introduction (pp. 141-152). BpS Blackwell."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 322, "right": 0, "hanging": 320}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Despeisse, M. (2018, april/May). teaching sustainability leadership in manufacturing: a "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "reflection on the educational benefits of the board game faCtoRy heRoeS [paper pre-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "sentation]. 25th CIRp Life Cycle Engineering (LCE) Conference, Copenhagen, Denmark. Dieleman, H., & Huisingh, H. (2006). Games by which to learn and teach about sustainable "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "development: Exploring the relevance of games and experiential learning for sustain-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "ability. Journal of Cleaner Production, 14(9-11), 837-847."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Egenfeldt-nielsen, S. E., Smith, J. H., & tosca, S. p. (2013). understanding video games: the "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "essential introduction (2nd ed.). Routledge."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Eisenack, K. (2012). a climate change board game for interdisciplinary communication and educa-tion. Simulation & gaming, 44(2-3), 328-348. Eisenack, K., & petschel-Held, G. (2004). KeeP Cool. Spieltrieb. Board game."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 66, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Eisenack, K., & Reckien, D. (2013). Climate change and simulation/gaming. Simulation & "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "gaming, 44(2-3), 245-252. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Elms, a. C. (1966). Influence of fantasy ability on attitude change through role playing. Journal "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "of Personality and Social Psychology, 4(1), 36-43."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "fazio, R. H., & Zanna, M. p. (1981). Direct experience and attitude-behavior consistency. In L. Berkowitz (Ed.), advances in experimental social psychology (Vol. 14, pp. 161-202). academic press."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 322, "right": 22, "hanging": 320}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "fennewald, t. J., & Kievit-Kylar, B. (2013). Integrating climate change mechanics into a "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "common pool resource game. Simulation & gaming, 44(2-3), 427-451."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "fischhoff, B. (2007). nonpersuasive communication about matters of greatest urgency: Climate "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "change. environmental Science & technology, 41, 7204-7208. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "foltz, a., Williams, C., Gerson, S. a., Reynolds, D. J., pogoda, S., Begum, t., & Walton, S."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "p. (2019). Game developers' approaches to communicating climate change. frontiers in "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Communication, 4, article 28. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "frey, J. H., & Montana, a. (1991). the group interview in social research. the Social Science "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Journal, 28(2), 175-187."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "frick, J., Kaiser, f. G., & Wilson, M. (2004). Environmental knowledge and conservation "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "behavior: Exploring prevalence and structure in a representative sample. Personality and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Individual Differences, 37(8), 1597-1613. García-Barros, L., García-Barros, R., Cruz-Morales, J., & Smith, J. a. (2015). When death "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "approaches: Reverting or exploiting emergent inequity in a complex land-use table-board "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "game. ecology & Society, 20(2), article 13. Gauthier, a., Kato, p. M., Kim, C. M. B., Dunwell, I., Walker-Clarke, a., & Lameras, p."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "(2019). Board games for health: a systematic literature review and meta-analysis. games "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "for health Journal, 8(2), 1-16. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Green, M. C., & Brock, t. C. (2000). the role of transportation in the persuasiveness of pub-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "lic narratives. Journal of Personality and Social Psychology, 79(5), 701-721."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "650"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Grolnick, W. S., & Ryan, R. M. (1987). autonomy in children's learning: an experimental and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "individual difference investigation. Journal of Personality and Social Psychology, 52(5), "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "890-898. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Gunter, G. a., Kenny, R. f., & Vick, E. H. (2008). taking educational games seriously: using "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "the REtaIn model to design endogenous fantasy into standalone educational games."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "educational technology Research and Development, 56, 511-537. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Hansen, a., & Machin, D. (2013). Researching visual environmental communication."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "environmental Communication: a Journal of nature and Culture, 7(2), 151-168. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Hassol, S. J. (2008). Improving how scientists communicate about climate change. eos, transactions, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "american geophysical union, 89(11), 106-107. Hines, J. M., Hungerford, H. R., & tomera, a. n. (1987). analysis and synthesis of research "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "on responsible environmental behavior: a meta-analysis. the Journal of environmental "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "education, 18(2), 1-8."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Klöckner, C. a. (2015). the psychology of pro-environmental communication: Beyond stan-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "dard information strategies. palgrave Macmillan."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Kolb, D. a. (1984). experiential learning: experience as the source of learning and develop-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "ment. prentice Hall."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Kollmuss, a., & agyeman, J. (2002). Mind the gap: Why do people act environmentally and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "what are the barriers to pro-environmental behavior? environmental education Research, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "8(3), 239-260. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Kosa, M., & Spronck, p. (2018, august). What tabletop players think about augmented table-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "top games: a content analysis [Conference session]. International Conference on the "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "foundations of Digital Games, Malmö, Sweden. Krajewski, J. (2018). eCo [PC game]. Strange Loop Games."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Krathwohl, D. R. (2002). a revision of Bloom's taxonomy: an overview. theory Into Practice, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "41(4), 212-218. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Lakoff, G. (2010). Why it matters how we frame the environment. environmental "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Communication, 4(1), 70-81. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Lee, J. R. (2017). Capitalism and unfairness in Catan: OIL SpRInGS. analog game Studies, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "4(2). Lofgren, E. t., & fefferman, n. H. (2007). the untapped potential of virtual game worlds to "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "shed light on real world epidemics. the lancet Infectious Diseases, 7(9), 625-629. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Lombardi, I. (2012). not-so-serious games for language learning. now with 99,9% more "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "humour on top. Procedia Computer Science, 15, 148-158."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "McGonigal, J. (2011). Reality is broken: Why games make us better and how they can change "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "the world. Vintage Books."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Mcnerney, t. S. (2004). from turtles to tangible programming Bricks: Explorations in physical "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "language design. Personal ubiquitous Computing, 8(5), 326-337. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Messick, D. M., & McClintock, C. G. (1968). Motivational basis of choice in experimental "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "games. Journal of experimental Social Psychology, 4, 1-25. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fjællingsdal and Klöckner"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "651"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Ogershok, p. R., & Cottrell, S. (2004). the pediatric board game. medical teacher, 26(6), "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "514-517. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Olsen, K. S., Winsnes, G., & Svendsen, B. (2013). Brettspill som terapeutisk verktøy [Board "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "games as therapeutic tools]. nordic Journal of Child and adolescent Psychotherapy, 29, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "52-61."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "price, S., Rogers, Y., Scaife, M., Stanton, D., & neale, H. (2003). using \"tangibles\" to promote "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "novel forms of playful learning. Interacting With Computers, 15(2), 169-185."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Ramachandran, V. S. (2011). the tell-tale brain: unlocking the mystery of human nature. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Windmill Books."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Roberts, I. (2011). fate of the WoRlD [PC game]. Red Redemption."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Rogerson, M. J., & Gibbs, M. (2018). finding time for tabletop: Board game play and parenting."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "games and Culture, 13(3), 280-300. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Rogerson, M. J., Gibbs, M., & Smith, W. (2016, May). \"I love all the bits\": the materiality of "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "boardgames [paper presentation]. CHI'16, San Jose, Ca, united States."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Rusca, M., Heun, J., & Schwartz, K. (2012). Water management simulation games and the con-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "struction of knowledge. hydrology and earth System Sciences, 16(3), 2749-2757. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Salen, K., & Zimmerman, E. (2004). Rules of play: game design fundamentals. MIt press. Schell, J. (2008). the art of game design: a book of lenses. CRC press."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Schultz, p. W. (2002). Knowledge, education, and household recycling: Examining the knowl-edge-deficit model of behavior change. In t. Dietz & p. Stern (Eds.), new tools for envi-ronmental protection (pp. 67-82). national academy of Sciences."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 322, "right": 66, "hanging": 320}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Schulze, J., Martin, R., finger, a., Henzen, C., Lindner, M., pietzsch, K., Werntze, a., Zander, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "u., & Seppelt, R. (2015). Design, implementation and test of a serious online game for "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "exploring complex relationships of sustainable land management and human well-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "being. environmental modelling & Software, 65, 58-66. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Sebbane, M. (2001). Board games from Canaan in the Early and Intermediate Bronze ages and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "the origin of the Egyptian SEnEt game. tel aviv, Journal of the Institute of archaeology of "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "tel aviv university, 28(2), 213-230. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Staats, H., Wit, a., & Midden, C. (1996). Communicating the greenhouse effect to the pub-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "lic: Evaluation of a mass media campaign from a social dilemma perspective. Journal of "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "environmental management, 45, 189-203."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Stanitsas, M., Kirytopoulos, K., & Vareilles, E. (2019). facilitating sustainability transition "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "through serious games: a systematic literature review. Journal of Cleaner Production, 209, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "924-936. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Stoknes, p. E. (2017). Det vi tenker på når vi prøver å ikke tenke på global oppvarming [What we "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "think about when we try not to think about global warming]. (2nd ed.). tiden norsk forlag. Strange, J. J., & Leung, C. C. (1999). How anecdotal accounts in news and in fiction can influ-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "ence judgments of a social problem's urgency, causes, and cures. Personality and Social "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Psychology Bulletin, 25(4), 436-449. teuber, K. (1995). the SettleRS of Catan. KOSMOS. Board game."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "tversky, a., & Kahneman, D. (1973). availability: a heuristic for judging frequency and proba-bility. Cognitive Psychology, 5(2), 207-232. tversky, a., & Kahneman, D. (1974). Judgment under uncertainty: Heuristics and biases."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 22, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Science, 185(4157), 1124-1131. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "van der Stege, H. a., van Staa, a., Hilberink, S. a., & Visser, a. p. (2010). using the new "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "board game SECZ taLK to stimulate the communication on sexual health for adolescents"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "652"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & Gaming 51(5)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "with chronic conditions. Patient education and Counseling, 81(3), 324-331."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 322, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Vatne, G. (2013). Klima og flom - i fortid og framtid [Climate and flooding - in the past and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "the future]. In L. M. Bye, H. Lein, & J. K. Rød (Eds.), mot en farligere fremtid? om "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "klimaendringer, sårbarhet og tilpasning i norge [towards a more dangerous future? On "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "climate change, vulnerability and adaptation in norway] (pp. 33-69). akademika forlag. von Borgstede, C., Johansson, L.-O., & nilsson, a. (2013). Social dilemmas: Motivational, indi-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "vidual and structural aspects influencing cooperation. In L. Steg, a. E. van den Berg, & J. I. M."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "de Groot (Eds.), environmental psychology: an introduction (pp. 175-184). BpS Blackwell. Waddington, D. I., & fennewald, t. (2018). Grim fatE: Learning about systems thinking "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "in an in-depth climate change simulation. Simulation & gaming, 49(2), 1-27."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Weingart, p., Engels, a., & pansergrau, p. (2000). Risks of communication: Discourses on "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "climate change in science, politics, and the mass media. Public understanding of Science, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "9(3), 261-283."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Wonica, p. (2015). Learning to evaluate analog games for education. analog game Studies, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "2(4). Woodbury, R. f., Shannon, S. J., & Radford, a. D. (2001). Games in early design education: "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "playing with metaphor. In B de Vries, J van Leeuwen & H achten (Eds.), Computer aided "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "architectural design futures 2001: Proceedings of the ninth International Conference held "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "at the eindhoven university of technology (pp. 201-214). Kluwer academic publishers. Woods, S. (2012). eurogames: the design, culture and play of modern european board games. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Mcfarland."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Wu, J. S., & Lee, J. J. (2015). Climate change games as tools for education and engagement."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "nature Climate Change, 5, 413-418. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Xie, L., antle, a. n., & Motamedi, n. (2008). are tangibles more fun? Comparing children's "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "enjoyment and engagement using physical, graphical and tangible user interfaces. In "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Proceedings of the Second International Conference on tangible and embedded Interaction "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "(teI'08) (pp. 191-198). association for Computing Machinery."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Zagal, J. p., Rick, J., & Hsi, I. (2006). Collaborative games: Lessons learned from board games."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Simulation & gaming, 37(1), 24-40."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 322, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Author Biographies"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Kristoffer S. Fjællingsdal is a phD candidate in environmental psychology and communica-tion at the norwegian university of Science and technology, and a member of a research group on \"citizens, environment and safety\". His interests revolve around the use of educa-tional games in environmental communication, pro-environmental behavioural change and behavioural interventions."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Contact: kristoffer.fjallingsdal@ntnu.no"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Christian A. Klöckner is professor in social psychology at the norwegian university of Science and technology where he leads a research group on \"citizens, environment, and safety\". He is interested in exploring drivers of environmental behaviour, innovative environmental communication, and interventions to change environmentally relevant behaviour. He is the leader of many large national and international research projects in these domains."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 20, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Contact: christian.klockner@ntnu.no"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 0, "firstLine": 0}}}]}]}