{"TYPE": "document", "VALUE": [{"TYPE": "body", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Keynote Talk"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Challenges on the Road to Exascale Computing"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2030, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Dr. Tilak Agerwala "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "VP of Systems "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "IBM Research"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 5040, "right": 5040, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Abstract "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Supercomputing systems have made great strides in recent years as the extensive computing needs of cutting-edge engineering work and scientific discovery have driven the development of more powerful systems.  The first teraflop computer, ASCI Red, came on the scene in late 1996, and now a machine must achieve 5.9 teraflops to gain entry to the very bottom of the Top500 supercomputing list."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1800, "right": 1728, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "With the emergence of petascale supercomputers expected in 2008 or 2009, we have set our sights on the increased capacity and expected muscle of exascale computing.  This has also been the focus of organizations such as the Institute for Advanced Architectures jointly launched at Sandia and Oak Ridge National Laboratories.  However, the challenges of exascale computing will not be solved by the technologies of today."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1800, "right": 1750, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "If today's most power and energy efficient supercomputer was linearly scaled to the exascale level, it would consume around 200MWatts of power, contain over 60 million cores, and require over 400M dollars of memory.  Such a system will present significant problems in management and programmability as current bounds of parallelism are tested.  Data accessibility will also be a significant issue as our ability to sense, generate and calculate on data is growing faster than our ability to access, manage and even \"store\" that data.  These problems only get worse as the system's computational power scales up.  In this talk, I will discuss exascale computing challenges to be overcome in the areas of power, architecture, programmability, management, and data accessibility."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1800, "right": 1748, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Categories and Subject Descriptors: B.m MISCELLANEOUS, C.5.1 Large and Medium Computers"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1800, "right": 2448, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "General Terms: Design"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1800, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Bio "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Dr. Tilak Agerwala is Vice President, Systems at IBM Research. He is responsible for all IBM's Systems research activities worldwide in Deep Computing (for example Blue Gene, hybrid computing, and the DARPA HPCS project), commercial systems (for example BladeCenter, System p, and mainframes) and other exploratory systems research (such as computational biology). This research spans the space from microprocessors and tools to operating systems and systems management, providing key technologies for the next generation computing centers including systems architecture and design. Tilak joined IBM at the T.J. Watson Research Center and has held executive positions at IBM in research, advanced development, development, marketing and business development. His research interests are in the area of high performance computer architectures and systems. Tilak received the W. Wallace McDowell Award from the IEEE in 1998 for \"outstanding contributions to the development of high performance computers.\" He is a founding member of the IBM Academy of Technology and a Fellow of the Institute of Electrical and Electronics Engineers. He received his B.Tech. in electrical engineering from the Indian Institute of Technology, Kanpur, India and his Ph.D. in electrical engineering from the Johns Hopkins University, Baltimore, Maryland."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1800, "right": 1728, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Copyright is held by the author/owner(s)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1404, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ICS'08, June 7-12, 2008, Island of Kos, Aegean Sea, Greece. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "ACM  978-1-60558-158-3/08/06."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1404, "right": 6912, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}