{"TYPE": "document", "VALUE": [{"TYPE": "body", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry Potter and the Cursed Child:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 1114, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Rewriting Stereotypes"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 1114, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "byIlaria Villa"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 1198, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "INTRODUCTION"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry Potter is a very successful series of novels, mainly addressed to children and adolescents. The story is set in a magical world, parallel to our own; it revolves around the lives of the young wizard Harry Potter and his friends, each novel narrating a year of their lives as they go to school, study the magic arts, and fight against the evil wizard Voldemort (Harry Potter and the Philosopher's Stone, 1997; Harry Potter and the Chamber of Secrets, 1998; Harry Potter and the Prisoner of Azkaban, 1999; Harry Potter and the Goblet of Fire, 2000; Harry Potter and the Order of the Phoenix, 2003; Harry Potter and the Half-Blood Prince, 2005; Harry Potter and the Deathly Hallows, 2007)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A reading of the series shows that the purpose of its author, J.K. Rowling, was not only to entertain, but also to contribute to the education of her readers: Harry Potter often tackles issues such as discrimination, human rights, justice and injustice, and the values it puts forward have been examined by several authors (Whited 2004, Heilman 2008, Vezzali et al 2015). The clearest example of this pedagogical purpose is that the"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "133"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "main villains of the story are wizards and witches who discriminate between people who are endowed with magical powers and people who are not ('Muggles'), and who think that only those who come from ancient magical families should be granted a magical education. Those who stand on the right side, on the contrary, fight for the equality of all human beings. Another level of discrimination in the story is that between human and non-human magic people, such as elves, goblins, centaurs, giants, and werewolves, which are often treated as inferior by humans: for this reason, the main characters often discuss the problems and the contradictions of the world they live in. In fact, in some cases, even positive characters have to challenge their own prejudices.1 "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Moreover, an issue which is brought to the attention of the readers is that people are often more complex than what they look like and are not easy to label as 'good' or 'evil': as the story develops, the reader is provided with more information about some characters and is often led to reconsider his/her initial opinion on them. This happens, for instance, in the case of professor Snape, an unfair teacher and unpleasant person, who is believed to be a dark wizard until, after his death, it is revealed that he was an excellent spy who fought for the good side. Another example is the characterisation of Harry Potter's father, James Potter. Since both Harry's parents were killed by Voldemort when Harry was one year old, Harry's knowledge of his parents is based on what their old friends tell him. James Potter is usually described as a brave and good-hearted person; therefore, Harry looks up to him and is honoured whenever someone tells him that he is similar to his father. In Harry Potter and the Order of the Phoenix, however, Harry finds out that James was a bully in his school years. This is the moment when Harry has to accept that flawless heroes do not exist; he has to recognise that his father's behaviour was wrong and, at the same time, he has to understand that even a bully can grow up, change and become a better person."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "It must be said that the real villains of the story, that is to say Voldermort and his acolytes (the \"Death Eaters\") 2, are absolutely and permanently evil, as the plot is based on the classical literary scheme of the fight between good and evil. However, the characterisation of many of the main and secondary characters is realistic and worthy of attention. The protagonists also evolve throughout the books (which, in their entirety, can certainly be considered a Bildungsroman), growing up, recognising their flaws and their mistakes, becoming wiser and more mature."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1 See, for example, the initial horrified reaction of Ron, Harry's best friend and thus a positive character, when he finds out that one of the kindest and most competent of their teachers, Remus Lupin, is a werewolf (Prisoner of Azkaban, 253). Lupin's condition makes it almost impossible for him to find a job in the wizarding world, even if he has actually never harmed a human being: his situation mirrors the stigmatisation of some groups of people in the real world, such as, for example, people with AIDS. Another interesting example, this time of introjected discrimination, is that of house-elves, who work without payment for wizards and witches and who are for the most part convinced that they like being enslaved (for an analysis of slavery and ethics in Harry Potter, see Patterson 2004)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1158, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2 Death Eaters are dark wizards, the closest to Voldemort and the more dangerous among his followers, who want to take control of the magical society to enforce the aforementioned discrimination between ancient magical families and the rest of the people."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1158, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "134"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "THE SLYTHERIN ISSUE,'GOOD' VS.'EVIL'"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Despite the careful construction of themes and characters, some stereotypes in Harry Potter simply remain stereotypes up to the very end: the most obvious case is that of the house of Slytherin. Hogwarts, the British wizarding school, is organised in a way which mirrors real British boarding schools;3 one of the mutual characteristics between Hogwarts and boarding schools is the presence of different houses into which students are divided. The magical element of Hogwarts, in this case, is that first-year students are examined by a mind-reading hat, which sorts them into the four Hogwarts houses on the basis of their personality: Gryffindor is for the brave and chivalrous, Hufflepuff for the just, loyal and hard-working, Ravenclaw for the wise and clever, Slytherin for the cunning and ambitious. During each school year, house points are given to students as a reward either for their behaviour or for their participation in class; on the opposite, points can be taken from houses as a punishment. At the end of each school year, the house with the most points wins the House Cup, and this creates competition and rivalry among the houses. However, people are not only characterised by the personality tracts typical of their own house, but they appear to be either 'good' or 'evil' depending on which house they belong to. It is said many times that Slytherin is the house of most of the dark wizards: Voldemort himself, the supervillain, was a Slytherin when he was a student, and his inner circle of Death Eaters is all made of Slytherins. The problem, of course, is that students are sorted into one of the four houses on their first day of school, at the age of eleven, and their house never changes. In this way, the reader is automatically led to perceive the group of Slytherin students as villains or at least future villains, as if their personality were already settled and there were few possibilities for them to 'redeem' themselves. Also, most of the people (both young and adult) fighting against Voldemort belong to Gryffindor: therefore, Gryffindor's reputation in the story is that of the best house of all, the house of the leaders of the good side, whereas the other two houses seem almost negligible."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "This strong opposition between the 'good' and the 'evil' house is already present in the first book, Harry Potter and the Philosopher's Stone, in which the people Harry meets before going to Hogwarts seem to consider houses as ranging from the best one to the worst one in general: no one seems to care about the fact that each person should, in theory, have their own best house, that is to say the one which suits them best. The arrogant Draco Malfoy, an obvious antagonist, tells Harry \"Well, no one really knows until they get there, do they, but I know I'll be in Slytherin, all our family have been - imagine being in Hufflepuff, I think I'd leave, wouldn't you?\" (Philosopher's Stone, 88); Rubeus Hagrid's remark when Harry asks his opinion is \"Better Hufflepuff than Slytherin [...] There's not a single witch or wizard who went bad who wasn't in Slytherin\" (90); and even Hermione Granger, who is Muggle-born (born in a non-magical family), has already conformed to the general feeling towards houses: \"I've"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "3 For an analysis of this resemblance between Hogwarts and boarding schools, see Iyer (1999) and Steege (2004)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "135"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "been asking around and I hope I'm in Gryffindor, it sounds by far the best, I hear Dumbledore himself was one, but I suppose Ravenclaw wouldn't be too bad\" (117). Hermione's position is even more peculiar if we consider that she immediately stands out as the most brilliant at school (147, 187), which is a Ravenclaw quality; she is also ambitious (150, 170), very respectful of rules (162, 170-177) and hard-working (Chamber of Secrets, 272), whereas she only proves her courage from the end of the first novel onwards."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The reader might think that the initial prejudice towards Slytherin will be challenged at some point in the story, as it happens many times with the prejudices against non-human and semi-human races; however, this never seems to happen. Most of the Slytherin students we meet are children of Death Eaters; the others are arrogant and aggressive or are simply not described. The Slytherin Quidditch team4 when playing behaves in an unfair way (Philosopher's Stone, 204, 207, Chamber of Secrets, 122) and is hated by all the other three houses (183). In the second book, Harry Potter and the Chamber of Secrets, a recurrent theme is Harry's fear that he may have been put in the wrong house and that he could actually belong to Slytherin (214, 224): this fear is dispelled when Harry proves to be a true Gryffindor by means of a symbolic act, that of being able to find and use Gryffindor's sword (358). At the end of the novel Dumbledore himself assures Harry that he is a Gryffindor, because he chose to be one (\"It is our choices, Harry, that show what we truly are, far more than our abilities\", ibid.), and he does not feel the need to make clear that Harry would still be a good person even if he had been placed in Slytherin."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The portrayal of Slytherin students does not change in later books: in Harry Potter and the Order of the Phoenix, for example, Hogwarts is ruled by a wicked and racist member of the Minister for Magic, who limits the students' freedom and creates an \"Inquisitorial Squad\" to control them. Needless to say, the squad is formed by Slytherin students. Even in the last novel, when Hogwarts is in the hands of the evil Death Eaters, Rowling uses these words to describe a secret room where the leaders of the students' resistance have gone into hiding: \"Harry saw the gold Gryffindor lion, emblazoned on scarlet; the black badger of Hufflepuff, set against yellow, and the bronze eagle of Ravenclaw, on blue. The silver and green of Slytherin alone were absent\" (Deathly Hallows, 464-465). The fact that the whole of Slytherin house, and not just some of its students, belongs to the 'dark side' is confirmed one last time at the beginning of the final battle between the good and the evil forces, which takes place at Hogwarts. Before the battle starts, professor McGonagall, a beloved teacher and a very good fighter, arranges for the evacuation of the students from the school, but allows students of age to stay and fight against Voldemort if they want to; however, she invites the house of Slytherin in its entirety to leave (489-491)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The only attempt to redeem Slytherin's reputation may be found in the epilogue, which takes place nineteen years after the final battle. Harry Potter and his friends are"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "4 Quidditch is the favourite sport of witches and wizards and is played on broomsticks. At Hogwarts, each house has its own Quidditch team, which plays against the other teams in the Quidditch championship."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1158, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "136"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "now happy and married, and their children are about to begin their school year at Hogwarts. Harry's second son is worried that he may be placed into Slytherin and Harry reassures him:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"Albus Severus, [...] you were named for two headmasters of Hogwarts. One of them was a Slytherin and he was probably the bravest man I ever knew.\"5"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "\"But just say-\" "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "\"- then Slytherin house will have gained an excellent student, won't it? It doesn't matter to us, Al. But if it matters to you, you'll be able to choose Gryffindor over Slytherin. The Sorting Hat takes your choice into account.\" (607)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry's speech shows that he does not care about house belonging anymore; however, he still implies that his son's choice, if given the possibility, would be Gryffindor - not Slytherin and not one of the other two houses, Hufflepuff and Ravenclaw, which are unrepresented here as they are most of the time throughout the story."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The reason behind the portrayal of Slytherins as the permanent antagonists is, of course, a narrative one. In the Harry Potter novels, the young protagonists do not only have to fight Voldemort and his Death Eaters, who threaten to conquer the magical world, but they also go through a series of minor adventures at school, where they have to face minor antagonists: Slytherin bullies and some unfair (or even dangerous) teachers. The choice to portray such negative young characters is thus understandable; however, since the educational purpose of the novels is clear, the reader would expect the author to challenge, at some point, the implication that a quarter of the Hogwarts students is already evil at the age of eleven and that none of these students would ever fight for the good side."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "As for Rowling's position regarding the way in which she described Slytherin students, she stated in an interview that \"they're not all bad. [...] Death Eaters' children [...] are a small fraction of the total Slytherin population. I'm not saying all the other Slytherins are adorable\" (Hawk 2005). Quite interestingly, she also declared \"A part of the final battle that made me smile was Slughorn galloping back with Slytherins\" (Anelli 2008). Slughorn is a teacher and a Slytherin; he is indeed described as leading the reinforcements during the final battle. However, he is said to have come back to fight together with the friends and families of the students who are already fighting (Deathly Hallows, 588): no Slytherin student fighting against Voldemort seems to be mentioned in the final book, not even at professor Slughorn's side. This means that Rowling 'knows' that, in her universe, some Slytherins have come back to help, but that she did not consider this detail important enough to check if she had explicitly described Slytherin fighters. Also, many Harry Potter readers may never challenge their own ideas about Slytherin, ideas coming, of course, from the way this house has been described in the novels, if they do not come across the author's interviews."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "5 Severus Snape is the war hero mentioned above; even though he is the 'good example' Harry uses to reassure his son, Snape was a dark wizard in his youth and is constantly described as an unfair teacher at Hogwarts (Philosopher's Stone, 150-153, Chamber of Secrets, 207-210)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1158, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "137"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "SLYTHERIN IN FANFICTIONS"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Slytherin issue may seem an issue of minor importance: after all, any young reader needs heroes to identify with and villains to despise. It would also be impossible to imagine she school of Hogwarts without divisions of any sort, because house belonging is a relevant element in the plot of all seven novels. In fact, Rowling's idea to create four houses based on four main personality types was undoubtedly a success, as the amount of house-themed Harry Potter gadgets suggests: Harry Potter fans do not only dream of attending Hogwarts, but they usually imagine which house they would be in, and this sense of belonging creates an emotional attachment to the saga. However, this is precisely one of the reasons why the portrayal of Slytherins may actually be a major issue: since ambitious people do exist, it is inevitable that some readers identify with the personality features of the house of Slytherin; therefore, these readers may feel that 'their' house has not been given a fair treatment in the books."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "It should be added that many fans have been 'officially sorted' into Slytherin when, after the publication of the seven novels, Rowling created \"Pottermore\" (launched in 2011 as a beta version and in 2015 in a renovated version). \"Pottermore\" is an interactive website with all kinds of information and special contents about the Harry Potter world, where people can register and take tests to find out which wand suits them best, which is their guardian animal (the \"Patronus\") and, of course, which house they belong to. With a part of the fans actually labelled as Slytherins, their now official house obviously needed to be given a better reputation. In fact, some attempts have been made on the \"Pottermore\" website itself. In the section \"Features\", for example, we can find several articles trying to shed a positive light on Slytherin, such as Why Hogwarts needs Slytherin house or 5 reasons why you should find yourself a Slytherin BFF [best friend forever]. These, however, are simply online articles: a literary answer to the Slytherin issue was probably needed."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "In order to have a better awareness of the reactions and feelings of Harry Potter readers, it could be useful to look at the stories descending from the Harry Potter lore which have been written by the fans themselves, the so-called 'fanfictions'. The Harry Potter saga is probably the story on which the largest number of fanfictions have been written and published online: if we look at the most well-known fanfiction website, \"FanFiction\", we can see that the stories based on the Harry Potter novels alone are 766,000 (May 2017), more than those of any other 'fandom' (or narrative universe) on \"FanFiction\". Harry Potter is also one of the fandoms with the most fanfictions on the website \"Archive of Our Own\", with 134,408 stories so far. The reason for the flourishing of fanfictions on the Harry Potter world is certainly the great success, in terms of readers and audience, of both the novels and the films of the saga. It could also be said that, since the plot develops over various generations, in a parallel world with its own traditions, customs and history, with a vast number of characters, many of whom are only mentioned or are not completely explored in the novels, the story in itself is particularly fit for rewritings and expansions, as any reader would like to"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "138"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "imagine additional episodes in the lives of the main Harry Potter characters, to give shape to the characters which stand in the background and which are not developed or even to create brand new characters belonging to the Harry Potter universe."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Many of these fanfictions available on the internet talk about Slytherin characters: if we search for the word 'Slytherin' among the titles and summaries of all the fanfictions on Harry Potter on the website \"FanFiction\", we find the impressive number of 15,218 stories (May 2017). The search for the names of the other houses in titles and summaries yields very different results: 9416 for 'Gryffindor', 3028 for 'Ravenclaw' and 2184 for 'Hufflepuff'. The same experiment can be repeated for the other large fanfiction website already mentioned here, Archive of Our Own. On this latter website, the stories of the Harry Potter fandom with the word 'Slytherin' in the title, summary or notes are 4740, significantly more than the ones in which the word 'Gryffindor' appears (2847). Again, the search for 'Ravenclaw' and 'Hufflepuff' gives the lowest numbers as a result (1635 and 1527 respectively). Another search which can be conducted on the website Archive of Our Own is a search by means of the 'tag', that is a label used by fanfiction authors to catalogue their stories, so that readers are able to find stories about particular topics: quite interestingly, a tag which has sometimes been used by these amateur writers is 'Good Slytherins', with 205 stories labelled as such."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "These numbers suggest that Harry Potter fans are interested in writing and reading stories about Slytherin characters - perhaps more interested than they are in writing and reading stories concerning the other three houses, including Gryffindor, the house to which the Harry Potter protagonists belong. Some fans, in particular, apparently need to write and read stories in which the cunning Slytherins can be brave, loyal and clever just as much as the students of the other houses. This interest in the portrayal of characters belonging to what is traditionally known as the 'evil house' could be one of the reasons why the play Harry Potter and the Cursed Child was written."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "THE PLAY BY THORNE, AND THE HOUSE OF SLYTHERIN THEREIN"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry Potter and the Cursed Child was first staged in 2016 in two parts and then published as a book in the same year. The play, \"based on an original new story by J. K. Rowling, Jack Thorne & John Tiffany\", as the cover of the book states, was written by Thorne and directed by Tiffany: since Rowling is not the actual writer nor the main author of this work, as she merely contributed - we don't know in which way - to the creation of the plot, Harry Potter and the Cursed Child may be considered as a sort of 'official fanfiction'. It could be added that the play was staged nine years after the publication of the last Harry Potter novel, therefore it was obviously not included in the author's original plan."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The protagonist of the play is Albus Severus Potter, the second of Harry's three children and the central character in the epilogue of Harry Potter and the Deathly Hallows. In fact, the play begins by recreating the epilogue of the novels and changing it slightly:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "139"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ALBUS pulls on HARRY's robes. HARRY looks down. Do you think - what if I am - what if I'm put in Slytherin..."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY And what would be wrong with that?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ALBUS Slytherin is the house of the snake, of Dark Magic... it's not a house of brave wizards."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY Albus Severus, you were named after two headmasters of Hogwarts. One of them was a Slytherin and he was probably the bravest man I ever knew. ALBUS But just say..."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY If it matters to you, you, the Sorting Hat will take your feelings into account."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ALBUS Really?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY It did for me. (Cursed Child, 9-10)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Interestingly, Harry's remaining bias in favour of Gryffindor is here wiped out: in this scene, Harry does not say \"you'll be able to choose Gryffindor over Slytherin\", as in Harry Potter and the Deathly Hallows, but he is more 'politically correct' and simply refers to Albus's feelings. Therefore, the audience's (and the readers') initial perception is that there is nothing wrong with being sorted into Slytherin and that a good person might belong to any house: this will make them perceive the injustice of the other students' behaviour when, later that day, Albus will actually be sorted into Slytherin."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "On the train to Hogwarts, Albus meets Scorpius Malfoy, son of Harry's old antagonist at school, Draco. Scorpius is a very nice person and Albus gladly remains in his train compartment during the journey; however, Albus's cousin, Rose Granger-Weasley, who is also starting her first year at Hogwarts, has already labelled Scorpius as 'wrong company', because his father was once on Voldemort's side and because there is a false rumour about Scorpius being Voldemort's son. For these reasons, Rose does not even want to come to know Scorpius; she does not feel the need to be polite with him, nor does she hide her dislike for him. Scorpius, on the other hand, remains very kind despite Rose's behaviour (15-16): in this way, she is shown to be the prejudiced one, while the audience is led sympathise with Scorpius, who must bear the burden of being Draco's son."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "During the Sorting ceremony at Hogwarts, Rose is placed into Gryffindor and Scorpius into Slytherin. Albus is placed into Slytherin as well and we know right away that the prejudice towards that house has not changed. When Albus is sorted, the other students' astonishment is underlined by Rose's words: \"this is wrong, Albus\" (21). Then, with a few quick time shifts, we see that Albus is not at all good at Quidditch (his father, on the contrary, was an excellent Quidditch player), that the other students - and even his own brother, James - have begun to make fun of him, that one year later he and Rose have stopped speaking to each other, that being seen in public with Harry makes him uncomfortable:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY It's just people looking okay? People look. And they're looking at me, not you. [...] "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "ALBUS At Harry Potter and his disappointing son."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "140"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY What does that mean?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ALBUS At Harry Potter and his Slytherin son."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "JAMES Slythering Slytherin, stop with your dithering, time to get on to the train."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "(23)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Rose, on the other hand, is the exact contrary of his cousin. She is a Gryffindor as everyone expected, she is successful in both school subjects and Quidditch, and the only thing which worries her seems to be \"whether she'll break the Quidditch scoring record in her first or second year. And how early she can take her O.W.L.s [her fifth-year exams]\" (11)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "When Albus, Scorpius and Rose begin their third year, Lily, the last of the Potter children, is sorted into Gryffindor and Albus is disappointed. Scorpius says to him \"Did you really think she'd come to us? Potters don't belong in Slytherin\" and Albus proudly answers \"This one does\" (Ibid.: 29). Here, for the first time in the Harry Potter universe (the official one, of course), the protagonist and hero, an outcast who can arouse the audience's sympathy, is a Slytherin, as is his best friend, Scorpius, who is kind, funny and good-hearted, whereas Gryffindors are just background characters. The Gryffindor-Slytherin relationship is also completely reversed: in the Harry Potter novels, the Slytherin students - and Draco Malfoy in particular - are the bullies and the Gryffindor protagonists have to face their taunting, whereas in Harry Potter and the Cursed Child the protagonists' lives at Hogwarts are difficult exactly because they are Slytherins. Albus and Scorpius are teased, even bullied, because people make assumptions based on their family - in the case of Scorpius - or because they do not conform with what is expected from them - in the case of Albus:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "SCORPIUS [...] You know how I like to... get on early. Stops people staring. Shouting. Writing 'son of Voldemort' on my trunk. That one never gets old. (55)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ALBUS [...] As he tries to melt into the background, the other students laugh. He looks up at them all. I didn't choose, you know that? I didn't choose to be his son. (29)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Gryffindor young characters of the play, on the contrary, are popular and happy; they do not seem to care about the fact that Albus and Scorpius have no friends except each other, and James, in particular, teases his own brother just because of the house he belongs to."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Later in the play, when Albus and Scorpius steal a Time-Turner (a very rare magical object that can be used to travel through time) to try to save a boy who died many years before, they accidentally create an alternative universe where Rose does not exist because her father, Ron, did not marry Hermione but another classmate, Padma Patil. Albus and Scorpius find out that in this reality Albus is a Gryffindor; however, he still does not have a 'Gryffindor personality', but, as we are informed, he persuaded the Sorting Hat to place him into that house just to spite Ron and Padma's son, Panju, who made fun of him and challenged him by saying that he could not possibly be sorted in Gryffindor (129). The implication is, again, that in any universe Albus should be a Slytherin and that Gryffindors laugh at him because he is different."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "141"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "In fact, even though Albus officially belongs to Gryffindor in the alternative universe, he does not like his house at all and his best friend is still Scorpius, a Slytherin."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The fact that Albus is not at all like his siblings and cousins also creates tension between him and Harry; their difficult relationship is in fact one of the main themes of the play. Interestingly, in the alternative universe where Albus has been placed into Gryffindor his relationship with his father is just as complicated as it is in the 'normal' universe: even though Albus sees this as a demonstration of the fact that their problems do not depend on the house he belongs to (219), it could be remarked that in the alternative universe Albus still hates Gryffindor house (135). In other words, his personality does not change and he remains an outcast in any context. This means that the fact that Albus is a Slytherin is not the cause of his problems, but just a way to underline his uniqueness in a family of Gryffindors and, in general, his being, as already said, 'different'. In the end, however, the tension between Harry and Albus makes Albus the most interesting of the Potter children: when father and son finally reconcile, after a tragic battle back in time in which the main characters witnessed the murder of Harry's parents, Harry reveals to Albus that the two of them are quite similar and that is why their relationship is not easy."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY [...] I'm going to try with everything I've got - to be a good dad for you. ALBUS And I'll try and be a better son. I know I'm not James, Dad, I'll never be like you two- "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "HARRY James is nothing like me. [...] Everything comes easy for James. My childhood was a constant struggle."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ALBUS So was mine. So you're saying - am I - like you?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY smiles at ALBUS."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "HARRY Actually you're more like your mum - bold, fierce, funny - which I like - which I think makes you a pretty great son. (327-328)"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1584, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "If Albus is indeed the most interesting among Harry's children, this is also because his siblings are not given much space, as it happens with most of the young characters in the play, except for Albus himself and for his best friend Scorpius. In fact, it would be difficult to consider Albus's siblings, cousins and classmates as full-rounded characters: this means that the scheme of 'good' and 'evil' characters of the play may be more similar to the original Harry Potter novels than one may expect at first sight.As noted above, the main problem concerning the portrayal of Slytherin students in the Harry Potter novels is that these students do not seem to change or evolve; most of them do not have any background story and only a few of them have an interesting personality. In short, they are not full-rounded characters."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "This also happens in Harry Potter and the Cursed Child. The two protagonists - Scorpius in particular - are thoroughly characterised; the other students, on the contrary, are nothing more than background characters, their thoughts are not explored, and their personality is generally very simple. The Gryffindor young characters do not contribute much to the advancing of the plot and they take no part in Albus's and Scorpius's adventures: their only narrative purpose seems to be that of occasionally appearing to humiliate the two Slytherin protagonists at the beginning of"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "142"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the play (22, 23, 26). In this way, Albus and Scorpius will end up by being perceived as the outcasts of the piece. When the Gryffindors are not making fun of Albus and Scorpius, the narrative purpose of the parts which regard them is probably that of showing that they are happy inasmuch as they are shallow (40-41). On the contrary, Albus and Scorpius have to face many problems as they try to survive in a hostile environment. Therefore, even though the portrayal of Gryffindor and Slytherin here changes, the play is not able to overcome the clear-cut divisions which were already present in the novels."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "CONCLUSION"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The stereotypical portrayal of the house of Slytherin in the Harry Potter books was certainly a problem to be addressed: as said above, the Harry Potter universe probably needed a narrative working - not simply online articles and interviews with the author - that would improve the perception and reputation of the house of Slytherin on the part of the readers."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry Potter and the Cursed Child tries indeed to portray the house of Slytherin by means of a new perspective: the play overturns the canonical portrayal of Gryffindors and Slytherins by creating two interesting Slytherin protagonists, to which audience and readers can relate. However, the Gryffindors are unnecessarily characterised as shallow and mean and they do not seem to evolve throughout the story. Therefore, it could be said that Harry Potter and the Cursed Child simply replaced a stereotype with another stereotype: the play, despite having the merit of tackling issues such as prejudice, stigmatisation, isolation and incomprehension, was not able to avoid an oversimplified portrayal of Gryffindors symmetrical to that of Slytherins in the original novels."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "WORKS CITED"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Anelli M., PotterCast 131 J.K. Rowling Interview Transcript, \"The Leaky Cauldron.org\", "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "2 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "January "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "2008, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "<http://www.the-leaky-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "July cauldron.org/2008/1/2/pottercast-131-j-k-rowling-interview-transcript/> "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "(26 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"Archive of Our Own\", <https://archiveofourown.org> (26 July 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"FanFiction\", <https://www.fanfiction.net> (26 July 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Hawk K., Emerson Sparts and Melissa Anelli - \"The MuggleNet and Leaky Cauldron Interview Joanne Kathleen Rowling: Part Three\", \"Mugglenet.com\", 16 July 2005, updated 19 January 2017, <http://www.mugglenet.com/2005/07/emerson-spartz-melissa-anelli-mugglenet-leaky-cauldron-interview-joanne-kathleen-rowling-part-three/> (26 July 2017) "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Heilman E.E. (ed.), 2008, Critical Perspectives on Harry Potter, Routledge, New York"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "143"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Iyer P., 10 October 1999, \"The Playing Fields of Hogwarts\", New York Times Book"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Review,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 252, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "available"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "online"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "at:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "<http://www.nytimes.com/books/99/"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 274, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "10/10/bookend/bookend.html> (26 July 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Patterson S.W., 2004, \"Kreacher's Lament: S.P.E.W. as a Parable on Discrimination, Indifference, and Social Justice\", in D. Baggett, S.E. Klein, W. Irwin, Harry Potter and Philosophy: If Aristotle Ran Hogwarts, Open Court, Chicago, pp. 152-191."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Rowling J.K., [1997] 2010, Harry Potter and the Philosopher's Stone, Bloomsbury, London."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Rowling J.K., [1998] 2010, Harry Potter and the Chamber of Secrets, Bloomsbury, London."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Rowling J.K., 1999, Harry Potter and the Prisoner of Azkaban, Bloomsbury, London. Rowling J.K., 2000, Harry Potter and the Goblet of Fire, Bloomsbury, London."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Rowling J.K., 2003, Harry Potter and the Order of the Phoenix, Bloomsbury, London. Rowling J.K., 2005, Harry Potter and the Half-Blood Prince, Bloomsbury, London."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Rowling J.K., 2007, Harry Potter and the Deathly Hallows, Bloomsbury, London."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1910, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Rowling J.K., 2011-present, \"Pottermore\", <https://www.pottermore.com> (26 July 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Steege D.K., 2004, \"Harry Potter, Tom Brown, and the British School Story: Lost in Transit?\", in L.A. Whited (ed.), The Ivory Tower and Harry Potter: Perspectives on a Literary Phenomenon, University of Missouri Press, pp. 140-156."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Thorne J., 2016, Harry Potter and the Cursed Child, based on an original new story by J. K. Rowling, John Tiffany & Jack Thorne, Little, Brown, London."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Vezzali L. et al., 2015, \"The greatest magic of Harry Potter: Reducing prejudice\", Journal of Applied Social Psychology, vol. 45 (2), pp. 105-121."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Whited L.A. (ed.), 2004, The Ivory Tower and Harry Potter: Perspectives on a Literary Phenomenon, University of Missouri Press, Columbia, Missouri."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Why "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Hogwarts "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "needs "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Slytherin "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "house, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "\"Pottermore\", <https://www.pottermore.com/features/why-hogwarts-needs-slytherin-house> "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "(26 July 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "5 reasons why you should find yourself a Slytherin BFF, \"Pottermore\", <https://www.pottermore.com/features/5-reasons-you-should-be-best-friends-with-a-slytherin> (26 July 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1008, "firstLine": 552}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "_____________________________________"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Ilaria Villa graduated from the University of Milan in 2015 with a thesis on the trope of the zombie in contemporary television. She is mainly interested in translation studies and in the study of novels, films and TV series belonging to the fantasy, horror and science-fiction genres. She is currently a doctoral student in Linguistic, literary and intercultural studies at the University of Milan."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ilaria.villa90@gmail.com"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 1150, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Saggi/Ensayos/Essais/Essays "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "N. 18 - 11/2017 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "144"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 1358, "right": 1152, "firstLine": 0}}}]}]}