{"TYPE": "document", "VALUE": [{"TYPE": "body", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Exchanging Best Practices for Supporting Computational and Data-Intensive Research, The Xpert Network"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 144, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "Break"}, {"TYPE": "Break"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "eigenman@udel.edu "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "University of Delaware "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Newark, Delaware, USA"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4032, "right": 4032, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ABSTRACT"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "We present best practices for professionals who support compu-tational and data-intensive (CDI) research projects. The practices resulted from the Xpert Network activities, an initiative that brings together major NSF-funded projects for advanced cyberinfrastruc-ture, national projects, and university teams that include individuals or groups of such professionals. Additionally, our recommendations are based on years of experience building multidisciplinary appli-cations and teaching computing to scientists. This paper focuses particularly on practices that differ from those in a general software engineering context. This paper also describes the Xpert Network initiative where participants exchange best practices, tools, suc-cesses, challenges, and general information about their activities, leading to increased productivity, efficiency, and coordination in the ever-growing community of scientists that use computational and data-intensive research methods."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 144, "hanging": 8}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "CCS CONCEPTS"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ware development methods.• Software and its engineering → Programming teams; Soft-"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 10, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "KEYWORDS"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Computational and data-intensive (CDI) research, Xpert Network, CDI research support, Best practices, Collaboration in CDI research"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ACM Reference Format: "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Parinaz Barakhshan and Rudolf Eigenmann. 2022. Exchanging Best Practices for Supporting Computational and Data-Intensive Research, The Xpert Net-work. In Practice and Experience in Advanced Research Computing (PEARC'22), July 10-14, 2022, Boston, MA, USA. ACM, New York, NY, USA, 7 pages."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "INTRODUCTION"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1.1 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Motivation and Key Contributions"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "This paper and its underlying project were motivated by the fact that there appears to be little exchange of information between"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 144, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 236, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "PEARC '22, July 10-14, 2022, Boston, MA, USA© 2022 Association for Computing Machinery. ACM ISBN 978-1-4503-9161-0/22/07...$15.00"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 8, "right": 2304, "firstLine": 10}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the many support groups for computational and data-intensive (CDI) research, which are of critical importance, as outlined in Section 1.2. In particular, knowledge of best practices is usually acquired by \"training on the job\" and not communicated to other projects. Furthermore, many domain science projects, due to bud-getary constraints, use a single computational expert who has little to no access to peers and needs to self-train on such practices. We will argue that the practices exhibit differences from those in gen-eral software engineering contexts, which make their compilation and dissemination especially relevant. Filling this knowledge gap is the key opportunity and contribution of the present paper. We de-scribe the initial outcomes of an initiative that brings together CDI support professionals, which we refer to as CDI experts or, short, Xperts. There are many related terms, such as research software engineers (RSEs), research facilitators, or research programmers. Despite possible differences, we consider the terms synonymous in this paper, as they all support CDI research. Bringing these profes-sionals together through the Xpert Network leads to exchanging best practices and tools, discussing issues that arise in CDI research support, and desirable self coordination among the involved or-ganizations. The present paper describes the outcomes of such activities."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 220, "right": 0, "firstLine": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1.2 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Importance of Supporting Computational "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "and Data-intensive (CDI) Research"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The importance of CDI research is well evidenced. A relentlessly growing amount of computing power is consumed to conduct re-search using computational experimentation. Nobel prizes have been awarded to CDI science breakthroughs [7]. Laszewski et al. have shown that CDI work correlates with higher scientific im-pact [36]. Apon et al. have found that universities investing in com-putational infrastructure supporting CDI research tend to increase in ranking [1]."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Supporting such CDI research by Xperts is critical, allowing domain scientists to focus on their research tasks. Recognizing this need, several large projects funded by the National Science Foundation (NSF) [26], such as XSEDE [43], CyVerse [6], and the NSF Software Institutes, support the community through groups of Xperts. National organizations have emerged, such as the US Research Software Engineer Association (US-RSE) [31] and Re-search Data Alliance United States (RDA-US) [16], that include Xperts for supporting CDI researchers. There are also a growing number of university IT departments, or research computing sup-port groups, that include Xperts for boosting the productivity of"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 222, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "PEARC '22, July 10-14, 2022, Boston, MA, USA"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "researchers on their campuses. Furthermore, many large domain-science projects include computational experts for supporting their own applications. The effectiveness of such computational support is remarkable. A study by XSEDE's ECSS group [9] has revealed that time invested by computational experts can have a four-fold return in terms of time a domain scientist would spend on the same tasks."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1.3"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 16, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Structure and Activities of the Xpert Network"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 112, "right": 432, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Xpert Network [32] is an NSF-supported, community-serving initiative that offers"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "• Monthly online meetings (webinars and panels) to exchange best practices applied, tools used, and open problems faced "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "in computational and data-intensive (CDI) research,"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Face-To-Face Meetings at major conferences, such as PEARC (Practice and Experience in Advanced Research Computing), "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "ICS (International Conference on Supercomputing), and SC "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "(Supercomputing) for in-depth discussions, and"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• A website (sites.udel.edu/xpert-cdi) with access to recordings and reports of past events, a calendar of upcoming events, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "and community announcements."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 326, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Under preparation are also"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 206, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "• A discussion platform for community communication around the clock, and"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• An exchange program that supports participants visiting other participants."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 326, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The ultimate goal of the initiative is to advance science by in-creasing the productivity of researchers who use CDI methods for pushing research frontiers. To this end, several communities are invited to participate in the Xpert Network activities, including (i) researchers developing and using CDI applications, (ii) those who assist these researchers with expertise in CDI technology and methods (Xperts, Facilitators, RSEs), (iii) domain experts/scientists on university campuses and other research organizations, and (iv) developers of tools that support the creation and use of CDI appli-cations. These groups are invited to:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "• Share success stories about how Xperts have assisted domain researchers,"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Present open problems and challenges faced when support-ing CDI research,"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Exchange best practices that are being applied in their orga-nization or in their research,"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Present tools and report on the use of tools that have made a substantial difference in supporting the work of Xperts and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "domain researchers,"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Coordinate activities that are of mutual interest."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 326, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1.4 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Best Practices and Tools Guide"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Two specific outcomes of the discussions of the Xpert Network are the creation of:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "• A best-practices guide for computational and data-intensive research, and"}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "• A catalog of tools that support CDI research and engineering. They will serve as training material for new Xperts joining CDI support teams, for instructional events, and for university curricula."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Parinaz Barakhshan and Rudolf Eigenmann"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 50, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The present paper can be seen as a starting point for such educa-tional material. This material is related to the large volume of best practices for software engineering and scientific programming that exists, but differs in the following significant ways."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "While training material for general software engineering and scientific programming cover important skills that Xperts must have, we are looking for best practices specific to professionals that support domain science teams. We focus on information that is not commonly found in software engineering and scientific program-ming literature, or on advice that is unexpected. We also discuss skills that our participants have called out as especially relevant and those that need to be applied differently in a CDI context."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Since the Xpert Network initiative began three years ago, over 250 people have contributed to the knowledge base through over thirty webinars and three in-person events. Some of the in-person sessions held at major conferences include the ICS19 workshop, the PEARC19, and the SC19 Birds-of-a-feather sessions."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 46, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Xpert Network's participants include major NSF-funded projects for advanced cyberinfrastructure e.g., the Extreme Science and Engineering Discovery Environment (XSEDE) [43], Extended Collaborative Support Services (ECSS) [9], Novel and Innovative Projects (NaIP) [23], The Molecular Sciences Software Institute (MolSSI) [18], Science Gateways Community Institute (SGCI) [30], Campus Research Computing Consortium (CarCC) [28], Virtual Residency (VR) [27], and Cyverse [6], as well as national organi-zations e.g., the US Research Software Engineer Association (US-RSE) [31], Research Data Alliance United States (RDA-US) [16], and campus organizations supporting CDI researchers."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 222, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Through Xpert network events, these efforts have showcased their projects, the types of support they provide to their users, their best practices for developing, debugging, parallelizing, and execut-ing CDI applications, and the tools they have used. The present paper compiles that information. Our past work on several inter-disciplinary projects with domain scientists has also contributed to identifying the best practices described in this paper."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Another important element of our approach is the inclusion of tools. Best practices need to be supported by tools that follow the underlying methodologies. Good tools for scientific software development can boost the productivity of domain science research as much as the best practices themselves. For space reasons, these tools will be discussed in a forthcoming paper, however."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 44, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The remainder of the paper is organized as follows. Section 2 describes the best practices that have emerged in the Xpert Network activities so far. Section 3 describes related efforts on best practices and creating synergy among Xpert groups, followed by conclusions in Section 4."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 46, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "BEST PRACTICES"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "This section describes a set of best practices for professionals who support CDI research involving applications that are compute-intensive (spending most execution time on computational algo-rithms) and/or data-intensive (manipulating large volumes of data). The practices have been compiled from Xpert Network activities as described in section 1.4."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Best Practices for Supporting CDI Research"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Two broad categories of best practices for supporting such re-search have emerged in the Xpert Network activities: (i) best prac-tices related to project collaborations and (ii) best practices for software development. As mentioned in the introduction, the sec-ond category is covered well in the software engineering literature and in organizations focused on training, such as Software Carpen-try [2]."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "This paper considers only those software development practices that have been described by participants as different from general software engineering practices or particularly important for CDI research. Of particular interest are practices that are actionable; we will highlight the recommended actions in each practice. In some cases, the action lies in being aware of something. The following subsection will begin with this category."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 252, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.1 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Diversity of Xpert Backgrounds"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Be aware of different backgrounds Xperts may bring into a team; configure training so that less-familiar best practices can be acquired as needed. Members of Xpert groups may come from domain sciences, from computer science backgrounds, or from environments where they learned to assist CDI science teams through training on the job. For example, working with Unix com-mands, parallel programming models, and version control may be second nature to members with computer science backgrounds, whereas these very skills may be critical best practices to acquire by Xperts with domain-science background. Vice versa, Xperts who have a domain degree are often well aware of the terminology gap discussed in Section 2.5, which facilitates the communication with new science collaborators [10]. Training for Xperts should accom-modate these differences, allowing the trainees to focus on best practices they are not familiar with."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.2 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Understanding the Academic Environment"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Be aware of the academic reward system and activities to in-crease academic standing. An issue for Xperts that is essentially absent in a general software engineering context is the importance of understanding the academic environment. This issue is espe-cially relevant for software engineers with background in industry, where hierarchical organization, and the overriding goal of creating a reliable product as rapidly as possible, are the norm. Understand-ing the academic reward system and the many side activities that researchers may get engaged in to maintain the academic standing of the science team [24, 25] will influence project decisions. In fact, some of the best practices need to be understood from this view point, such as the issues of documentation and testing, mentioned in Sections 2.12 and 2.11."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.3 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Breadth of Xpert Skills Needed"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Prepare for skills needed beyond your current expertise, by networking with other Xperts. Modern CDI applications draw from a broad range of technologies, such as computing paradigms, programming languages, architectures, and algorithms."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 232, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "What's more, this range keeps evolving. For example, new ap-plications may demand expertise of machine learning techniques. Individual Xperts and those in small teams, serving a large CDI research community, will be unlikely to cover the needed skills."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "PEARC '22, July 10-14, 2022, Boston, MA, USA"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Besides, they may need to perform tasks across the entire software life cycle and be involved in project management. It is important to be able to recognize such situations and seek external advice. Main-taining contacts with other Xpert teams, who may be consulted when needed, is highly advisable."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 220, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.4"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Collaborative Assistance Between Xperts and Domain scientists"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 114, "right": 144, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Help propel new projects though short-term, close collabo-ration with domain scientists. A recommended form of interac-tion between Xperts and CDI domain scientists is through collabo-rative assistance. For a period of one to several months, Xperts work side-by-side (physically or virtually) with the domain scientists whose project they support. During the collaboration, the Xpert takes care of computer-engineering issues that arise, while the do-main researcher resolves the problems requiring application science expertise. This form of joint work allows issues that fall into the competency of the collaborator to be addressed immediately, signif-icantly reducing, or even avoiding, the need for domain researchers and Xperts to get trained on each others' knowledge and skills at project begin. Over the course of the joint work, the collaborators tend to pick up sufficient knowledge of each others' skills and ter-minology. In particular, the domain scientist becomes familiar with the software development processes and tools, allowing them to continue the work independently. Vice versa, the Xpert will have acquired sufficient knowledge of the domain problem, allowing them to effectively provide help remotely, even after moving on to other projects. This model has been pioneered by XSEDE's ECSS group and was applied successfully by other Xpert teams [10]."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 220, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.5"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Overcoming the Terminology Gap Between Computer and Domain Sciences"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 114, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Carefully identify and resolve terminology gaps. Keep vo-cabulary to the essentials. Explain using many examples. The gap between computer-science and domain-science lingo is an of-ten mentioned issue in Xpert Network discussions. The challenge can be big if the same term is used by both collaborators, but with different meanings. Participants reported significant confusions and even incorrect project executions due to this challenge. Awareness of the issue and patience in trying to understand the collaborators'viewpoints are critical. It was pointed out that the gap is wider than in a general software engineering context, when trying to understand a customer, as science terminology tends to use rich vo-cabularies that may complicate understanding the problem domain and project requirements. Keeping the vocabularies to the essen-tials and investing time to explain new terms is key to successful collaboration. Using many examples and frequent feedback from both sides will help bridge this gap."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 222, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.6"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Understanding the Domain Problem and Developing a Project Plan"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 114, "right": 144, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Devote substantial time to understanding the domain prob-lem, turning possibly vague ideas into a feasible solution ap-proach, and developing a project plan. Many Xpert Network participants highlighted the importance of the first contact with"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 144, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "PEARC '22, July 10-14, 2022, Boston, MA, USA"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the supported domain scientists and the approach taken to under-stand problems and develop solutions. In addition to awareness of the terminology gap, the relevance of investing time in under-standing the goals and the functional as well as non-functional requirements was emphasized. Showing patience in the process is critical. The domain researcher needs to be helped to transform an initially often vague idea into a concrete plan. Developing specific requirements for the computational application and the underlying system is essential. Devote sufficient time. One challenge for the Xpert is to introduce the researcher to the possibilities of the to-be-created or improved software implementation and the underlying system while introducing only a small number of new terms. Rec-ommendations include the use of many concrete examples and an inverted pyramid approach. The latter describes a possible solution in initially very few, high-level terms, which are then successively refined in discussions."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The situation is again related to that of software engineers with their customers, two important differences being:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "(1) the potentially large terminology gap, mentioned above, and (2) the collaborative assistance situation, which often enables "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "the inverted pyramid approach: As Xpert and domain re-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "searcher work side by side, refinements of high-level ideas "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "can more easily happen over time, permitting the collabo-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "rators to invest their initial effort in defining the tip of the "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "pyramid."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 224, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.7 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Prioritize Functional Requirements"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Carefully vet all requirements by the application's end users and prioritize aggressively. The dilemma of a large number of desirable features but only a short project duration can be big in sci-entific software. Xperts need to learn to tell the difference between essential and desirable requirements users may have. Essential fea-tures should be strictly prioritized. Scientific software is also special in that its requirements can change rapidly as new insights into a research project emerge. Therefore, frequent reassessment and reprioritizing of the requirements are needed [4]."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.8 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Issue Tracking"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Track origin as well as implementation status of require-ments and bug reports. Issue tracking is important in most mid-size and large-size software development. Two points make it a particular concern in scientific applications. The first is the belief that research projects - often of a three-year duration - will remain small and easy to oversee, obviating the need for issue tracking. The second is that developers (typically graduate students and post-doctoral researchers) tend to change often, losing important project memory. The reality is that, even within three years, remembering what feature was requested by whom and with what rationale, can be difficult. After a \"change of guard\", the same will become close to impossible. What's more, successful science applications may turn out to have a long life. Hence, being able to trace a feature request, its implementation status, and the reasons for accepting/rejecting the request to its origin can be key. Furthermore, having a clear record of who made what request can be critical for re-assessing and re-prioritizing functional requirements, mentioned previously."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Parinaz Barakhshan and Rudolf Eigenmann"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Issue tracking tools, which maintain a list of tasks and sub-tasks to be performed, prevent duplicated efforts, and enable collabo-rative work. The tools support requirement traceability, that is, the association of an application update with the requirement that motivated it [38]."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 198}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.9"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Source Code Management and Version Control"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 114, "right": 144, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Make use of source code management and version control systems to track your software's evolution. An Xpert with soft-ware engineering background is well aware of the importance of software version control. At the same time, this importance needs to be advertised to domain experts, as pointed out strongly by the Xpert network participants."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 220, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Many successful science software applications had their origin in a\"toy program\" written by a graduate student. It got gradually ex-panded by several authors, caught the attention of a wide audience, and ended up becoming an important research tool. Without ver-sion tracking, the history (origin, authors, relationship of features, and specific extensions) may no longer be known, making it difficult to extend further and obtain needed documentation. Learning ver-sion control methods and tools will not only help overcome these difficulties; it will also increase the productivity of the software developer as soon as the application exceeds the boundaries of a small program. What's more, source code management tools greatly facilitate collaborative software development [3], enable software roll-back to a previous, well-defined state, and help developers start a new branch of the software. The latter can be important if, say, two graduate students want to add their own, separate feature sets."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.10 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Code Review"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Xpert and domain scientist should review each other's soft-ware written. Code review - a second person reading newly writ-ten software - is one of the best ways to catch errors and also to improve the code. Despite its effectiveness, it is often ignored, unless strictly mandated, and hence warrants mentioning here. A number of additional reasons make this practice particularly useful for an Xpert-domain scientist relationship:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 220, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "• The two collaborators have different backgrounds, increasing the chance of detecting an issue that eluded the other.• The review is effective in verifying that requirement and implementation match."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 546, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "• It is a good way of transferring the knowledge of what the Xpert did to the domain scientist, who will continue the "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "work after the collaboration completes."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 546, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "cellent material for documenting the code and project.• The discussions happening during code review provide ex-"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 546, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Code review helps improve the science as well as the code itself. Research software can benefit from code reviews, as much as in-dustrial software."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 22, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.11 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Software Testing"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Define test cases that the application and its components must pass before you begin their implementation. Testing is another issue that is covered well in the software engineering"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Best Practices for Supporting CDI Research"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "literature. The topic has been mentioned often in our Xpert discus-sions, deserving a place in this list of best practices. Next to raising awareness of the need and the benefit of testing, a key point is that testing must not be an afterthought; one must avoid thinking of test cases only when the software is close to completion. Instead, testing should be considered in the design phase. In the initial com-munication with the domain researcher, the Xpert needs to ask the question \"what test cases should be passed by the application once it is completed?\" Coming up with a thorough set of such cases will not only facilitate the later testing phase; it will also help clarify the specific capabilities that need to be implemented. The implementa-tion of features that do not satisfy any test case can be postponed or even avoided altogether. Designing test cases can go hand in hand with functional requirement prioritization (2.7)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.12 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Documentation"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Document your project to ensure long-term success, repro-ducibility, and obtain proper credit for your work. Software engineering teachings cover extensively the fact that well doc-umented programs are essential for software maintenance and extensibility. Yet, academic software is notorious for the lack of documentation, as pointed out forcefully by Xpert Network partic-ipants. While raising awareness of the benefits is important, one also has to understand that academic processes and reward systems often do not support spending time on documentation (2.2). Most academic research funding pays for showing principles and devel-oping prototypes, not production-ready software. What's more, students are under pressure to graduate, whereby the functionality of the created software is more important than its documentation. If the software becomes successful, the original author often is no longer involved and thus has little incentive to retrofit a proper description. It is often the difficult task of the next generation of students in a team to accomplish these tasks. It helps, however, to understand these relationships. If one can identify the original creator, they may be willing to help, especially when offering them proper credit or co-authorship on a forthcoming publication. Vice versa, properly documenting the original authorship will insure that such credit can be given."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Reproducibility (2.14) of scientific research is a concern that is currently gaining attention. Proper software documentation can be key to reproducibility [3]."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 252, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.13 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Continuous Integration"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Integrate new software updates frequently into the applica-tion version seen by the end users in their end environments. Continuous Integration (CI) is generally good software engineering advice. It catches miscommunicated requirements early. CI also al-lows users to experience new features and provide feedback to the developer early and often. The process may be combined with auto-mated builds and testing, ensuring that new functionality satisfies and continues to satisfy defined test cases."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "CI was mentioned as particularly relevant for the work of Xperts, as scientific software tends to be a moving target with frequent changes of requirements. Ensuring that new features are what the end user had in mind, conform to defined test cases, and do not break previous requirements is critical. Many teams find that this"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4, "right": 232, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "PEARC '22, July 10-14, 2022, Boston, MA, USA"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 50, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "approach leads to significantly reduced integration problems and enables the development of cohesive software more rapidly."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.14 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Reproducibility"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Enable reproducibility and transparency by capturing data and software underlying scientific processes, using available software platforms. While the reproducibility of research results is a key requirement in any domain of science, there is recent, increased focus on this issue in computation-based research. Re-producibility was highlighted as a significant concern in our Xpert Network discussions as well, pointing out that adding supporting software and data to a publication can increase the value signif-icantly. This is of particular importance in large computational studies, where data analysis may play a central role in reaching the conclusions. Transparency regarding the input data, the software underlying the research methods, and the analysis conditions will contribute to achieving consistent results in science projects."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2.15 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Parallelization"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Optimize the code only after it works correctly in serial. The question if parallel code should be written directly, versus creating serial code first, is an open one [20]. The Xpert Network partici-pants were clear, however, in recommending the latter for creating Computational and Data-Intensive (CDI) applications. Among the arguments were that the benefits of lesser complexity of getting the serial code correct first, combined with better tool support for serial code, outweigh the negatives. The primary negative is that certain serial algorithms are intrinsically hard to parallelize. When keep-ing this issue in mind and selecting algorithms that are known to parallelize and scale well, this negative can be overcome, however."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 144, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "3 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "RELATED EFFORTS AND SYNERGY"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "3.1 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Related Work on Best Practices"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A number of papers have recommended practices for scientific programming."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "hanging": 8}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Wilson et al. [39, 40] have provided a set of \"best practices\" and also \"good enough practices\" for scientific computing community from the experiences of the thousands of people who have taken part in Software Carpentry [12] and Data Carpentry [11] work-shops, and from a variety of other guides."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Dubois [8] has described some of his experiences to help writing scientific programs."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Heroux et al. [14] discuss practices used in the Trilinos [13] open-source software library project, some of which are close to practices advocated by the Agile software development community [21]. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Naguib et al. [22] present an overview of two projects and de-scribes the software engineering methods they applied on these computational science and engineering applications."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Wilson [37] talks about the \"common core\" of modern software development that is taught through software carpentry courses [12] to help computational scientists meet the standards that experimen-tal scientists have taken for granted."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Riley [19] advocates bringing knowledge of useful software en-gineering practices to HPC scientific code developers. While not prescribing specific practices, she emphasizes adopting practices that help productivity."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "PEARC '22, July 10-14, 2022, Boston, MA, USA"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Better Scientific Software (BSSw) [5] community is focused on software development, and sustainability that leads to improved software for computational science and engineering (CSE) and related technical computing areas."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 328, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Working Towards Sustainable Software Science: Practice and Experiences (WSSSPE) [41] community meet frequently to discuss the challenges of software for science."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 328, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Software Engineering for Computational Science (SE4Science) [33] community is working to understand the differences, necessities, impacts, and barriers of applying general software engineering practices to research software So that scientific communities can adopt good software engineering practices."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The UK Software Sustainability Institute [17] has worked on fa-cilitating the advancement of software in research by cultivating more sustainable research software."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 288, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "IDEAS [15] community addresses issues of software productivity and sustainability in the Exascale Computing Project (ECP) [29]. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The UCAR [35] Software Engineering Assembly (SEA) [34] is a com-munity for software engineering professionals within UCAR, that addresses the issue of effective software engineering throughout UCAR."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 288, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "While the contributions above provide important, general soft-ware engineering advice for science and engineering applications, in this paper, we focused on practices specific to computational Xperts (a.k.a. Research Facilitators or Research Software Engineers) that support domain scientists. We discussed the best practices related to project collaborations between Xperts and domain sci-entists, which is at the core of such projects. Furthermore, we discussed best practices for software development that are of par-ticular relevance to CDI research. Also discussed are those software development practices that should be applied differently to CDI research than what is advised by general software development guidelines."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 288, "firstLine": 206}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "We reported best practices discussed by participants of the Xpert Network activities, which represent both large projects and indi-viduals involved in such support roles. In addition, our experience working on several interdisciplinary projects with domain scien-tists has also contributed to the emergence of the best practices presented in this paper."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 288, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "It is worth mentioning that even for those practices that are in common between CDI research and general software engineering, the priority and importance of the practices differ considering differ-ent scopes defined for the projects based on different environments (Academic Environment, or Industry) these projects are designed for. While in academic environment a working prototype would be enough to prove a point, in industry we are trying to make a reliable production quality application."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 288, "firstLine": 200}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "3.2"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 16, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Related Efforts in Networking Xpert Groups"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 112, "right": 432, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Xpert Network is related to and collaborates with a number of activities that involve or facilitate idea exchanges among profession-als supporting computational and data-intensive (CDI) research."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 288, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Research Software Engineer Association (US-RSE) [31] is an initiative to create synergy among research software engineer indi-viduals and groups at US universities and other institutions. This is"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 2, "right": 288, "firstLine": 200}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Parinaz Barakhshan and Rudolf Eigenmann"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 50, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "a recent initiative with aims that are similar to those of the Xpert Network, and the two efforts seek to combine forces."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 152, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Campus Research Computing Consortium (CaRCC) effort [28] also aims to engage a similar community as US-RSE, with the pro-fessionalization (professional development and advocacy) of those involved in campus research computing being a particular focus. CaRCC uses the term Research Facilitator, which is closely related to the terms Xpert and RSE."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 152, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Virtual Residency [27] program focuses on training Xperts/ RSEs/ Research Facilitators."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 152, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The The Extreme Science and Engineering Discovery Environment (XSEDE) [43] project includes two thrusts that support CDI applica-tion researchers. The Extended Collaborative Support Service (ECSS) group [9] has a large number of computational and data experts who work collaboratively with domain scientists in improving their applications. The Campus Champions [42] program engages partic-ipants at many university campuses to raise awareness of XSEDE services and help local users accelerate CDI research."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 140, "right": 0, "firstLine": 210}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The CyVerse project [6], supporting data-driven discovery, in-cludes community support services similar to that of XSEDE's ECSS group."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 152, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Related support groups are also part of the NSF Software Insti-tutes, including the Science Gateway Community Institute [30] and the Molecular Sciences Software Institute [18]."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 152, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Xpert Network exchanges ideas with all the above efforts. Best practices identified in this paper may provide training material for the mentioned projects. In addition to presenting best practices, the agenda of monthly Xpert Network webinars include discussions of coordination among the many involved activities, with the overall goal of increasing efficiency in the science community."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 152, "right": 0, "firstLine": 198}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "4 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "CONCLUSION"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 152, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "This paper presented best practices for those who support domain researchers in creating, improving, and running computational and data-intensive (CDI) applications. We refer to these professionals as computational experts, research software engineers, research facili-tators or, short, Xperts. The information in this paper emerged from discussions and reports of the Xpert Network project, over a period of more than three years. The Xpert Network's participants include major NSF-funded projects for advanced cyberinfrastructures, na-tional organizations, and campus organizations that support CDI researchers. This paper also describes some of the best practices identified through our work with domain scientists on several in-terdisciplinary projects. While some of the identified practices have overlap with those presented in general software engineering lit-erature, we have emphasized aspects in which the work of Xpert professionals differs. Although none of these practices will guar-antee error-free software development, when used together, they will reduce the number of errors in scientific software, facilitate its reuse, and save the authors of the software time and effort that can be devoted to addressing the underlying scientific questions. In addi-tion, the paper discussed related projects that support CDI research and how to create synergy within this community. Together, these contributions aim to improve computational and data-intensive science in a significant way."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 150, "right": 0, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Best Practices for Supporting CDI Research"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "ACKNOWLEDGMENTS"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "This work was supported in part by the National Science Foundation under Award No. OAC-1833846."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "hanging": 6}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "REFERENCES "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[1] Amy Apon, Stanley Ahalt, Vijay Dantuluri, Constantin Gurdgiev, Moez Limayem, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Linh Ngo, and Michael Stealey. 2010. High Performance Computing Instrumen-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "tation and Research Productivity in U.S. Universities. Journal of Information "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Technology Impact 10, 2 (Sept. 2010)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[2] Dhavide A. Aruliah, C. Titus Brown, Neil P. Chue Hong, Matt Davis, Richard T."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 70, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Guy, Steven H. D. Haddock, Katy Huff, Ian Mitchell, Mark D. Plumbley, Ben "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Waugh, Ethan P. White, Greg Wilson, and Paul Wilson. 2012. Best Practices "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "for Scientific Computing. CoRR abs/1210.0530 (2012). arXiv "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[3]  I. Schneider. 2019. (Position Paper) Workshop on Best "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Practices and Tools for Computational and Data-Intensive Research in atomic and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "molecular physics. [4] Adam Brazier. 2015h "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Environment. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[5] (BSSw). "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[6] CyVerse. 2020. CyVerse: Transforming Science Thren Discovery."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 70, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[7] prizes for computational science [The Last Word]."}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "in Science & Engineering 14, 06 (nov 2012), 88. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 70, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[8] ubois. 1999. Ten good practices in scientific programming. Computing "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "in Science & Engineering 1, 1 (1999), 7-11."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 70, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[9] ECSS. 2020. XSEDE Extended Collaborative Support Service."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 70, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[10] n and Parinaz Barakhshan. 2019. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "THE XPERT NET-"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "WORK,Workshop on Best Practices and Tools for CoResearch. Report P-29. University Of Delaware."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 288, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "-[11] hing "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "universal data literacy. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[12] Software Carpentry Fouentry-Teaching basic lab skills "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "for research computing. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[13] M. A. Heroux. 2009. Tril[14] Michael A Heroux and James M Willenbring. 2ftware "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "engineering: 10 practices to improve your CSE software. In 2009 ICSE Workshop "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "on Software Engineerin Engineering. IEEE, 15-21."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[15] IDEAS. 2020. IDEAS. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[16] RDA in the United Stae."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[17] te. 2020. UK Software Sustainability Institute. "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[18] Software Institute. 2020. The Molecular Sciences Software "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Institute. "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[19] Argonne y Katherine Riley. 2020. Good Scientific Process "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Requires Software Engineering Practices."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Sf "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[20] mming Massively Parallel "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Processors. In Programming Massively Parallel Processors, A Hands-on Approach,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "PEARC '22, July 10-14, 2022, Boston, MA, USA"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 44, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Second Edition."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 536, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[21] Agile Software Development LLC. 2009. Agile Software Development Home Page."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[22] r) Applying software engineering "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "methods and tools to CSE research projects. Procedia Computer Science 1, 1 (2010), "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "1505-1509."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[23] NaIP. 2022. XSEDE, Novel and Innovative Projects. / "}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[24] Dana Brunson, William Burke, Dirk Col-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "bry, Jeff T. Falgout, James W. Ferguson, Sandra Gesing, Joshua Gyllinsky, Christo-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "pher S. Simmons, and et al. 2019. Cultivating the Cyberinfrastructure Workforce "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "via an Intermediate/Advanced Virtual Residency Workshop. In Proceedings of the"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Practice and Experience in Advanced Research Computing on Rise of the Machines (Learning) (Chicago, IL, USA) (PEARC '19). Association for Computing Machinery, New York, NY, USA, Article 79, 8 pages. [25] Henry Neeman, Marisa Brazil, and DaVirtual Residency: A Training Program for Research Computing Facilitators."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 144, "right": 22, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[26] "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[27] University of Oklahoma. 2019. & Re-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "search, Virtual Residency. [28] CaRCC "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Project. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "2019. "}, {"TYPE": "TabChar"}, {"TYPE": "TabChar"}, {"TYPE": "TabChar"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "rtium, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "https://carcc.org/."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[29] ECP project. 2020. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Exascale Computing Project (ECP). "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[30] "}, {"TYPE": "TabChar"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "15. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Science "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Gateways "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Community "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Institute, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "https://sciencegateways.org/."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[31] US-RSE Project. 2020. U.S. Research Software Engineer Association, https://us-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "rse.org."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[32] Xpert Network Project. 2019. The Xpert Network, https://sites.udel.edu/xpert-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "cdi."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[33] SE4Science. 2020. Software Engineering for Computational Science (SE4Science)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[34] ING ASSEMBLY (SEA). [35] UCAR. 2020. University Corporation for Atmospheric Res"}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[36] i, F. Wang, G. C. Fox, D. L. Hart, T. R. Furlani, R. L. DeLeon, "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "and S. M. Gallo. 2015. Peer Comparison of XSEDE and NCAR Publication Data."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "In 2015 IEEE International Conference on Cluster Computing. 531-532. "}, {"TYPE": "TabChar"}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[37] try: getting scientists to write better code by "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "making them more productive. Computing in Science & Engineering 8, 6 (2006), "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "66-69."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[38] Greg Wilson. 2013. Software Carpentry: Lessons Learned. arXiv[cs.GL] [39] Greg Wilson, Dhavide A Aruliah, C Titus Brown, Neil P Chue t Davis, Richard T Guy, Steven HD Haddock, Kathryn D Huff, Ian M Mitchell, Mark D Plumbley, et al. 2014. Best practices for scientific computing. PLoS biology 12, 1 (2014)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 144, "right": 28, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[40] Greg Wilson, Jennifer Bryan, Karen Cranston, Justin Kitzes, Lex Nederbragt, and Tracy K Teal. 2017. Good enough practices in scientific computing. PLoS computational biology 13, 6 (2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 536, "right": 28, "hanging": 308}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[41] WSSSPE. 2020. Woe: Practiceand Expe-"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "riences (WSSSPE). "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[42] XSEDE. 2020. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "C"}, {"TYPE": "TabChar"}, {"TYPE": "TabChar"}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "[43] cience and Engineering Disvocery Environment."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 228, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "www.xsede.org"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 530, "right": 0, "firstLine": 0}}}]}]}