{"TYPE": "document", "VALUE": [{"TYPE": "body", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}, {"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": []}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Contents lists available at ScienceDirect"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 284, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Arts in Psychotherapy"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2032, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "journal homepage:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"It just gives people hope\": A qualitative inquiry into the lived experience of the Harry Potter world in mental health recovery "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Kelsey V. Tribe , Fiona Ann Papps *, Fiona Calvert "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Australian College of Applied Psychology, Sydney, Australia"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 16, "right": 1440, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A R T I C L E  I N F O"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A B S T R A C T"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 624, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Keywords: "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Creative bibliotherapy Harry Potter "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Mental health recovery Qualitative inquiry"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 1296, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Harry Potter universe is both widely accessible and incredibly popular, and this feature combined with its depth of narrative and genre may make it uniquely suitable to supporting mental health recovery. The current study aims to address a gap in the literature around how engagement with the Harry Potter universe, in the tradition of unguided creative bibliotherapy, may allow people to derive psychologically-relevant meanings from these narratives as part of their mental health recovery journey. Semi-structured interviews were conducted with six individuals who identified as Harry Potter fans, had experienced mental health challenges, and were in re-covery. Interviews were transcribed and analysed inductively to identify themes. Three superordinate themes were established that captured participants' experiences of using Harry Potter along their mental health recovery journey: Early Engagement, Immersive World, and Connection. Although participants employed Harry Potter in creative and individual ways, best suited to their lived experience of mental health recovery, the superordinate themes pointed to several commonalities in how these fans used the series, and these reflected contemporary models of mental health recovery."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 624, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Introduction"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 16, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Translated into 80 languages and encompassing novels, films, games, adventure parks, merchandise, theatre productions and fan participa-tion activities like quidditch competitions and fanfiction, J. K. Rowling's Harry Potter series has been phenomenally successful. This success would not be possible if readers did not feel a strong connection with the world, the story and characters. Connecting deeply with stories can be a therapeutic intervention, known as creative bibliotherapy (Heath et al., 2005). Reading fiction that emotionally transports us into a story is pleasurable and rewarding, and certain fictional stories appear to pro-vide an opportunity to engage safely with our emotional difficulties while the characters we connect with engage with their own (Oatley, 1995). Due to the way that our brains process and comprehend narra-tives, it is proposed that fiction improves our ability to understand other people's perspectives (Altmann et al., 2014), and in sharing the expe-rience with others in the real world, it allows us to form connections and community, the building blocks of mental health recovery (Leamy et al., 2011). The research on this topic remains nascent, and the present study used a qualitative methodology to explore the role that engagement with the Harry Potter universe played in mental health recovery outside of"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 16, "right": 144, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "therapeutic settings from the perspective of six fans who were in re-covery from mental illness."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 156, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Mental health recovery"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 156, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Broadly, recovery from mental health difficulties refers to \"being able to create and live a meaningful and contributing life in a commu-nity of choice with or without the presence of mental health issues\" (Australian Health Ministers' Advisory Council, 2013, p.2). Leamy et al. (2011) developed a model that provides a clear framework to guide recovery-oriented services and clinical practice, and as such is frequently used (Australian Health Ministers' Advisory Council, 2013). The model characterises recovery as an active, iterative, and individual process, with five central categories: connectedness - with peers, the community, and support groups; hope and optimism about the future and the possibility of recovery; identity, including rebuilding or rede-fining a positive sense of identity; meaning and quality in life; and empowerment, encompassing personal responsibility and control over one's own life (CHIME) (Leamy et al., 2011). This model has been uti-lised frequently in mental health research (e.g., Honey et al., 2020; Wallstr¨om et al., 2020). Although many strategies have been used to"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 156, "right": 0, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "* Corresponding author at: Australian College of Applied Psychology, Locked Bag 11, Strawberry Hills, NSW, 2012. Australia. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "E-mail address:  (F.A. Papps)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 116, "right": 2160, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "Break"}, {"TYPE": "text", "VALUE": "evised form 9 March 2021; Accepted 28 March 2021 Available online 1 April 2021 "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "0197-4556/© 2021 Elsevier Ltd. All rights reserved."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 14, "right": 4176, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "support mental health recovery (for example, traditional forms of therapy and psychopharmacology), one currently under-explored strategy that warrants further research is bibliotherapy."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Bibliotherapy and mental health recovery"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Bibliotherapy is various forms of content, often prescribed by a mental health professional, followed by discussion in order to promote reflection, healing, and change (McCulliss, 2012). Bibliotherapy also encompasses the use of fiction as a catalyst for mental health recovery, known as creative bibliotherapy (Heath et al., 2005). Reading and engaging with fictional stories in therapeutic contexts is intended to be a dynamic, interactive process, prompting real emotional responses (E˘geci & Genç¨oz, 2017). Through poems, short stories, novels, and audio-visual media, creative bibliotherapy can be used as a mechanism through which clients make meaning from life experiences, draw upon fictional characters to expand their own worldview and assimilate new knowl-edge (Ellis et al., 2019). Unguided bibliotherapy, with minimal or no professional involvement, has been flagged as a cost-effective and pragmatic intervention (Wang et al., 2020), and there continues to be research demonstrating the therapeutic power of fiction outside of structured clinical contexts, where engaging with stories seems to result in almost incidental improvements in psychological wellbeing (Holman et al., 2019; Levitt et al.; 2009; Pettersson, 2018; Troscianko, 2018). Despite the multiplicity of form, structure and medium, the common thread of creative bibliotherapy (unguided or otherwise) is that the reader experiences a type of growth, insight or recovery as a result of engaging with that story (Canty, 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Creative bibliotherapy has been utilised in fields such as clinical psychology, social work, and community mental health services to improve therapeutic outcomes for children and adults facing mental health challenges (Glavin & Montgomery, 2017). This therapy has been shown to reduce children's internalising and externalising behaviour (Montgomery & Maunders, 2015), improve their social and emotional skills (Heath et al., 2017; Suvilehto et al., 2019), and increase resilience and perceptions of personal and community resources (Theron et al., 2017). For both adults and children, creative bibliotherapy has been shown to reduce symptoms of post-traumatic stress disorder (PTSD) (Glavin & Montgomery, 2017; Vries et al., 2017), and has been found to be an effective, recovery-oriented style of therapy for adults with chronic pain (Billington et al., 2016, 2017)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Creative bibliotherapy-based programs including community reading groups are particularly widespread in the United Kingdom as important low-cost mental health services for vulnerable populations, including female prisoners (McNay et al., 2019) and older adults (Malyn et al., 2020). There has also been research interest in the use of the therapy for a range of conditions, such as addiction (Rus-Makovec et al., 2015), depression (Billington et al., 2010), and eating disorders (Tro-scianko, 2018). Yet, despite the burgeoning popularity of this approach to therapy, the process by which bibliotherapy elicits therapeutic change remains unclear."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Mechanisms of change"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The exact mechanisms through which reading fiction may exert its influence are unknown. Empirical research has shown that fiction is processed differently from non-fiction (Bal & Veltkamp, 2013), with a respective difference in brain activation (Hsu et al., 2015). In a review of the literature, Oatley (2016) postulated that fiction is a vehicle through which people can improve their understanding of others and themselves, and that this stimulates change and growth. We are immersed in stories from birth, and narratives are far more than mere entertainment; they contain real social-cognitive heuristic value (Krueger, 2013). Neural mechanisms suggested as responsible for the therapeutic effect of crea-tive bibliotherapy include stimulation of areas of the brain responsible for theory of mind (ToM), perspective-taking, and affective empathy"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 52, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "identifying emotionally with fellow readers as well. Interpersonality may then function as a crucial precipitant of reading-mediated benefits and may be achieved on both of these levels (within and through story) (Troscianko, 2018). The power of fiction does not just lie in the enriching simulation of social experience then but extends to our actual social world (Farrington et al., 2019; Mar et al., 2009)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Psychology of the Harry Potter World"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The success and broad appeal of the Harry Potter novels, written by J. K. Rowling (1997), has inspired considerable analysis and research across many disciplines, including psychology. According to Thunnissen (2010), the novels essentially deal with the material of psychotherapy that is crucial to human growth and development, interwoven in a compelling fairy tale. The novels, while firmly rooted in the fantasy tradition, encompass many genres at different points, and delve into numerous social and psychological issues, including conflict, trauma, and identity (Vezzali et al., 2015). Rustin and Rustin (2005) also consider the novels to be brimming with psychologically rich material, as Harry Potter faces universal human anxieties such as death and abandonment, and fulfils his dream to find his \"true\" place in the world. Rosegrant posits that the devotion the series commands in fans can only have resulted from the way it broaches deep psychological issues (2009). The monumental success of the Harry Potter novels demonstrates that readers from vastly different cultural backgrounds have felt a strong, positive parasocial relationship with the protagonist, which may have grown with each novel and additional media entry point to this fictional world (Schmid & Klimmt, 2011). The series is exceptionally accessible in this regard; beyond the original seven novels, fans can interact with this fictional world through multiple films, games, appli-cations, interactive websites, theatre productions, college quidditch matches, and many other media."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Harry Potter series has regularly been promoted as a potential tool for mental health recovery itself. Quantitative and qualitative research has been undertaken around the Harry Potter novels to inves-tigate various elements of the text as well as to understand its success and its interaction with many different psychological variables. The series has been investigated for its depiction of resilience, attachment styles, self-harm, and childhood development (Mulholland, 2009), and explored as a potential tool to help children and adolescents cope with grief (Markell & Markell, 2013) or generate therapeutic healing in the context of narrative therapy (Oldford, 2011). Katz (2003) has consid-ered how the Dementors might be utilised to describe and understand inherited trauma, and Frank and McBee (2003) proposed that the first book in the series could be used as a starting point to discussions of identity development in gifted adolescents, in the tradition of Erikson's (1968) theory of psychosocial development. Rosegrant (2009) adds to this, describing how the latter books depict the essential developmental issues specific to later adolescence, and do so in a way that is unique in its depth, detail and complexity. The main child protagonists have been explored as potential resiliency role models in the manner that they positively cope with trauma, loss and dysfunctional family systems (Panos, 2009). On the other side of the therapy room, Gibson (2007), used the first Harry Potter novel to promote the ability to empathise in counselling students, and found that the use of the narrative in this way increased counsellor self-awareness and understanding of counselling concepts. Its genre alone may foster its therapeutic use, as Hsu et al. (2015) found through fMRI neurological research, where participants presented with passages from Harry Potter novels experienced increased activation in the amygdala and increased feelings of pleasure compared to reading passages from other genres. Given the richness of the material and the ease with which readers appear to relate to the protagonist, it is not surprising that the series has been identified by mental health cli-nicians as a recurring source of unprompted insightful discussions occurring in the therapy context, and as such, a potential source of creative bibliotherapy for individuals recovering from mental health"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "3"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 52, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "employed a thematic analysis methodology to undertake analysis of the participants' transcripts. This methodology permitted the researchers to take an appropriately inductive approach to coding the data and developing themes without trying to fit the data into a pre-existing coding frame or theory (Braun & Clarke, 2006), and was therefore able to accommodate the exploratory nature of the investigation."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Participants"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The student researcher interviewed six women, ranging from 19 to 34 years, (M = 26 years, SD = 5.25). Participants needed to be 18 years and older, have sufficient English language skills to participate in the interview without an interpreter, consider themselves fans of the Harry Potter universe, (regardless of the form that took), and consider them-selves as in recovery from mental health challenges. Key participant characteristics are provided in Table 1."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Materials and procedure"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Materials "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "A semi-structured interview protocol of six open-ended questions was developed to explore the participants' experiences of engaging with the Harry Potter universe and recovery from mental health challenges (see Table 2). No pre-existing framework was utilised to develop the interview protocol."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Procedure "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Ethics approval was received by the university ethics committee (Code: 567280220). The student researcher posted the flyer for the study on several Harry Potter related Australian Facebook groups, inviting interested people to contact via email. Compensation was not offered to participants, and all were personally unknown to the re-searchers. After providing written informed consent, participants completed a brief demographic questionnaire. The interviews were conducted over video conferencing software (range 45 min to 1 h and 45 min). Each interview was audio recorded with participants' consent. Following the interview, participants were sent a debriefing sheet with a list of local support services. All interviews were transcribed verbatim, and sent to participants for member-checking, with two weeks allowed for a response."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Table 1 "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Participant Demographics."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 3312, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Pseudonym"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Age first engaged"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Methods of "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "engagement"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 432, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Mental health difficulties"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 106, "right": 144, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Length of recovery period"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 130, "right": 144, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Jo"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Books, games, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "movies, websites "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Books, games, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "movies, websites, fan fiction "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Books, audiobooks, podcasts, ASMR, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "games, movies, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "websites, fan "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "fiction "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Books, audiobooks, movies "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Books, podcasts, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "movies, websites,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 136, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Anxiety and "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "PTSD "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Anxiety, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "depression and PTSD "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Anxiety, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "recurrent "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "depression and low self-esteem, anger issues."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 106, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Anxiety and "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "depression "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Anxiety, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "depression, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "PTSD, Anorexia, OCD tendencies ADHD and "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "anxiety"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 106, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "4 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 130, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Elizabeth"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "10 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 130, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Nancy"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "11 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Less than "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "12 months"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Catherine"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6−7 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Matilda"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "12 months"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Hester"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "14 years"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Books, audiobooks, podcasts, games, "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "movies, websites, collecting "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "merchandise"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 136, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "12 months"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "4"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 52, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Results "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "specifically to support her mental health recovery:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The researchers identified three superordinate themes, Early Engagement, Immersive World, and Connection, with three to four subthemes falling under each theme that described the relationship between these participants' mental health recovery and their engage-ment with the Harry Potter narratives (see Table 3)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Early engagement"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The first superordinate theme, Early Engagement, developed through participants' descriptions of their first memories of engaging with the Harry Potter series. For each participant, this occurred in childhood and involved closely following the novel and film release schedule, where participants effectively grew up alongside the protag-onist, Harry Potter. The participants recounted vivid, positive memories of their early experiences with the universe, and how reading and re- reading the series permitted a return to a sanctuary of safe and happy early memories."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Growing with Harry "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "All participants described being of a similar age to Harry Potter and his friends as they read the books, growing as he grew, building mo-mentum with each successive release, and the strength of the connection with the characters and story due to this sense of shared or related experience. For example, as Elizabeth describes: \"[…] the first time I was reading them, I felt as young as - like I was Harry.\" A core component of this appeared to be the increasing depth and complexity of the novels as the series continued, matching participants' own devel-oping literacy and understanding. For example, Jo stated:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[…] it was released every year that I was growing older. So every year that Harry grew older, I grew older as well, and he was the same age as me basically, so it was a story that grew in the way that I grew, so it was exciting to see, like, the challenges he was up against, and it was a lot more relatable."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Comfort "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Early engagement with the series was an overwhelmingly positive experience for the participants, and each participant spoke about the sense of comfort they felt when they engaged with the series as adults, a sense of returning to something safe and positive from childhood. For example, Nancy said: this to the fact that the series has been a com-panion of sorts since childhood: \"[…] it was very much a… I think very much a comfort thing for me, you know, to go back read the books that I've always, always read and always loved, and they've always been part of my life.\" "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Matilda described employing the series and the sense of comfort"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Table 3 "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Final Themes."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 292, "right": 3888, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Superordinate Theme"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Subthemes"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 754, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Early Engagement"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Immersive World"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Connection"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "• Growing with Harry • Comfort "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Hope "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Re-reading "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Choice in medium • Made manifest "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• In Harry's head "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Characters"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 842, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "- Identification "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "- Modelling "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "- Complexity "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Storylines & themes "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "• Fans"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 3330, "right": 432, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "5"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 52, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "productions. The Harry Potter series is unique in its incredible accessi-bility, where there is seemingly a choice of medium to suit every context, fan, or mood. Each participant had moved beyond the novels and explored multiple other mediums of engaging with the universe. For example, Nancy described writing and reading fanfiction, and how that had deepened her connection with the series: \"I suppose part of it is continuing the universe for me. You know, the books are - I can read the books 10 times but at the end of the day the story still finishes where it finishes.\" For some participants there was a convenience in this wide accessibility, where they could choose to engage specifically with the medium that best met their immediate needs, as Elizabeth stated: \"But yeah, I think I kind of just went to whatever kind of like suited my needs at the time\". Additional elements to read and interact with also appeared to contribute to participants' deep engagement with the series, as Mat-ilda stated when discussing the official Harry Potter website and the ancillary information about the world available there: \"But I kind of liked the additions, and it was just like more to read and more to discover, I guess.\""}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Made manifest "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The availability of activities, locations and merchandise appears to permit fans to truly embed themselves in the Harry Potter universe contributed to participants' experience of both immersion into Harry Potter's world, and the manifestation of his world in ours. Hester described this as part of the reason for her strong connection with the series:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[…] I think of the merch and the things that you can buy for Harry Potter fans, and they're just so real? So, it just really brings magic into reality. […] I can buy a wand that looks so real. And I can buy books that look so real, like from the series or I can you know, you can create crafts that look real…"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Similarly, several participants discussed how they have the option to physically enter Harry's world through visiting various theme parks or film sets. For example, Hester stated:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[…] there's Harry Potter World and you can literally go there and feel like you're in it and it's not just like going to the set of Friends or something like that where you can feel like you're in it, but it's no different to being in your own local coffee shop. You can feel like you're in it and it's another world."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "For several participants, the seeming manifestation of Harry's world is bolstered by the many similarities between his world and our own. As Catherine explained, \"So it's almost like it could, it could be like a spin- off of like this world, because you like share these like historical things.\""}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "In Harry's head "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "A core element of participants' immersion was being situated in Harry Potter's point of view throughout the original novels, and being able to share his experiences, thoughts and feelings. Being in Harry's head as he faces challenges and builds relationships was discussed by all participants as an element that contributed to their absorption into and overall enjoyment of the story for varying reasons. Jo described being in Harry's head as a form of escapism: \"But I suppose through the books, it's also really good because you can just … see a whole new world afresh from his perspective. And that's a pretty exciting point, even if I have reread it and I know the outcome.\" Elizabeth also had this expe-rience of entering a new world with Harry: \"But I think also because like, Harry is so new to that entire environment, when you're reading it you feel like you're with Harry.\" For other participants, being in Harry's head over the course of the plot met a social need. Catherine described this process:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "I think it's like, I guess because the character becomes, it's like he's like a real person, you're so like familiar with like his whole life and like all of his like thought processes and stuff. I feel like it kind of"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 52, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the characters in the Harry Potter series, with no character solely good or evil. The humanity of each main character resonated deeply with par-ticipants, as Hester explained: \"because they're whole characters, and it's not just physical traits, you know.\" This complexity increased the realism of the story for Hester: "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Yeah good people don't necessarily make good decisions and you know what, you know dumb teenage boys make dumb teenage boy decisions and its really very well written in that regard."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Nancy similarly described Harry: "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "But he's um. . he's just very real I think. He's kind of like …He's not just this like, hero character that's constantly going through being heroic, most of the time he's bumbling along and getting lucky along the way, and um you know, sometimes he's really angry and some-times he's really sad."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Participants spoke thoughtfully and empathically about their favourite characters in the series and expressed a deep appreciation for the diversity and personality of each. Jo, who connected strongly with Hermione, stated:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "I like that she's a bit of a moral compass but she's also not perfect. Like she does things that are way out of line and she takes chances and things like that, and she - she yeah, she takes lots of risks like she sets a teacher on fire and all that kind of things like oh, that's not perfect behaviour, but it shows she's human."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Storylines and themes "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "While participants connected with and learned from the characters, several also described important connections with various storylines and themes in the narrative. Hester explained that the most meaningful as-pects of the story were not the overarching messages as one might expect:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "[…] there are themes in there of love and love trumps all and you know …All of those things that you know, they're the bigger themes, but the smaller underlying stories are what will get people through, to my mind […] and that's real. That that could happen to any of us in such - much less dramatic circumstances, but it can happen to any of us."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Catherine described a similar connection with those smaller, more grounded aspects of the story:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Like it's not just, it's not just like his fight against Voldemort, or like these forces or whatever. It's also like, um, dealing with family issues or dealing with, just like personal angst or you know, love interests and that sort of thing. Like his … It's like he has, like a fully-realised actual life. And when you are just kind of like sitting back and looking to escape or whatever, like you can just like pick any one of those things to, to imagine or to tune in to, as opposed to kind of being like, alright, I've played this storyline out like a whole bunch of times."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fans "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Beyond participants' connections within the series, each participant also spoke about connections made through the series, and through the powerful process of being a fan itself. This took various forms. Matilda described connecting with a mental health nurse while undergoing in- patient treatment:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "I used to wait for her to come on shift because it was - it was like, we just talked about Harry Potter the whole shift. And […] that kind of like, really helped as well, with like, at meal times when she was there […] She'd have to like supervise meal times and then like, post meal times so we'd spend a lot of time together. And would just talk about Harry Potter, and that kind of - having that connection as well."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 52, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "7"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 52, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "underyling creative bibliotherapy's effect (e.g., Cohen, 1994; Levitt et al., 2009; Swaton & O'Callaghan, 1999). Identification was also a central part of the psychodynamic model of the therapeutic use of stories, where this process permitted a release of emotional tension as the character the reader has connected with works through familiar challenges, reducing feelings of isolation (Morawski, 1997). When the unique neurological processes involved in ToM and affective empathy are activated through reading fiction, we are able to be emotionally transported by stories and empathetic responses and relational in-ferences are prompted, so that we can connect deeply with characters (Bal & Veltkamp, 2013; Hsu et al., 2015; Oatley, 2016; Zunshine, 2006). These intertwined processes have likely bolstered this process of iden-tification, as well as connection, with the characters in the Harry Potter series. As found in other creative bibliotherapy research, participants drew upon fictional characters for a range of purposes, depending on their needs (Ellis et al., 2019). These imaginative processes and real emotional responses are different for each individual reader, and different in each reading for each individual reader (Oatley, 1995). The complexity of Rowling's characterisations, where no character is solely good or evil, but made up of a realistic mix of traits, seems to be well-suited to precipitate this identification. This characterisation, combined with the way that fiction engages our brain, emotions, and empathy, may provide insight into why Harry Potter fans have sponta-neously used the series to support their mental health recovery."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Interestingly, participants did not appear to be using the Harry Potter series to find meaning or empowerment as part of their recovery journey, nor did they reflect on the series being lacking in this regard. It may be that these are aspects of recovery that are more subtle and difficult to identify or articulate. It may also be that these elements are overall less essential to the process of recovery when it is undertaken in such an informal and spontaneous manner. Future research may want to consider the role that meaning and empowerment play in recovery processes undertaken outside of formal therapy."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Strengths and limitations"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The current research has explored in depth how six Harry Potter fans have informally used the series to support their mental health recovery, and has identified a number of elements of the series that have been central to this process for each participant. The themes that have emerged through this research have been connected with the existing literature on the therapeutic use of stories and models of mental health recovery, and highlighted clear directions for future research. Further-more, the CHIME model may not be socioculturally specific to the Australian context, suggesting that members of other cultural groups may be able to transfer the results of the present research to their own experiences; an issue that could be explored in future research."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "One limitation of the current research was that the participants were all of similar ages, which may have influenced the themes that emerged, particularly around growing up alongside the protagonist and his friends, and how that may have encouraged increasing connection with the series and identification with the characters with each successive release. Interest in and passion about Harry Potter is certainly not limited to this generation, but future research may investigate how much the therapeutic impact of Harry Potter is tied to the generation that grew alongside its protagonist."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 52, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Another key limitation of the research was that only women vol-unteered to participate. As a result, the sample lacks a male voice, as well as the voices of more diverse people. The Harry Potter series re-volves around a male protagonist with predominantly male role models and antagonists, which might suggest that the process of identification and connection that emerged through this research should be facilitated for boys and men. Unequal gender participation in qualitative research has been acknowledged in the literature as a shortcoming, although the drivers behind this phenomenon remain speculative (Butera, 2006). Participation in this research study might have been seen as an"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "8"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 52, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Potter narratives for their recovery journey? The findings demonstrated that participants employed Harry Potter in creative and individual ways, best suited to their lived experience of mental health recovery, yet still paralleling existing research around models of mental health recovery and mechanisms of change underpinning creative bibliotherapy and fiction reading more generally. Participants' descriptions of their use of the series to support their recovery illuminated what is useful about the stories for this purpose. The Harry Potter universe is unique in its accessibility and the range of choice of engagement; participants were able to find a format or formats that best suited their needs at each stage of recovery. The narratives themselves provided a number of elements that fostered this recruitment for recovery processes, including the depth of characterisation and magical subject matter. The successive releases allowed readers to grow alongside the protagonist, and the se-ries' enormous popularity permitted fan engagement and interaction on a deep level, making it evident that the series \"just gives people hope.\" Future research can build on the findings presented above by investi-gating whether more diverse fans of Harry Potter use the series in similar ways."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Funding"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Author note"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The authors acknowledge the support of the Australian College of Applied Psychology in the preparation and writing of this manuscript. The authors note that this organisation had no involvement in the study design; in the collection, analysis and interpretation of data; in the writing of the report; and in the decision to submit the article for pub-lication. Data are available from the second author upon request."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "CRediT authorship contribution statement"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Kelsey V. Tribe: Conceptualization, Data curation, Methodology, Formal analysis, Investigation, Writing - original draft, Writing - review & editing, Project administration. Fiona Ann Papps: Supervision, Methodology, Writing - review & editing. Fiona Calvert: Conceptuali-zation, Supervision, Methodology, Formal analysis, Writing - review & editing."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Declaration of Competing Interest"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The authors report no declarations of interest."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Acknowledgements"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Thank you to Dr Fiona Ann Papps and Dr Fiona Calvert, both of whom provided invaluable support and guidance as my thesis supervi-sors throughout the past 12 months."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "References"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Altmann, U., Bohrn, I. C., Lubrich, O., Menninghaus, W., & Jacobs, A. M. (2014). Fact vs "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "fiction-How paratextual information shapes our reading processes. Social Cognitive "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "and Affective Neuroscience, 9(1), 22-29.  Australian Health Ministers' Advisory Councovery- "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "oriented mental health services: Policy and theory.  "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Bal, ce empathy? An "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "experimental investigation on the role of emotional transportation. PloS One, 8(1)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": ".  "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Billi). An evaluation of a pilot study of a literature-based intervention with women in prison. Liverpool: Centre for Research into Reading,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "9"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 52, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "K.V. Tribe et al. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "The Arts in Psychotherapy 74 (2021) 101802"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Kringelbach, M. L., Vuust, P., & Geake, J. (2008). The pleasure of reading."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Interdisciplinary Science Reviews, 33(4), 321-335.  "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Lea"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "framework for personal recovery in mental health: Systematic review and narrative "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "synthesis. British Journal of Psychiatry, 199(6), 445-452.  "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Levimpan, W., Chaidaroon, S. S., Stanley, C., & Robinson, T. (2009)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The process of personal change through reading fictional narratives: Implications for psychotherapy practice and theory. The Humanistic Psychologist, 37(4), 326-352."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Lincus? Trustworthiness and authenticity "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "in naturalistic evaluation. New Directions for Program Evaluation, 1986(30), 73-84."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Male, C. E. (2020). Reading and writing for well-being: "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "A qualitative exploration of the therapeutic experience of older adult participants in "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "a bibliotherapy and creative writing group. Counselling & Psychotherapy Research, 20 "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "(4).  "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Mar, R. cognition and story comprehension. Annual "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Review of Psychology, 62(1), 103-134.  "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "MarK., & Peterson, J. B. (2009). Exploring the link between reading "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "fiction and empathy: Ruling out individual differences and examining outcomes."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Communications, 34(4), 407-428.  Markell, K. A., & Markell, M. A. (201ter and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "other fictional characters to help grieving children and adolescents. Routledge.  "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "McCistorical and research perspectives. Journal of "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Poetry Therapy, 25(1), 23-38.  McNay, A., Darby-Villis, C., Billings. In "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "J. Billington (Ed.), Reading and mental health (pp. 111-133). Springer.  "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Monbibliotherapy for internalizing, externalizing, and prosocial behaviours in children: A systematic review. Children and Youth Services Review, 55, 37-47."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 0, "hanging": 238}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Morole for bibliotherapy in teacher education. Reading Horizons: "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "A Journal of Literacy and Language Arts, 37(3), 243-259."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 238, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Nocr on the couch. Clinical Child Psychology and "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Psychiatry, 11(4), 579-589.  "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Oatley, K. (1995). A taxonomy oory of "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "identification in fictional narrative. Poetics, 23(1-2), 53-74.  "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Oatl of social worlds. Trends in Cognitive Sciences, 20(8), "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "618-628.  "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Oldford, L. (20n narrative therapy. Journal of "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Integrated Studies, 1(2), 1-12.  "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "PanWeisberg, D. S., Black, J., Goldstein, T. R., Barnes, J. L., Brownell, H., & "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Winner, E. (2016). Does reading a single passage of literary fiction really improve "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "theory of mind? An attempt at replication. Journal of Personality and Social "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Psychology, 111(5), e46-e54.  "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": " "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "  "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "10"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 58, "right": 0, "firstLine": 0}}}]}]}