{"TYPE": "document", "VALUE": [{"TYPE": "body", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}, {"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}, {"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}, {"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Journal of Psychology and Clinical Psychiatry"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 20, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Review Article"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 432, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}, {"TYPE": "text", "VALUE": "Open Access"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 226, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 248, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry potter and the tutors of resilience: an aview of j. k. rolling tales "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Abstract "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Volume 8 Issue 3 - 2017"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 848, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The present work aims to symbolically analyze both the literary and the cinematographic Harry Potter series in accordance with the framework of analytical psychology. Throughout the process described, \"the boy who lived\" symbolizes the injured child, who meets tutors of resilience while attending school. These encounters helped him to confront his wounds and consolidate his identity. At the end of the saga, our hero gives up the unlimited power, overcomes the wound and the defenses, and succeeds in a mature relationship from which a child is born whose name carries the promise of peace and balance to the whole community."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 932, "right": 234, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Keywords:adolescence, hero, anima/animus, literature, narcissism, trauma"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 932, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Fernanda G Moreira "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "Department of Psychiatry and Psychotherapy, Federal University of Sao Paulo, Brazil"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 236, "right": 288, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Correspondence: Fernanda G Moreira, Department of Psychiatry and Psychotherapy, Federal University of Sao Paulo, Brazil, Email "}, {"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 236, "right": 288, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Received: November 10, 2017 |Published: November 20, 2017"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 236, "right": 432, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Discussion"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The evolution of the concept of resilience"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 1132, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The objective of the current study is to symbolically expand the young adult work of Rowling JK,1-7 to understand the role of the tutors of resilience in the school community with the development of an adolescent whose been narcissistically wounded. The main character of Rowling's stories, Harry Potter, is a student at Hogwarts: School of Witchcraft and Wizardry. His adventures gained great popularity and were adapted for the screen resulting in an even larger audience. Gwilym and colleagues measured the impact of these works on the child and young adult population by following emergency room visits for musculoskeletal injuries in the U.K. during the final weeks of summer. Surprisingly, it was found that there was a decrease in emergency room visits during the weeks of the books' release. The author began the article with this provocation: \"about the children of this millennium, we can be sure of two things: they will hurt themselves, and they (probably) will read Harry Potter\".8 The popularity of Harry Potter's story invites investigation, and much has been studied, discussed and written about the works. On Medline, a trusted database for scientific articles on health, a search conducted in April 2013 with the keyword \"Harry Potter\" returned 39 articles of various medical specialties. On the same day, the same search on Google Scholar returned 35,400 results. Academic theses have been written not only in the areas of Liberal Arts, Communications, and Education, but also in Psychology, including Psychoanalysis and Analytical Psychology. The original works include more than 4100 pages of the,1-7 and almost 20hours of movies.9-16 Facing this huge cultural production and the associated scientific production, we do not assume to explore all of the aspects of this saga. The films were considered together with the books, because their images are inevitably present throughout the works, inseparable from the books. Using the reference of analytical psychology, a symbolic analysis was done of both the literary and cinematic works. The study was delimited by the following traumatic axis: Resilience and Tutors of Resilience. We propose that the \"boy who lived\"4 may symbolize the hurt child and the adolescent who meets tutors of resilience who allow for a progressive and healthy development. The works describe seven consecutive years of this hero's life, and begins with the invitation to attend such a school. The epilogue of the saga describes our protagonist's healthy family, which suggests that Harry's development had a good outcome. So we have a story of a mistreated orphan, who throughout his adolescence, even when facing adversity, is able to recapture his development."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 840, "right": 98, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Pinheiro17 highlights that resilience does not mean invulnerability, but rather the flexibility and the capacity to overcome. Infante18 explains that postulating resilience without reducing it to invulnerability implies the assumption that the individual is affected by adversity, but is capable of overcoming. Ralha-Simões19 questions if it is possible to discuss resilience as the physical and psychological survival of a person against risk factors, or the individual who not only overcomes adversities but also feels happy and at peace with his existence. Facing adversities include, necessarily, being affected by them (the opposite care) or they would not be considered true adversities, or the situation of repression in the shadow. Resilience lives in the capacity to, once impacted by adversity, suffer transformations, which, during the process of individualization, result in growth rather than deformity.20 Iraci Galiás, at a post-graduate class given at PUC in 2009, asserted that resilience should be considered a potential in the process of individualization. Ceres Araújo explains that, according to Galiás, following the Jungian approach, it is understood that the potential remedy of the self may be achieved by the constellation of the archetype of the Hero and by the constellation of the archetype of the Divine Child. Or, in the dynamics of resilience, the strength of heroes acting to cope, activated by overcoming as well as the bond with life and the search for something new, are necessary, which are carried by the Eternal Child.21 Some heroic images do not accurately conform to the concept of resiliency. Liliana Wahba22 proposes three profiles of heroes: the hero of reason, the hero of the mission, and the hero of complexity. The hero of reason is the hero of duty. The second type of hero is the missionary, sacrificial hero. While in the first type, evil is external, in the second type, through sacrifice, evil is incorporated and redeemed. Thus, he is equally immutable in his goals. The first two models face adversity without letting it affect them, and consequently, transform them, not representing resilience. In the third model, the hero of complexity, he suffers and is affected by adversity. In this case, there exists a transformative tragic element. The hero of complexity is also gifted with special attributes, but is wounded, suffers adversity, and faces risk; this has a transformative effect. Infante18 separates the study of resilience in two moments. The first generation of researchers of resilience investigated personal characteristics and after, familiars and environments of resilient individuals. The second generation attempts to understand resilience as a dynamic process. Grotberg,23 pioneer of the dynamic notion of resilience, proposes"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 0, "firstLine": 240}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Submit Manuscript | http://medcraveonline.com"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 452, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "J Psychol Clin Psychiatry. 2017;8(3):14-12."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 156, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "©2017 Moreira. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestrited use, distribution, and build upon your work non-commercially."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 4312, "right": 0, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Copyright:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 124, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "©2017 Moreira"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 138, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "that the interaction of resilient factors arises on three different levels: social support (i.e., I have someone to count on), skills (I can), and internal strength (I am) is required. The author organizes the factors of resilience in this triad model and incorporates as an essential element the dynamic interaction of these factors. Melillo et al.,24 stress another element: the individual's interaction with others. Resilience would not be an innate, absolute attribute, but the result of the interaction of the individual with his environment. The authors also detach two other crucial factors: that resilience is a function of social and interpsyche processes, and that it depends on certain qualities of interactions of the individual with others. The evolution of the main character along Rowling's saga seems to follow the path of the construction of the concept of resilience presented to this point, from the initial idea of invulnerability to the dynamic concept. The first chapter of the first book is titled \"The Boy who Lived\",1 In this way, the first emphasis, personal and non-transferable, is given to Harry's capacity to survive. Still in the beginning of this book, alongside the description of abuse, a series of characteristics of resilience and analogies of this archetypal image are presented. One example is the way Harry's hair insists on staying the same way and length independent of what is done to it, without Harry having any conscious control over it. Harry has gifts of magic, similar to divine attributes of a hero, beyond his control a way to defend himself, creating unexplainable situations. The Dursleys, the family who raised Harry, have a true detestation of unexplainable facts or any allusion to magic. Our hero learned to avoid the topic, however without denying his gifts internally. He developed a persona of an obedient and submissive boy, while keeping alive his imaginative capacity and fighting for survival far from the eyes of his tormentors. In spite of the adverse conditions of this development, Harry maintained the capacity for empathy, along with indignation and rebellion. Sometimes, this internal turmoil breaks Harry's well-behaved persona, as shown in the passage of the trip to the zoo on Harry's cousin's Dudley's birthday. After one day of threats and provocations, Harry consoles himself with empathic contact with an anaconda in a tank. This moment is broken by another attack by his cousin. Harry, without knowing how, magically lets the snake go and traps Dudley in the tank. This is a passage showing Harry's lack of control, after all the capacity to control impulses is also a resilient quality. However, our hero's impulsivity does not deny his resilience,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "interactions with his environment, results in a mismatch. But, when well worked, this skill can be a gift, the gold that, at the coming of pathology, hides itself in the shadow, as in the following passage. In the second book, some students begin to antagonize the half-bloods and children of non-wizards. Mysterious attacks on some students increase the tension. Harry succumbs to the pressure and begins to hear voices. The partnership of his companions Hermione and Ron, and Hagrid's reception, the groundskeeper, are essential to the restitution of Harry's balance. At the climax of suspense and adventure, Ginny, then only the younger sister of Ron, Harry's best friend, falls prey to the villain and runs great risk. It is the friendship and companionship of Ron that moves Harry to his second heroic journey. His ability to speak Parseltongue allows him to enter the Chamber of Secrets, the descent to hell, and consequently confronts the shadow/villain. It is the reaffirmation of faith and loyalty to Professor Dumbledore that brings definite help, the phoenix Fawkes carrying the sword of Gryffindor inside the Sorting Hat, combining the \"I am\" smart, fearless, and loyal, and the \"I can\" fly and duel well, and the \"I have\" someone to count on. So, Harry has success in his confrontation - he is able to question himself about his similarities to the villain when he was a student - and rescue the girl who received the villain's spirit throughout the saga. Cyrulnik25 highlights the importance of cautious people, of affective guardians, in the resumption of development. And so, with the help of these guardians, that Harry understands and accepts his Parseltongue ability, which passes from mental symptom to gift. Throughout the book, Harry understands that the voice he heard, and that no one else heard, came from the Basilisk, a monster snake hidden in the basement of the castle and who, freed by the villain, slithered through the walls through the pipes to commit the mysterious attacks. Harry's sensibility to sense danger, arising from his injury as a child, at first is unadapted and generate mental symptoms. In a second moment, once stronger, this sense becomes the weapon with which Harry can enter in the Chamber of Secrets, in the basement of the castle, and rescues the youth from the villain's grasp, saving her life. This rescue would not be possible without external help. The phoenix, a bird that has the symbol of rebirth belongs to Headmaster Dumbledore. He appears to help exactly when Harry, moved by the bond with his headmaster, rises up against the villain when he slanders Dumbledore. The trust of the bond with the cautious figure brings the sword, the discrimination,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 94, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "since resilience is not invulnerability. And the little wizard is only a "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "limiting the shadow."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "pre-teen at the time of the scene. If his development is successful, he will learn to control his impulsivity. According to Araujo (2011), the evaluation of resilience is the degree to which an individual's personal resources equal or exceed his reaction to internal and external stressors. The variation on the levels of resilience reflects the dynamic nature of the concept, and can be observed throughout the saga."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "A feature in itself is neutral, and will only connote resilience or a mismatch depending on how an individual deals with this feature in relation to his environment. One example in Rowling's work is our hero's Parseltongue skills. Throughout the saga, Harry's exceptional skill of speaking to snakes is explained in different ways: heredity, arising from his paternal noble magic ancestry, a characteristic acquired during Voldemort's first attack (which gave him the scar, when Voldemort accidentally transferred some of his powers), a characteristic belonging to a part of Voldemort's soul (which fractured during the first confrontation and lodged itself to Harry, becoming a Horcrux - a black magic artifact that contains a part of Voldemort, guaranteeing him immortality). Similarly, throughout the saga, this skill acquires different connotations, light and shadow: since an element of defense may be voluntary or involuntary, it may be a suspicious sign of Harry approaching, similarly, the dark wizards. Harry's talent, innate or acquired, can lead to pathology if, during"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "In the story of Star Wars, the confidence of the bond and the support of friends at critical moments are exactly what Anakin Skywalker lacks, leading him to the dark side and to become Darth Vader. Anakin is an especially talented youth, \"the chosen one\", like Harry, but has a solitary journey, without friends, aside from a few teachers. As loving as they can be, as is the case with Obi Wan Kenobi, they are vertical relationships, and do not substitute fraternal relationships. When Anakin is activated by the anima and meets his beloved, the meeting is prohibited, which increases his isolation and separates him from his teachers, leading him to receive the guidance from that which would lead him to the dark side. Harry, since arriving at Hogwarts, is surrounded by friends and affective relationships alternating in support, never being truly alone, not even in his moments of nigredo. His teachers remain close, with an empathic welcome, even when his darkest aspects befall. Whether friends or professors, there is no shortage of fraternal relationships or affective guardians that Cyrulnik25 refers to."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 96, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Tutors of resilience"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Melillo et al.,24 observed that in the history of all subjects who showed resilience, there was at least one person (familiar or not) that"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 0, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Citation: Moreira FG. Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales. J Psychol Clin Psychiatry. 2017;8(3):11-12. DOI:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 80, "right": 1296, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Copyright:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 124, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "3"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "©2017 Moreira"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 138, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "accepted them unconditionally, independent of his temperament, physicality or intelligence. These individuals needed to count on someone, and at the same time, feel that their efforts, competency, and self-esteem were recognized and promoted. Cyrulnik25 proposes the term \"tutor of resilience\" for individuals who establish this positive bond. Throughout the saga, there are diverse examples of significant and protective relationships between Harry and tutors of resilience, especially at Hogwarts: School of Witchcraft and Wizardry. During Dumbledore's tenure as Headmaster, power is democratically divided at the school. The responsibility of disciplining student falls upon the"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "their presence evoked flashes of remote memories of the death of his mother, which, besides painful, made the wizard feel close to her, delivering himself to the will of the monsters. The happy memory that allows Harry to conjure the protective spell is precisely his parents' loving look that Harry saw in the Mirror of Erised, the mirror of wishes, during his first year at Hogwarts. During the meetings with the professor, Harry strengthens within himself the memory of primordial love reflected in his mother's eyes, the first mirror in which a child sees his reflection, easing the pain of orphanhood, protecting him from melancholia by the awareness of his mother's love and the"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 96, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "heads of the houses, into which the students are sorted. This works "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "feelings of loss."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "similarly to fraternities at American universities and count on great autonomy. There the students meet their housemates, those who, according to Headmaster Dumbledore, will be like family while living at the castle. The rules at Hogwarts are very strict, however, each head of house, based on each case's circumstances, decides punishments. Despite the tough appearance, Professor McGonagall, head of Gryffindor house, the house were Harry lives, bends the rules of the school during the protagonists' first week of classes when, instead of punishing Harry for an infraction, she notices his special talent to fly on broomstick and nominates him to join the house team. Thus, she bends the rules for first year students to participant in Quidditch games. With this act, the professor values and creates the opportunity for development of Harry's talent, and establishes an affective bond that becomes very important for the boy who had a premature and traumatic break of primary relationships. This bond does not impede her to give a very severe punishment to Harry and his friends when she realizes that they began to put themselves above the rules of the school, demonstrating the recognition and disapproval of the students' inflated egos. McGonagall doesn't undergo the confusion of roles brought on by this growing bond. When Harry asks her to sign an authorization in place of his uncle and aunt, as if they even went through the trouble to read it, she reminds him that only his parents or guardians can sign the form. Both the professor and the student feel the weight of the situation, but these limits preserve the bond. So, McGonagall maintains emotional and firm, expressing the equilibrium between the patriarchal and matriarchal dynamics. The emotion and the balance between the patriarchal and matriarchal dynamic of the professor help Harry and his friends in the development of otherness. Another significant example is the meeting between Harry and Professor Lupin, who teaches him the Patronus spell. To conjure the Expecto Patronum, the wizard needs to concentrate on his happiest memory; the strength of this memory will give him the strength of protection. Such a spell has a special use to banish dementors, beings that have the ability to excise all present joy, and whose presence intensely cools the environment - what an analogy for depression! These creatures bring the saddest memories to light for those being affected. The visual effect of a Patronus is a translucent, ethereal animal, which aside from banishing dementors, can also be used in moments of great need to carry messages or even objects instantaneously, as is observed in the final books of the saga. Every wizard who is able to conjure this spell conjures a specific animal, which can change, depending on emotional circumstances, emphasizing the personal, subjective and emotional character of the spell. Learning the Patronus is especially controversial. Altogether, it cannot be assumed that students are capable of learning it. Due to his exceptional susceptibility to the dementors, Harry seeks Professor Lupin who seems readily available to teach him the protective spell in a series of private lessons. Thanks to the positive transference relationships, our hero becomes the youngest wizard to learn to conjure the Expecto Patronum. During this process, Harry identifies what made him so vulnerable to the dementors (the depression):"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "However, the institutions are also dynamic, and Hogwarts does not always present itself as a health promoting school. Under the rule of Dumbledore, the predominance of human relationships guided by emotion and respect for diversity, composing a healthy school environment, contributes to the psychic stability of the wizard.26 When the situation changes, the fragile balance of our hero vanishes, with plenty of elements coming to the environment and to his own history. He is better organized emotionally, not hearing voices anymore, but succumbing to the depressive and anxious symptoms, including agitated sleep and vivid nightmares. The intervention of other tutors of resilience, the members of the Order of the Phoenix, found outside of school, but through it, help him save his sanity. Among these, Harry's relationship with his godfather Sirius Black deserves to be featured. An especially emblematic dialogue occurs in the fifth film of the series. This story recounts the growth of the shadow of power at Hogwarts: School of Witchcraft and Wizardry under the intervention of the Ministry of Magic, which dismissed Dumbledore and imposed a dictatorial regime. Gerhold27 explains that everything that brought Harry that feeling of being home at Hogwarts was taken away, without the prospect of return. At Christmas, the recently restructured Order of the Phoenix, the resistance group against Voldemort, is reunited at Sirius Black's home. In a private conversation, Harry tells Sirius that he is afraid of becoming a bad person, because he feels an incommensurate amount of anger growing within him. Sirius responds lovingly that Harry is a good person, to whom very bad things have happened. The increasing consciousness of shadow scares Harry. His godfather's welcome in relation to these aspects appeases Harry, helping him to become stronger. Our hero presents an early reflective conscious and recognizes the presence of the shadow. In this passage we see an important characteristic in the dynamic of resilience: the capacity to confront dark aspects, here welcomed lovingly by a tutor of resilience. This capacity, essential in the journey towards individualization, would also serve as a proactive factor in regards to the shadow within the healthy development in adverse situations. However, without the due reception, this same characteristic would serve to deepen depressive symptoms. This was not the only time where Harry depended on the precious support of his godfather. They met at the end of the third book when, after undoing messes, Sirius asserts the symbolic adoption of Harry. For the next two years, until the death of Black, Harry corresponds with his godfather with the intensity that the underground situation permits. It is Black who Harry calls on when he feels frightened by premonitory nightmares of Voldemort, or on occasion of the Tri-Wizard Tournament. It is also Sirius who Harry reports to when he discovers the dark aspects of his father. His godfather is always welcoming, however he does not gloss over reality. Harry suffers tremendously with the death of his godfather, this time welcomed by Headmaster Dumbledore, director of Hogwarts, who remains tolerant and loving with Harry's intense anger in his office. After a true battle between the Order of the Phoenix and the Death Eaters in the rooms of the Ministry of Magic, with Harry"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 94, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Citation: Moreira FG. Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales. J Psychol Clin Psychiatry. 2017;8(3):11-12. DOI:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 80, "right": 1296, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Copyright:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 124, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "4"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "©2017 Moreira"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 138, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "and his friends fighting alongside, and when Sirius Black is killed, Dumbledore takes Harry to his office, being careful to lock the door, the containment also giving them privacy and the restriction of the surroundings. Harry, against the revived pain of orphanhood, reacts with increasing aggression, breaking his professor's things, with his professor watching passively. This tolerance, criticized by the portraits of stupefied ex-headmasters, allowed Harry to become aware of his own aggression. The wizard has his feeling of impotence reflected in his professor's stance. With perfect patience, the headmaster slowly initiates a conversation and lists the facts that led to the Sirius' death, situating the boy in the dynamic of the forces of a war larger than him, accepting part of the blame for what happened and reminding him of Black's decision to participate in the battle. Harry gradually moves from rage to sadness. In the end, Dumbledore apologizes to Harry, explaining his separation from the boy in the last months and promising him to be closer from now on."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Dumbledore's reception did not impede a new period of intense sadness for Harry. But, it prevented that the boy lived a pathological fight, this time excessive rage, the feeling of blame and the desire for death were substituted with sadness. The emergence of the shadow of our hero, immediately after Sirius' death - the appearance of Voldemort at the Ministry, culminating with the invasion of Harry's body, challenging Dumbledore to kill him - was properly contoured with the help of his professor. While someone can triumph against adversity, this same triumph can mark a resilient individual's personality, which is fixed on the identification with the capacity to overcome. From this, Harry runs the risk of being overtaken by the archetype of the hero, becoming the eternal survivor. With the resulting inflation of the ego, an incessant search for adverse situations can occur, confirming a fantasy of invulnerability. A very didactic example of this configuration can be observed in the sixth film of the series. In this episode, during a return trip to Hogsmeade, a wizard town close to Hogwarts, a jinxed magic artifact destined for Professor Dumbledore accidentally curses a student. The trio of protagonists was close by and, with Hagrid, the giant groundskeeper, help take the girl back to the castle. In the movie, Professor McGonagall summarizes the situation by questioning the trio:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 240}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"Why,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 300, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "when"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 6, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "something"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 280, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "happens,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 74, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "it"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 42, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "is"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "always"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 22, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "you"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "three"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 136, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "who"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 18, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "are"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 92, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "present?\""}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "\"Believe"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "me,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "professor,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 86, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "I"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 122, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "have"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 78, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "been"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 116, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "asking"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 42, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "myself"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 148, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "same"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 102, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "question"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "for"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 50, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "six"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 184, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "years.\""}], "style": {"indent": {"TYPE": "CT_Ind", "left": 168, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Ron responds, positioning himself between Harry and Hermione 14."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The fixation of the identity of the ego with the archetype of the hero can be the root of the increase of a shadow of desire for power, for recognition, for proof, and to have recognized an invulnerability that would translate to immortality. A shadow that will fit Harry confronts him in the epic, in the form of Lord Voldemort. However, as described above, several are tutors of resilience that help the wizard in his heroic journey that ends successfully."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Descending to overcome"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "By occasion of Dumbledore's death, Harry, along with his friends Ron and Hermione, is at his most structured personality. His wounds were sufficiently elaborated to reach this stage. As is explained previously, his elaboration is thanks to the help of his friends and tutors of resilience. But there is still much more to overcome, including the grief of his professor, for which our hero has the strength to confront the collective shadow, providing the emergence of the new. To make possible the death of the villain, the trio of protagonists - Harry, Ron, and Hermione - abandon school and go in search of the Horcruxes:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "artifacts that contain parts of Voldemort's soul, holding him to Earth. In this search, marked by the trio's isolation, the shadow of Headmaster Dumbledore's power reveals itself: due to the violence suffered at the hands of three Muggle boys, his younger sister goes crazy irreversibly, ending with the accidental assassination of their mother. The father of the professor withers at Azkaban prison after revenge against the young aggressors. Against this tragedy, Dumbledore was seduced by the dream of wizard supremacy over all creatures, as a protective strategy. With the accidental death of his sister, he became aware of his own shadow, changing position and dueling with that which was once his ally and which would make him a great dark wizard. The emergence of the master's past reveals the shadow of the community as a whole: the experience of exclusion and the projection of the solution in inbred hegemony. It also brings the knowledge of the Deathly Hallows, three artifacts that when united bring invincibility: the Invisibility Cloak, the Elder Wand, and the Resurrection Stone. The Invisibility Cloak makes possible unlimited travel without the individual being seen. The Elder Wand promises the predominance over arising spells of any other wand. Finally, the Resurrection Stone promises to rescue your loved ones from death. Two possible paths arise: destroy the source of immortality of Voldemort or search for invincibility, the absolute power."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 96, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Unconsciously identifying with his professor, Harry succumbs to doubt, paralyzing and destabilizing the trio, whose shadow of mutual jealousy and distrust emerge. The conflicts culminate with Ron's separation, the representing of the emotional function of the group. After his return, regardless of the stabilization, the trio is trapped, thanks to a moment of inflated ego of Harry. Hermione is tortured, reinforcing the image of intolerance associated with the tides of evil. Dolby, a house elf freed by Harry in the second book, helps the trio escape, at the cost of his own life. Although elves constitute a species of magical beings highly subjugated by wizards, only they have the power to escape from the fortress where the protagonists were trapped, a fact that does not go unnoticed by our hero. The wizard changes his attitude, and makes sure to dig by hand a grave for Dobby, giving up his magical powers for the task. His friend is buried in clothes: possessing clothes is what distinguishing free elves from house elves, giving him dignity. The suffering over the death of the elf for whom he had unlimited affection, elaborated by his manual labor, frees Harry's mind from Voldemort's invasions (shadow's invasions), which allows him to think with clarity and decide the path to take. Harry returns to intuit what and where the Horcruxes are and the trio returns to Hogwarts, where the final confrontation takes place. On the journey in search of the means to take down the villain, the isolation and the fear, accentuated by the deglamorizing of his professor, a defensive shadow of the power of the group was fostered. Each character projects his insecurity on one another. Harry, having difficulty exercising his leadership role, begins to secretly yearn for absolute power, sharing fewer of his thoughts, accentuating the distrust of his companions. The prison created by his indiscretion, the image of his friend being tortured, the death of the elf who sacrificed himself to save him, the self-imposed exercise to abdicate his magical powers and submit himself to manual labor, everything together helped Harry to begin to understand the question of power. He returns to his original plan, which his friends never thought was questioned, while intuiting that in the interim, Voldemort finally found the Elder Wand: the desire for absolute power will return to strengthen the darkness (Figure 1)."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 96, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The Deathly Hallows is three, which brings the question of three and four. The group of artifacts composes a triangular mandala, therefore, incomplete. On this mandala, the circle is inscribed in the triangle. The straight line surpasses the circle, which is the smallest of the elements."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 96, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Citation: Moreira FG. Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales. J Psychol Clin Psychiatry. 2017;8(3):11-12. DOI:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 80, "right": 1296, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Copyright:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 124, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "5"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "©2017 Moreira"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 138, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The phallic symbols not only contain but also surpass the symbol of totality, showing the unbalance of the mandala. But what is the meaning of the opposition between threeness and fourness, or rather, what does threeness mean as compared with wholeness? In alchemy this problem is known as the axiom of Maria. ... Between the three and the four there exists the primary opposition of male and female, but whereas fourness is a symbol of wholeness, threeness is not. The later, according to alchemy, denotes polarity, since one triad always presupposes another, just as high presupposes low, lightness darkness, good evil. ... If one imagines the quaternity as a square divided into two halves by a diagonal, one gets two triangles whose apices point in opposite directions. One could therefore say metaphorically that if the wholeness symbolized by the quaternity is divided into equal halves, it produces two opposing triads.28 Through the suffering of his loved ones, Harry is able to control the shadow's possession, giving up the mandala of power and glimpsing the search for transcendence from the narcissistic wound. The way would be the restitution of mortality to the shattered soul of the villain, the destruction of what trapped the fragments of his soul to Earth. With reinvigorated harmony, the trio, recognizing mutually each other's talents, resumes the search initiated by their professor in the beginning of the sixth book. Dash29 associates the fact that the principal villain parted his soul in seven pieces forming the Horcruxes to the problem of the fragmented development of the modern man. Voldemort would never understand the power of a unified soul, which he gave up during his search to overcome death. He searched for immortality while perpetrating violence against others and against himself, without ever realizing the importance of the connection with totality, and of the disconnection that violence brings. Like the villain/shadow, Harry has the potential for aggression, which at the beginning of the saga appears dissociated from his conscious, like an autonomous complex, for example, when Dobby the elf throw Tia Petunia's cake on the floor in the middle of a dinner at Harry's family's home while Harry, even though it was his birthday, had to remain locked in his room. The destructive force emerges when he has to defend himself against his cousin, sometimes counter-attacking frighteningly, to the point of leaving his cousin in a state of emotional shock in the beginning of the fifth book, or when he inflates his aunt like a balloon, or still when he breaks his professor's belongings. This aggression continues to gradually transform and become integrated into his conscience through the welcoming of his tutors of resilience and the fraternal welcome of his friends. He directs and structures his physical identity through sports and competitive games, and begins taking shape thanks to the creative limits of Hogwarts. The importance of transformation and direction, without emasculation, is the difference between sacrifice and mutilation.28-30 If the latter can paralyze or deform development, the former permits the direction of aggressive energy in a creative way, promoting the rupture of the old for the emergence of the new. The search for the Horcruxes is a revisit to the history of the villain/shadow, still called Tom Riddle, since his time at the orphanage, his time at Hogwarts, and until the height of his fame. Two of the artifacts mark the beginning of this history: his wizard grandfather's ring, an alliance with his noble wizard ancestry, over his father's Muggle ancestry; and his diary as a student, a record of his time at Hogwarts, which like the protagonists, would also signify a place of belonging, excluding when his request to join the faculty was denied by Dumbledore, who realized his excessive ambition. Three artifacts belonged to three founders of Hogwarts: the locket of Salazar Slytherin, another homage to his noble wizard ancestry; the cup of Helga Hufflepuff, an object of the founder of the house of unlimited emotion and welcoming that, similar to the Holy Grail for those who sought it, lost its original significance of otherness and in turn mistakenly symbolized patriarchal power; and the diadem"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "of Rowena Ravenclaw, a female adornment which brought wisdom to whomever wore it, which had an equally distorted patriarchal significance, understood as an ostentatious object, distancing itself from chthonic wisdom. The sixth Horcrux is Voldemort's endeared snake, which remits Parseltongue, an innate talent that the villain divides with Harry and carries a distinguished mark, much like the proximity to dark forces. A snake is Slytherin house's animal, the house that carries the most valuable wizard heredity. Serpents carry the symbol of endogamy, of symbolic incest, of uroborus, which can bring death to subjectivity and make impossible the emergence of the new, of the divine child. The last and unplanned Horcrux is Harry himself, descendent of the fourth founder of Hogwarts, Godric Gryffindor. The wizard as a Horcrux would symbolize the risk of fixation on shadow, of the ego's identification with the hero archetype, and of the inflation for power."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 96, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "CT_Empty", "VALUE": "[w:drawing]"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Figure 1"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "The shadow of power is anchored not only in the history of the villain's abandonment, whose mother died through wanes, abandoned by her family for being impregnated by a Muggle and by her lover when he realized she was a witch. All of the houses of Hogwarts contributed with something to the immortality of the defensive shadow of the desire for hegemonic power. Harry's shadow is the shadow of all the excluded, all who show special characteristics not recognized by the status quo. It is the shadow of a society that forgets the importance of the connection with totality and values extreme specialization, dividing the soul into parts to be outsourced, or what leads to a polarized and lame development of individuals. The shadow of recognition of only one part of human ancestry, making immortal the alliance with classic, noble, intellectual ancestry and forgetting the tribal origin, matriarchal and emotional, brings the chthonic wisdom. The shadow of academia is diaries and scientific journals, which maintain the records of success, excluding official publications of negative results, or the imperfection of the method, or the doubt. The shadow of the West who made the Christian message of otherness patriarchal and who does not recognize the knowledge of womanly, caricatured by the incessant search for beauty and recognition. At last, of a society who still have not learned to live in diversity, excluding the different. But we all are different; we all have some eccentric, rejected in one way or another, in some instance. When returning to Hogwarts, Harry partitions the search for the Horcruxes with Dumbledore's army, who showed to be dedicated to the body and soul of the cause, and who actively contribute to the destruction of artifacts of dark magic. During the search, all of the Order of the Phoenix arrive at the castle that would become a plaza of war. During"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 96, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Citation: Moreira FG. Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales. J Psychol Clin Psychiatry. 2017;8(3):11-12. DOI:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 80, "right": 1296, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Copyright:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 124, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "©2017 Moreira"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 138, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "the war, Harry deglamorizes his opposition; first Draco Malfoy, saving his life, and lastly, Severus Snape, posthumously peering into his memories. There remains his confrontation with his greatness shadow: the omnipotent guilt he feels for his survival among his loved ones, which brings him to the desire, equally omnipotent, to surpass his own death. Harry enters the Forbidden Forest, wearing the Invisibility Cloak, a relic passed down by his father, carrying a present from Dumbledore: the Resurrection Stone, the last of the Deathly Hallows. Feeling his courage fade, Harry uses the stone to meet with all those who, in his mind, died for him: his parents, Sirius Black his godfather, and Remus Lupin, the professor who recently died fighting in the castle. At this meeting, he is greeted by everyone's smiles and by the gaze and admiration of his parents. The wizard apologizes to them, and as a response they assert the reasoning behind their deaths: the fight for a better world. At last, he realizes that they all are a part of him, and that he would never be alone. With the integration of the loving memories, the internalization of the tutors, Harry finally begins to formulate his grief. Recognize the resource that Jung called the active imagination as in the diverse moments of the saga. The four, his parents, his godfather and his professor, accompany him until he is standing across from Voldemort, surrounding by Death Eaters. Once targeted by the Lord of Darkness, hero and villain fall unconscious, each one on one side. Voldemort quickly wakes up and rises weakly and believes he has killed our hero, who is carried back to the castle by a sobbing Hagrid, surrounding by Death Eaters who follow their leader. Voldemort ignores that he has now returned to a mortal state."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "During this, Harry has a conversation with his headmaster, at a very clean and bright place, that the wizard identifies as King's Cross station. At this station, or a hazy clear and bright place, Harry has his last meeting with Dumbledore who is very proud of his student. They discuss the Deathly Hallows and about Dumbledore's life, and who in tears, admits his wrongdoings. The professor, an image of his internal curator, enlightens that Harry has the option to move forward into death or to return to life, saying that his return to life and not his death could save many lives, as Harry believed because of his omnipotent guilt arising in grief not yet elaborated. Harry understands his connection to Voldemort and his mission and chooses to finish his task, not before the ultimate question:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 240}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "win fame for \"doing the right thing\", or Achilles, who gives up future generations of descendants to \"immortalize the name for generations\", or Getúlio Vargas, who \"left life to enter into the history of Brazil.\" Harry delivers himself to the confrontation with the villain, devoid of narcissistic defenses. He acts anonymously, without saying goodbye to avoid commotion. The identity that he had denied for so many years is reintegrated, and Harry returns from the confrontation matured. Of the three Deathly Hallows, Harry leaves the Resurrection Stone on the ground of the Forbidden Forest, buries the Elder Wand in Dumbledore's tomb, and keeps for himself the Invisibility Cloak, the only of the three with the exclusive purpose of defense. The great defense of the cloak is to disappear from sight of others, the opposite of the fame of glory. Thanks to the cloak, Ignoto Peverell was the only of the three brothers, creators and carriers of the Deathly Hallows, to have a long life and natural death. He lived his whole life anonymously, in the village of Godric's Hollow, which materializes the utopia of wizards and Muggles living harmoniously. It is not much more than a small unimportant and unknown village in England, where Harry was born and his parents lived. It is the antithesis of ego inflation, strengthened further socially in the environment, and that Harry overcomes when leaving adolescence and integrating his adult identity. Before burying the Elder Wand, the wizard reconstructs his own wand, which chose him when he was 11years old. He feels better with this wand. With the origin reintegrated, he can finally reunite romantically with Ginny. With the entrance of feminine power of the specialist in boogeymen, the expert in seeing fear as ridiculous, the trio of protagonists becomes a group of four. Harry Potter, the boy who lived, son of Lily and James Potter who died to lovingly save Harry's life, marries Ginny, member of a traditional wizard family who dared to deny the solution of endogamy as a defense, and whose greatest power is humor and emotion. Nineteen years later, the couple makes an indication of the possibility of the conscious union of two opposites by giving their son the name Albus Severus Potter. This union of the names of Albus Dumbledore and Severus Snape are the greatest representations of Gryffindor and Slytherin, respectively. These houses, which represent the polarity between inclusive diversity and exclusive homogeneity throughout the saga, are united and revealed by our hero's son. The symbol of the divine child brings a new forthcoming that point to the possibility of integration of these polarities and the hope the war for"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 96, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "-Tell"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "me"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "something,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "said,"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "is"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "this"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 82, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "power will end in the next generations."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 112, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "real?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Or"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "is"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "this"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "all"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "happening"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "in"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "my"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "mind?"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 122, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Dumbledore gave him a big smile, and his voice sounded strong and loud in Harry's ears, although the bright mist was descending and blocking the figure."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 98, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "-Of course this is happening in your mind Harry, but why does that mean this isn't real?.7"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Through the process of internal dialogue, a rich example of an"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 360, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Acknowledgements "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Liliana Liviano Wahba, for the orientation of the monographs that originate this paper."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Conflict of interest "}, {"TYPE": "Break"}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Author declares there are no conflicts of interest."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 96, "right": 1296, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "active imagination, Harry elaborates on his dilemmas, conflicts and traumas, and differentiates himself from the villain with the shattered soul. Becoming the lord of death does not restrict him from collecting the Deathly Hallows and wishing for an eternal life, but to understand that death is inherent to life; life and death are members of the same"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 82, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Funding "}, {"TYPE": "Break"}, {"TYPE": "text", "VALUE": "None."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 2160, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "References"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 112, "right": 0, "firstLine": 0}}}]}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "process. The desire of invulnerability would lose its meaning. Our hero would glimpse the connection with totality, undoing his ego's identification with the archetype of the hero. Harry entered the Forbidden Forest without wanting to be seen, escorted by only the memory of those who loved him, and presented himself to the Lord of Darkness without defending himself. The memory of his parents and of his tutors of resilience helps him to confront his shadow, activating the internal curator and avoiding fixation. Our hero acts in the opposite of Rick Blaine, the character portrayed by Humphrey Bogart in Casablanca, who gives up his beloved woman to patriarchically"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 120, "right": 186, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "1. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 188, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "2. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 188, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "3. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 188, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "4. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 188, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Citation: Moreira FG. Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales. J Psychol Clin Psychiatry. 2017;8(3):11-12. DOI:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 80, "right": 1296, "firstLine": 0}}}, {"TYPE": "table", "VALUE": [{"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 60, "right": 0, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Copyright:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 124, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "7"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}]}]}, {"TYPE": "table-row", "VALUE": [{"TYPE": "table-cell", "VALUE": []}, {"TYPE": "table-cell", "VALUE": [{"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "©2017 Moreira"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 138, "firstLine": 0}}}]}, {"TYPE": "table-cell", "VALUE": []}]}]}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "5. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 300, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "6. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 300, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "7. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 300, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "8. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 300, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "9. Harry Potter and the Philosopher's Stone. Directed by Christopher "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Columbus. Warner Bros, USA & UK. 2001."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 300, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "10. Harry Potter and the Chamber of Secrets. Directed by Christopher "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Columbus. Warner Bros, USA & UK. 2002."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 240, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "11. Harry Potter and the Prisoner of Azkaban. Directed by Alfonso Cuarón. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Warner Bros, USA & UK. 2004."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 240, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "12. Harry Potter and the Globet of Fire. Directed by Mike Newell. Warner "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Bros, USA & UK. 2005."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 240, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "13. Harry Potter and the Order of the Phoenix. Directed by David Yates. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Warner Bros, USA & UK. 2007."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 240, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "14. Harry Potter and the Half-Blood Prince. Directed by David Yates. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Warner Bros, USA & UK. 2009."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 240, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "15. Harry Potter and the Deathly Hallows-part1. Directed by David Yates. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Warner Bros, USA & UK. 2010."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 240, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "16. Harry Potter and the Deathly Hallows-part2. Directed by David Yates. "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Warner Bros, USA & UK. 2011."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 240, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "17."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 0, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "18. Infante FA. Resiliência como Processo: Uma Revisão da Literatura "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "Recente. In: Aldo Melillo, et al. Resiliência. 2005;23-38."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 240, "right": 144, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "19. Ralha-Simões H. Resiliência e desenvolvimento pessoal. Em: Tavares "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "(Org.), Resiliência e educação. Cortez, São Paulo, Brazil. 2001."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 124, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "20. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 124, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "21. Araujo CA. Introdução: Resiliência ontem, hoje e amanhã. Em: Araujo CA, Mello MA, Rios AMG Resiliência: Teorias e Práticas de Pesquisa em Psicologia.: Ithaka Books, São Paulo, Brazil. 2011."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 404, "right": 100, "hanging": 280}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "22. Wahba LL. Nosso Herói Atual: Um Herói da Complexidade. Desafios da prática: o paciente e o continente:Anais do II Congresso Latino-Americano de Psicologia Junguiana. Lector, Brazil. 2003. p.217-223."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 404, "right": 0, "hanging": 280}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "23. Grotberg EH. Introdução: Novas Tendências em Resiliência. Em: Em: Melillo A, Néstor E, OJEDA S. Resiliência: descobrindo as próprias fortalezas. Artmed, Porto Alegre, Brazil. 2005."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 404, "right": 100, "hanging": 280}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "24. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 124, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "25. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 124, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "26. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 124, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "27. Gerhold C. The Hero's Journey Through Adolescence: A Jungian Archetypal Analysis of Harry Potter. PhD diss., The Chicago School of Professional Psychology. Chicago, USA. 2010."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 404, "right": 100, "hanging": 280}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "28. Jung CG. The Phenomenology of the Spirit in Fairytales. The Archetypes "}, {"TYPE": "TabChar"}, {"TYPE": "text", "VALUE": "and the Collective Unconscious, CW. 1942; 9-1."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 124, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "29. "}, {"TYPE": "TabChar"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 124, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "30. Jung CG. Símbolos da Transformação, CW 5. 1913/1973."}], "style": {"indent": {"TYPE": "CT_Ind", "left": 124, "right": 0, "firstLine": 0}}}, {"TYPE": "paragraph", "VALUE": [{"TYPE": "text", "VALUE": "Citation: Moreira FG. Harry potter and the tutors of resilience: an analytic view of j. k. rolling tales. J Psychol Clin Psychiatry. 2017;8(3):11-12. DOI:"}], "style": {"indent": {"TYPE": "CT_Ind", "left": 80, "right": 1296, "firstLine": 0}}}]}]}